{"windows":[{"symptom":"can get “out of s mode” GET button to work        i can’t get the “out of s mode” switch in the microsoft store to work. i keep getting a message that the problem is on their end. what’s going on? i need to download an app before i can use my program","solutions":["Others are having a similar problem. Looking at the previous post contact local support as per Smeed in this thread.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/cant-get-out-of-s-mode\/30c58888-334f-4587-b7eb-353e51ecc1f6","Hi pckhey, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.We have seen many cases regarding switching out of S mode lately so fair enough to assume the issue is from Microsoft side.Please wait for 24 hours and if it does not get resolved let us know."]},{"symptom":"Windows 10 can't see my 5GHz WiFi router band        Why can't my laptop running Windows 10 connect to my 5 GHz WiFi Band? It doesn't even appear in the list.","solutions":["Hi Jonathan Being able to 'see' a 5Ghz network depends on the network adapter you have on your PC . . .Open Device Manager (accessible by right clicking your Start Menu) Expand the Network Adapters section What is the model of Wireless (WLAN) device is listed there?","Qualcomm Atheros AR9485 802.11b\/g\/n WiFi Adapter","Hi Jonathan According to the data sheet, the Qualcomm Atheros AR9485 only supports 2.4Ghz networks, it is not dual band and will not see a 5Ghz networkYour best option, if you want to connect to a 5Ghz network is to install a new network card, they are inexpensive ($5+) and available everywhere, and they are really easy to fit . . .","Thanks, I'll try that."]},{"symptom":"Local D backup drive is full? How to fix?        Hello,When my desktop was installed a local D drive was created for backups I believe. It has been full and I continue to get warnings. How can I allocate more space or change backup destination?Thanks, Greg","solutions":["Hi Greg This is a known bug in the Windows update process, that has exposed the manufacturers recovery drive . ..Click your Start Button, type cmd, then right click Command Prompt and choose 'Run as Administrator'Paste this command and hit Enter diskpart Paste this command and hit Enter list volume Paste this command and hit Enter select volume D Paste this command and hit Enter remove letter=D Close Command Prompt and restart your PC That's It, you will no longer receive those warnings . . ."]},{"symptom":"Sound devices disabled since last update        Were working now not working and appear to have been disabled and not allowed to be enabled again...Help!","solutions":["Try to go to the device manager and update your drivers this happened to my friends and it worked for them hope it works for you!","Hi, GHu58 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps. - Press ‘Windows key + I’ together to open ‘Settings’. - Click on ‘Update & Security’. - Click on ‘Troubleshoot’. - Click on ‘Playing audio’. - Click on ‘Run the troubleshooter’. You can also update the audio drivers. https:\/\/support.microsoft.com\/en-us\/help\/402844..."]},{"symptom":"Error code: 0xC004C003, when using Windows 10 product key        hey i just bought a windows 10 key, and it says the key doesnt work. i have software from the company that build my pc but where my old product key was on the computer got removed one time sent it to repair. so i bought a new code so i could upgrade to windows 10, so i can run my games trough directx 12. now i have the problem that the key wont activate. the error code is: 0xC004C003***Original title: windows 10 key wont work on my windows 8.1***","solutions":["I have 20 og the 25 numbers on my old product key. And have the old scanning bar aswell if you guys have the opportunity to recive back my old product key","Hi Gabriel, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues while using Windows 10 Product Key on your PC. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Where did you purchase the Product Key from?When you say, “Windows 10 key won’t work on my Windows 8.1” are you trying to activate Windows 8.1? Refer the article Which version of Windows operating system am I running? Usually, we receive the error code 0xC004C003 when the Product Key is invalid. If you’re trying to activateWindows 8.1 using a Windows 10 Product Key then you might not be able to activate the copy of Windows as Product Keys are unique for every operating system. However, if you’re trying to activate Windows 10 then you may want to refer the articleGet help with Windows activation errors In addition, you may want to get in touch with Microsoft Technical Support team for further assistance related to the issue. Regards,Prakhar KhareMicrosoft Community – Moderator","I dont use windows 10 i have some kind og locked windows 8.1 it keeps saying i need to activate windows. So i bought a new code since i cant get my old product key. I bought the code from komplett.no and i think it is a version of windows 8.1 maybe windows 8","And the key i bought doesnt work so i dont know how to fix it","This post seems a bit confused. You say in your original post you bought a licence key for Windows 10 but in another post you say you don't have Windows 10 but Windows 8.1.A Windows 10 licence key won't work for Windows 8\/8.1.Can you verify what you have installed and which licence key you bought. You also need to be sure the licence key is for the correct edition, Home, Pro etc.","Okey im gonna try to tell it from the start. A while ago i sent my computer into reperation. A piece of my windows code was a little scratched so they installed some type of locked version. So it keeps telling me to install right version off windows and ask me for the code. So since it was a little scratched and unread able i bought a windows 10 home. The version that is installed now is som kind of windows 8.1 maybe windows 8. That the company that repaired my computer. A company named komplett.no and the windows 10 code i bought wont work when i try to install windows from 8 to 10. on the windows code i have from the computer was new i have 20 of the 25 numbers and i also do have the scan code from it. hope i did tell you easier","I think I get it now.I'm not familiar with the company name you quote for the Windows 10 licence key it could be they are registered to sell a Windows 10 licence in your area. In the UK a Windows 10 Home licence is £119.99 so with an exchange rate your licence should have cost you around the same amount. If not it may not be legal licence and that is one reason it won't activate.How are you trying to upgrade from Windows 8.1 (it must be 8.1) to Windows 10. The best way is to download the ISO image from Microsoft using the Media Creation Tool, select to upgrade another PC and then ISO, save the ISO file on the PC hard drive. When the ISO is downloaded and saved go to the file using Windows Explorer and Mount the drive, this will open a new drive letter. Go to the new drive letter and run setup.When asked for a licence key if you can select skip or do this later or I'm re-installing windows. Wait until you have successfully upgraded to Windows 10. Go to Settings > Update and security select Activation and see if it is activated and which edition has installed. (Home or Pro)Report back the result."]},{"symptom":"subfolders not showing up        The subfolders under \"This PC\" are not showing. Can't get to files in the subfolder.","solutions":[]},{"symptom":"Lost Sound on all video players and streaming radio on browser including you tube.        I've tried to check everything.  Including the uncheck media player on features and rechecking it.  Any ideas or help would be greatly appreciated.   Thank you !","solutions":[]},{"symptom":"Sticky Notes - Double Click on a word opens Context Menu while disabling controll comands        Hi,we rolled out Windows 10 in our company and one user asked me this: In Sticky Notes, when he double clicks a word a context menu opens. While its open he cant use ctrl+c to copy the word he highlighted. He has to use either the copy function from the context menu or click again to remove the context menu and then hit ctrl+c. Thats a change in behavior my user has a hard time coming around. Is there any possibility to shut off the context menu on double click?Thanks in advance!","solutions":["Thanks for the info! I see that you're on a pretty old version of Sticky Notes. Can you go to the Microsoft Store app and try to force an update? We don't see this behavior on the most recent versions."]},{"symptom":"WDF_VIOLATION bugcheck was: 0x0000010d (0x0000000000000005, 0x0000000000000000, 0x0000000000001018, 0xffffba8348ef74c0)        2 computers, same problemComputer 1 (home PC):Windows 10 Pro v1903 build 18362.476Asus X370-Pro board with AMD Ryzen 7Computer 2 (work PC)Windows 10 Enterprise v1709 build 16299.1565DELL Latitude 5591Modem:Tried two different modems but both use the same Win10 driver:  Conexant USB CX93010 ACF Modem1st modem was a cheap $20 USB.2nd modem is a much better $50 USB, HIRO V.92I have updated BIOS on both.  No problems until I had to install a 56k USB Modem and Access Control software to manage an gate\/door security system.  The software is configured to run in compatibility mode for XP SP3 with Admin access.  The software works perfectly fine until I am dialed-in to the security access control module and exchanging data.  Sometimes it works fine until I click disconnect.  Either way, while dialed in it exchanges packets, shows current status and randomly blue screens.  I've not managed to have it work without ending in blue screen.WDF_VIOLATIONbugcheck was: 0x0000010d (0x0000000000000005, 0x0000000000000000, 0x0000000000001018, 0xffffba8348ef74c0)This is the exact same situation and error on both computers except the last octet above is different.If I am reading this correctly, the error is:source: https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/drivers\/debugger\/bug-check-0x10d---wdf-violation?redirectedfrom=MSDNA framework object handle of the incorrect type was passed to a framework object method.How on earth do I get around this?  Do I need to go find a Win7 PC?  Would a VM running Win7 work?","solutions":["Hi, It may help to look at the minidump files from the blue screen crashes. Can you zip up the minidump files in the C:\\Windows\\Minidump folder and make available (provide link) via a public folder on OneDrive or similar site.Here's a link on using OneDrive: http:\/\/windows.microsoft.com\/en-ca\/onedrive\/sha...If you have problems zipping the minidump files copy the minidump files to another location such as a folder on the Desktop.Also, you do not necessarily have to zip up the minidump files, you can upload them one at a time.","Here is a zip file with two minidump files.https:\/\/drive.google.com\/file\/d\/1k9TpvyxDWCp7LRZaiIrHUqrk-e9p4F53\/view?usp=sharing","The issue appears to be related to the usbser.sys : BugCheck 10D, {5, 0, 1018, ffffe20ff0ae5de0} Probably caused by : usbser.sys ( usbser!UsbSerEvtDeviceFileClose+3a ) The process that is crashing is the AB2000.exe and that may indicate that that process is contributing to the crash.Can you provide the following file which has more information on the crash: C:\\Windows\\MEMORY.DMP The memory.dmp file will be quite large, you could zip and compress the memory.dmp file with a third party application such as 7-Zip.Same error in the following link (translated) and I am going to have a look at the dump files from that link:https:\/\/translate.google.com\/translate?hl=en&am...","Thank you for looking into this issue!Yes, the modem is a USB HIRO V92 H50228  The access control application using the modem is \"C:\\Program Files (x86)\\AccessBase2000\\AB2000.exe\"The memory dump zip is here:  memory.dmp zipped","I could not spot a similarity in third party drivers with the dump file in the link which may mean the issue is with a Windows driver.Can you provide the following information which may help determine any issue(s): Windows Key + R > type msinfo32 in the \"Open\" box > OK > File > Save > then save as an .nfo fileThen make the resulting .nfo file available via Google Drive. Also, can you do the following: Windows Key + R > type eventvwr in the \"Open\" box > OK > expand \"Custom Views\" and then right-click \"Administrative Events\" > select \"Save all events in Custom View As\" and save as an .evtx fileThen make the resulting .evtx file available via Google Drive.","Admin Event Log:  https:\/\/drive.google.com\/open?id=1Y8VoMWQp8Qc7W18bthIQY2UAUngF02u4MSInfo32: https:\/\/drive.google.com\/open?id=1Dw2Vcr3aOJqLg8eqaXMrsjePYIzxCdsL","Seems there may be an issue with the graphics driver. Can you try Safe Mode with Networking (if the software works) and see if the same error occurs.","Sorry I've been away.One thing I am working on however is P2V'ng the W7 computer to see if I have any luck running it in VirtualBox...","Status Update:I was successful by P2V'ng the W7 laptop and running it in Oracle VirtualBox.  The modem is able connect to the telephone entry system for the gate access control.As I have found a working solution I think we can stop pursuing this.Thank you immensely for the help and getting me pointed in a proper direction."]},{"symptom":"app name required        cannot open certain news items on facebook. It claims I require an app from Microsoft shop","solutions":["Please give us a bit more information also does it say what app you needIf you can send a photo\/screenshot of this error","Hi Dennis Please provide a screenshot of the error message you are seeing on Facebook so we may narrow this down and provide you with a solution, that may just be a plugin or an actual app that is required and we need to see that actual error . . .","Hi DENNISGSCOTT In order to help you out, we'll need more information about the error message. We'll wait for your news Regards"]},{"symptom":"How to activate Windows 10 Education?        hi, i have installed Windows 10 Education in Virtual machine.I got this error messageWhen i run the troubleshoot i got this messageMy computer is a personal computer and i am always connected to the internet.How do i use Windows 10 Education for free of cost?For education purpose.","solutions":["Hi sanjeevi Windows 10 is only free if that was provided to you by your education facility and they are licenced to provide that to their studentsDoes you school\/University provide the students with Windows 10 education?"]},{"symptom":"Running Roblox on my Dell Precision M4800 Game freezes after about 30minutes of playing.        Running Roblox on my Dell Precision M4800 the game freezes after about 30 minutes. Sometimes indicates \"out of memory\" Does anyone else have this probblem","solutions":["Hi AllanWegner I'll try to help you out. I'm thinking about a leakage of memory. Before launching the game, can you open the task manager (press CTRL+SHIFT+ESCAPE) and check the memory usage of your game.If you can run the game in windowed mode, keep an eye on the memory usage. Check if the allocated RAM keeps rising, until the game freeze. Also, was the game running without issue before ? If yes, before an update, before another software installation ?I'll wait for your news Regards","This AM my Grandson ran Roblox using Opera as he usually does. The memory usage hovered between 72 % an 75% without any failure. As he is the only one playing this game I am limited in response time to your inquiries.  We will continuw to monitor as you requested.  Out of curiosity, why am I monitoring system memory when the only message that has ever appeared had to do with video memory?","You first message only stated a \"out of memory\" message, so I supposed it was system memory related.By the way, when the GPU (video) memory is full, it then fill the system memory."]},{"symptom":"microsoftstoreemail.com        I'm getting emails from \"Microsoft Store <*** Email address is removed for privacy ***>\".  Is this a legitimate Microsoft email address or is it a phishing scam. ","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.It is likely legit as per forum posts. What does the content say and does it have a green shield after the address?https:\/\/answers.microsoft.com\/en-us\/msoffice\/fo...","it's a long advertisement starting with \"Jumpstart your 2020\".It does not have a green shield after the address.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please make sure the email address domain is \"@microsoft.com\" (For example *** Email address is removed for privacy ***) If the sender's email address does not end with @microsoft.com but claims the mail is sent by Microsoft, then it might be a phishing attempt."]},{"symptom":"cannot type        im on windows ten and I can  only type in apps like Internet exp or Word. in other apps it  just doesn't react at all. what should I do about it?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps: Reset Keyboard Driver: Go to Device Manager Locate \"Keyboards\" and double tap on it. Right click on the Keyboard drivers and select Uninstall Restart the PC"]},{"symptom":"battery performance        The battery icon shows that my battery is near full on charge, however, now when I try to use my computer without it being plugged in, it cuts off completely.","solutions":["Hi, GailPatrick My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Check this link, I hope it helps https:\/\/www.groovypost.com\/howto\/troubleshoot-b...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"How to enable start menu auto-expand?        Does any one know how to enable the new start menu auto-expand side icons?link to feature article:https:\/\/www.windowslatest.com\/2018\/11\/15\/windows-10-19h1-to-change-start-menus-navigation-pane-behaviour\/thanx in advance!Update been a while:got an update today which enabled it on my PC.","solutions":["Hello My name is Alberto, I am an Independent Advisor. Thank you for posting your question. I'll be happy to help.Please check this link over there you will see your solution: https:\/\/superuser.com\/questions\/1130742\/want-th...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","No change still the same, i had it off been like that for a year now, i used to turn it on in the past but i wanted the date under the time on the taskbar so i turned it off.","Ok let me check another solution.","i had some problems in my windows install so i re-installed and to my surprise no change, even tried that solution again still the same!","anyone has any solutions?","Does any one know how to enable the new start menu auto-expand side icons?link to feature article:https:\/\/www.windowslatest.com\/2018\/11\/15\/windows-10-19h1-to-change-start-menus-navigation-pane-behaviour\/thanx in advance!Hi abdulhkeem,I have 5 Windows 10 machines, all version 1903 and the auto-expand feature only works on one of them.The one that it works on is Windows 10 Pro. the others are Windows 10 Home.It may or may not be relevant but that's the only difference that I see in the working one and the non-working ones.-Kevin N.","Sorry for the late reply my pc's h100i cooler decided to fail and i got stuck waiting for new cooler arrived today installed it and i am back.i have pro version of windows 10 too sadly no trace of auto-expand, thanks for trying man!","I'd like to know how to turn this off, it just suddenly started happening & it's really annoying","I'd like to know how to turn this off, it just suddenly started happening & it's really annoyingI have same problem. It started expanding on my notebook only and it's pretty annoying. Is there a way to turn if off?","Only re-install. Because this \"feature\" was appeared in system after link (and - after two days - disconnect from it) Insiders program and installed from Insider's distrib. Oh. Re-install solved this problem.Best regards."]},{"symptom":"google chrome  and windows 8.1             chrome  blocheaza bara de navigare","solutions":["This is an English language forum.And there are no Romanian language forums.Either post in English or click on the World Globe Icon at bottom left of we pages here and select a different language. Acesta este un forum de limba engleza.Și nu există forumuri lingvistice românești.Fie post în limba engleză sau faceți clic pe lume globul icon la partea de jos stânga de noi pagini aici și selectați o altă limbă."]},{"symptom":"stuck in S mode after bios update?        I recently got a HP Pavilion 14, and found it to be installed with S Mode, an exceedingly useless mode to me. I managed to switch out, but after an HP update today, my computer is not only back in S mode (even though I though the switch out was permanent), but trying to switch out through the Microsoft store leads to this happening: after clicking the \"Get\" button, a window that says \"Try again later. Something happened on our end.\" pops up every single time and the \"get\" button is indefinitely replaced with \"working on it...\" I've restarted my computer, ran the trouble shooter, turned my computer off and on, and even did a system restore to a point where I was out of S mode and nothing has worked. This is beyond frustrating and I am losing my patience.","solutions":["hello.i have the same issue. reinstalling windows helps me,but i have a clean new notebooks."]},{"symptom":"My HP laptop keeps having unexpected shutdown        I'm using windows 10 os on my HP laptop. The problem started with having black screen. I tried to fix it by referring to youtube. It says to press the power button for 15secs and choose the option provided. I did it and my black screen problem is gone. But when i inserted my password, the page would load for a long time (around 5 to 10 minutes each time). When I'm able to login, the desktop page will again load for a very long time. Then windows will tell me that windows will shut down my computer in 1 minutes. What should i do?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps: 1. Go to the following page and perform the steps: (Disk Cleanup) https:\/\/support.microsoft.com\/en-in\/help\/402661...2. Right-click the Start button > select Task Manager > then select the Startup tab.Disable the apps at Startup. 3. Press the Start button and type msconfig and hit Enter Click on the \"Services\" tab Click on the Check box that says \"Hide All Microsoft Services\" Then click on Disable All Apply > OK Restart the PC.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps: 1. Go to the following page and perform the steps: (Disk Cleanup) https:\/\/support.microsoft.com\/en-in\/help\/402661...2. Right-click the Start button > select Task Manager > then select the Startup tab.Disable the apps at Startup. 3. Press the Start button and type msconfig and hit Enter Click on the \"Services\" tab Click on the Check box that says \"Hide All Microsoft Services\" Then click on Disable All Apply > OK Restart the PC. Hi Arif Ahmed. Unfortunately I can't even do anything after putting in my password. Right after the desktop is loaded, the page will not be responding and notification from microsoft will pop up saying that my computer will restart in a minute.","Hello Noor, I am Andrew and I want to help. Do you have access to another computer? I want to ask you make a fresh install USB for Windows 10. Start here to make most recent,https:\/\/www.microsoft.com\/en-ca\/software-downlo... Once complete boot from the USB. You can do an in place repair\/update from here by running the setup without erasing the drive. If you cannot boot to USB it can be done another way.Since you can get to the login screen we can make this easy by restarting the PC via the power icon on the lower right of the screen. While clicking restart hold the SHIFT key. In the troubleshoot menu that comes up after rebooting select to REPAIR windows.Remember, choose to repair not reinstall as you will lose your personal data, if personal data isn't an issue then a reinstall is your best option. You will start with a new machine, programs and all need to be reinstalled."]},{"symptom":"Power Plan: how to change brightness on battery \/ plugged in?        The latest (about a week ago?) windows 10 update seems to have removed some features from the Control Panel > Hardware and Sound > Power Options page and the pages underneath it. Specifically, under Change Plan Settings it seems they removed the ability to set a different screen brightness when on battery power vs when plugged in (I'm using a laptop). Is this feature gone for good, or has it been moved to somewhere else?","solutions":["Hello Brian,Several of the usual options to change the display brightness has changed and been removed. Double check the options in the tutorial below to see if you may have one to change the brightness with.https:\/\/www.tenforums.com\/tutorials\/44213-adjust-screen-brightness-windows-10-a.html"]}]}