{"windows":[{"symptom":"Removing McAfee & using Windows Defender instead         I'm currently using McAfee for firewall & virus protection that came with my new computer free for 1 year.  But I'd like to remove it right now and start using Windows Defender for virus & FW.  Please give me the procedure for doing this. I planned to use Revo Uninstaller to remove McAfee, but then read somewhere that a special procedure has to be used to remove McAfee?  <--- I don't know if this is right.Also, will Windows Defender automatically activate once McAfee is removed?  Thanks!","solutions":["Hi S.E. There is nothing further you need to do, run that tool, then restart (not shut down) your PC . . ."]},{"symptom":"AUdio stopped working - no audio output device is installed        How do I fix this problem?","solutions":["Hi Colin Most likely this is caused by a Windows 10 update, the best first option is to go to the support page for your PC on the manufacturers website, then form there, download and install the audio drivers they recommend for your PC . . .If you have any difficulty locating that support page, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . .","Hi Colin Most likely this is caused by a Windows 10 update, the best first option is to go to the support page for your PC on the manufacturers website, then form there, download and install the audio drivers they recommend for your PC . . .If you have any difficulty locating that support page, what is the Make and exact Model No. of your PC - that will be printed on a sticker on the bottom casing . . .Hi. It's a HP ENVY All-in-One 27-b2XX. I've tried downloading new drivers but I'm not a 'techie' and I'm not sure what to do. I had the same problem a while ago and found a post on the web with a solution that did work. Wish I'd kept the solution because I cannot find that post now!","Hi Colin Click the link below for the support page for your PC Download the November 2019 driver from the Audio Section, then double click that to install ithttps:\/\/support.hp.com\/ie-en\/drivers\/selfservic...Then open the Settings App (gear icon on your Start Menu) Go to Update and Security - Troubleshoot Run the Playing Audio Troubleshooter If necessary, restart (not shut down) your PC . . . ________________________________________________________Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","I have lost my sound also. Have Realtek speakers in a Inspirion 7773. Have tried everything I can find, reloading drivers, disable & enable. Have been with out sound for six months and if I remember correctly the lost audio occurred after an update from Dell.  Trouble shooting says everything is ok!"]},{"symptom":"how to protect my pen drive with password?        how to protect my pen drive with password?","solutions":["Hi Sunil If you have Windows 10 Pro, you can use the built-in Bitlocker to encrypt your flash driveIf you Have Windows 10 Home, you will not have access to Bitlocker and would need to use one of the many free Flash Drive encrypters available on the Internet, VeraCrypt is totally free and probably the best of the free utilities . . ..","Hello Sunil, I agree with Dave.If you have Windows 10 Pro, Enterprise, or Education, BitLocker would be a good choice to protect the USB flash drive with encryption and a password to unlock it.https:\/\/www.tenforums.com\/tutorials\/36701-turn-off-bitlocker-removable-data-drives-windows-10-a.html"]},{"symptom":"0x8007042b error installing Windows 10 Insider Preview 19536.1000 (rs_prerelease)        Hi,The above error occurs when I try to install the Windows 10 Insider Preview 19536.1000 (rs_prerelease).  I have tried this multiple time without success.  I am running a T450s with:1.  0.5 Tb SSD of which more than half is free.2. 20 Gb of RAMAny help would be appreciated.TIA,Shane","solutions":["Hi Shane My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.On your keyboard, press Windows Key+X. From the list, select Command Prompt (Admin) or Powershell (Admin). Type “sfc \/scannow” (no quotes), then hit Enter. Scan your system for corrupt system files. The SFC scan should take a couple of minutes. Just wait and avoid interrupting it. Once the process is complete, check if the issue has been resolved.If an SFC scan does not get rid of the error, your next resort would be to run a DISM scan. To do that, simply repeat steps first two steps in performing an SFC scan. In the Command Prompt, type “DISM \/Online \/Cleanup-Image \/RestoreHealth” (no quotes). Again, you have to wait until the DISM scan is complete. The process might take longer. So, be patient and avoid interfering with it.Hope this helps."]},{"symptom":"Outlook in Windows 10        Having correctly entered my alternative email service incoming and outgoing server addresses, and my correct password, why are any messages created not recorded in my 'Sent' folder, and why when I go back to my settings is my password not shown in the correct no of *s?Also I should like to import my historic email folders from my previously used (on an old computer running Windows 7). Can this be achieved easily?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please refer to the following page and perform the steps if you are not able to sync your sent items at Outlook.https:\/\/kb.intermedia.net\/article\/1187Note: This is a Non-Microsoft website. However, I have checked the website to be potentially safe. (User's discretion is required)","Regretfully I find myself unable to follow the procedure suggested as I have no File\/ Info option...and I am unable to embed a .jpg for my screen layout.If it helps, I am not using Office 365 but Office 2019, the software for which I bought outright rather than subscribe to an annual payment...Mike Roberts","Okay, in that case I would suggest you to kindly Re-download Office 2019 and install the same and check the status.You can download the setup file by performing the steps mentioned in the following page:https:\/\/support.office.com\/en-us\/article\/downlo..."]},{"symptom":"Minecraft Windows 10 Edition - No Audio        Hey! I'm having this issue with Windows 10 Minecraft not having any audio.Every other game,app and even other windows store apps have audio. I've reset my audio drivers, ran chkdsk, scannow, and dism with no errors. I've ran audio troubleshooter, device troubleshooter, and have triple check that minecraft isn't muted.I've my computer connected to speakers in the back, and my headset in the front. When i launch minecraft with my speakers, it doesn;t appear in the audio mixer, but does so when i switch to headphone. I'm running windows 10 (non n version), so windows player is already installed, along with the pack. I've reinstalled minecraft countless times and reset it.The only thing that i suspect may be causing this issue is that i ran the XaanderBaatz script, but didnt check if it affected Minecraft at the time. I dont think that it is the issue but i wanted to point it out. I also downloaded voicemaster to flip my audio on my speakers because i put them on the wrong side kek.Thanks!","solutions":[]},{"symptom":"File sharing        i used to be able to share file over my home network.I can't seem to do that with windows 10.anybody have any idea's except using remote desktop.I at one time on windows 7 had all pc in workgroup, no problem.then on windows 7 I used home group.any ideas would be helpful.thanks,joe","solutions":["Hello JoeFoley2, HomeGroup has been removed in windows 10 but you are still able to share files over your network. Everything you need to know about sharing files in windows 10 is available here:https:\/\/support.microsoft.com\/en-us\/help\/409269... The instructions given should cover any problems you may have when trying to share files across your network.","You can look at this topic and see my post. This is what I did after I got a new Laptop for Christmas and wanted to move files from my Desktop to the Laptop.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/networking\/4a69f92a-3c52-43f8-9586-ac5f1ba7163b","Hello Joe,You might see if the options in the tutorial below may help to allow file sharing again.https:\/\/www.tenforums.com\/tutorials\/111783-share-files-folders-over-network-windows-10-a.html"]},{"symptom":"Some settings are managed by your organisation        Hi, i wanted to make some changes in systems because my pc got restarted mid-work for update, so i was figuring out what's wrong and i found this policies  limiting me in doing changes to settings, it seems having affect after i installed my school licence of Office 365.Can you please tell me how i get rid of those Policies ?","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps and check: 1. Open Group Policy Editor by pressing Windows Key + R and typing gpedit.msc. 2. When Group Policy Editor starts you need to navigate to: User Configuration\\Administrative Templates\\Start Menu and Taskbar\\Notifications 3. On the left side of the window find Turn off toast notifications setting and double click it.4. Try enabling it and disabling it couple of times, but remember to keep it disabled before you save your settings."]},{"symptom":"windows 10 lite?        I have a Dell Inspiron with only a 32gb SSD that came with windows 10 installed. The operating system took up so much memory that after ms office install there was insufficient space to even allow a windows update (albeit it was a major update at the time I believe). My question is, I have a 128gb usb flash drive and is it possible to install the OS on the flash drive and permanently run windows 10 off the flash drive?","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Unfortunately no. 32GB devices are a nuisance. The only way to keep it updated is through a clean install. You may, however, move your user folder and program filess to be installed later on a 128GB drive. Let us know if you need instructions for the same.","Yes please provide instruction thank you","For clean Installing: How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...For changing the location of user folders: https:\/\/www.dummies.com\/computers\/operating-sys...For changing the Program Files directory: https:\/\/www.thewindowsclub.com\/change-default-p...Do note that doing the steps above would make Feature update to fail to install which also isn't possible if you use a 32GB device.Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","doesn't seem to be installing programs on D: after modifying registry per instruction above"]},{"symptom":"5.25\" Floppy drive install        Anyone know how to adapt a legacy 5.25 floppy drive to a Windows 10 MOBO through a USB port?","solutions":["I purchased an enclosure with a 3 1\/4 inch drive and a USB cable.When plugged into a WIN 7 machine, I could read and install files from the floppies.Perhaps there is something similar for a 5 1\/2 inch disk.","Hi DouglasMann you will need an adaptor, something like https:\/\/www.kryoflux.com\/ they also have the software (drivers etc) to be able to read the 5¼\" floppies i have not tried this product and there are probably others available, i suggest you research it thoroughly before parting with any hard earned funds.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Frequent BSOD        Hi all,I bought new PC and i have issues with BSOD. I get one nearly every day. I already did a lot of troubleshooting but it keeps happening.1)Windows up-to-date2) Updated all drivers3) Factory reset and windows reinstall (no effect)4) I updated only drivers for Audio and LAN for my motherboard and it looks like, it made it worse and i got BSOD couple times a day - so i removed it again.Here are my specs:MB: MSI 450 B450 TOMAHAWK MAXProcessor: AMD RYZEN 5 3600GPU: GeForce RTX 2060 SUPER SC ULTRA GAMINGRAM: Crucial 16GB DDR4 3200MHzHere is couple of last minidumps i got:https:\/\/drive.google.com\/open?id=1XS3pmIraq3vlBXDxA9RYYo1mWwjDn-cGThanks for your help","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please try the following steps and restart the PC: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealth","Yes, i already tried this (found on another web) couple days ago. Didnt help.","Will it be possible to create a local account and observe the PC for couple of hours if the same BSOD appears when you are Signed in to the local account?","yes, i will try. Let you know how it went.","i got the crash as well","Okay, in that case I suggest you to Restore the PC to an earlier time when it was working perfectly.Steps: In the search box on the taskbar, type control panel, and then choose it from the list of results.In the Control Panel search box, type recovery. Select Recovery > Open System Restore. In the Restore system files and setting box, select Next. Select the restore point that you want to use in the list of results, and then select Scan for affected programs.You'll see a list of items that will be deleted if you remove this restore point. If you're OK with the deletions, select Close> Next > Finish.Note: Select a date when the PC was working properly.","The PC never worked properly. Its brand new and this is doing since day 1. I already reinstaled windows multiple times, even put bios into factory reset.","Okay, let us try this once again. Let us install the Operating System using the Media Creation tool and check if this happens again.Please go to this page and download the tool and prepare an installation media. https:\/\/www.microsoft.com\/en-in\/software-downlo..."]},{"symptom":"How To Down Grade to Win 8.1 After Forced Upgrade by Microsoft & PC Will Not Boot        My desktop PC was running Win 8.1 and the hardware does not meet the standards for Win 10. Over night there was a forced upgrade by Microsoft to Win 10. Now my computer will not boot up. How can I downgrade back to Win 8.1 when my system will not boot to take advantage of the rollback option? The system came with Win 8.1 pre-installed and I am not sure where my backup disks are. I have many applications and data files I need to preserve.","solutions":["Hi Lee Can you please explain what you mean by your were 'forced' to upgrade to Windows 10, that should no happen, not now, since there is no longer a free upgrade to Windows 10 available . . .Start your PC, just as Windows attempts to load (spinning dots), press and hold Power Button for 5 - 10 seconds to perform a Hard Shut DownDo this twice On the third start Windows will boot into the Recovery Environment and from there you can access System Repair, Safe Mode, Command Prompt . . . etc.Please try each option one at a time, then see of Windows will roll back to Windows 8.1 . . .Go to Troubleshoot - Advanced Option - Revert to previous build of Windows If the above fails, go to Troubleshoot - Advanced Options - Reset this PC Choose to keep your files and apps, Then start the Reset"]},{"symptom":"New USB devices plugged in stop being recognized, computer no longer shuts down properly         Hello!I've been having a recurring problem where, at one point (can be as soon as after 24 hours, when coming back from work), all my USB drives will completely ignore new USB devices being plugged in. If they were already plugged in, they will keep working provided I don't try to plug them out and back in.When this starts occurring, shutting down my PC no longer \"works\", as in, the Power icon on the tower never shuts off, I need to force shut it down by holding the button down for a few seconds. Rebooting this way fixes all issues until they start happening again after a few days.There are a few symptoms that may or may not be related that I figure might help isolate the problem. I have suspicions they are related as they only happen after some days of leaving the computer open as well and usually at the same time the USB issue occurs as well:- My High Definition Audio Bus stops working. I get an error on it in Hardware Manager and it's a 50\/50 toss whether I can restart it or be forced to reboot the computer to fix it since attempting it might freeze the Hardware Manager. I have a 3 monitor setup where the 3rd screen is my living room TV I sometimes use to listen to videos in the living room. When this problem occurs, I can no longer transfer the Audio to this monitor since it doesn't exist in the list of available outputs anymore.- I can no longer start games on Steam.- I can encounter issues with going full screen when watching video content, either streaming or local videos where the image will freeze up for a few seconds whenever I go in or out of full screen.What I've tried:- Going through https:\/\/support.microsoft.com\/en-us\/help\/817900\/usb-port-may-stop-working-after-you-remove-or-insert-a-usb-device while the problem was occurring.Method 1 scans for changes infinitely.Method 3 froze the Device Manager.The \"Workaround\" I didn't attempt since I don't have a registry entry called \"USB\", there are several USB entries so I didn't dare touch this.Furthermore, I did find the advanced setting in my Control Panel's Power Settings about Selective Suspend and it was already set to Disabled.- Complete computer shut down ( shutting down, unplugging EVERYTHING and holding the power button for a minute before replugging everything in)- Selective testing of USB devices to see if one of them was causing the issue: I'm not entirely through this one, but I feel like unplugging my external SSD drive actually did delay the problem occurring, however it did still happen eventually. Could this SSD external drive possibly be the problem?Is all this pointing to some known problem I could fix? It is being extremely annoying to deal with, forcing me to reboot several times a week and I wish I could get rid of it. Thanks!","solutions":[]},{"symptom":"DPC Watchdog violation        Hello recently I have started to receive DPC Watchdog violations that result in blue screens, they tend to happened when media of some sort plays on my computer like Netlfix. My computer can operate as normal until I play something that seems to trigger the crashes. As of now all my drivers seem to be updated and I don't have any windows update if any of that is important information.Here is a link to two minidump folders from the crashes: https:\/\/1drv.ms\/u\/s!AhYMSKrPNPCXb6fWrQFWNwCOJhs?e=z7ovcvAny help would be appreciated.  ","solutions":["Hi Brews00 The minidump files indicate it is the device driver on your Nvidia graphics card that is causing the system crashes . . .An older version of that driver may be more compatible with your PC, open Device Manager (accessible by right clicking your Start Button)Expand the Display Adapters Section Right click your video card and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the video driver they recommend, it may well be an older version to the one you are currently running"]},{"symptom":"Wireless Capability Latitude 5490        I am unsure of what to do here, i restarted my computer randomly and when i turned it back on my wireless ended up doing this for some reason. I dont have one of those switches and when i use Fn + PrtScr (tower icon in blue) it just puts it into airplane mode? ","solutions":["Hello JamesConnors1, I'm Didi, an independent advisor. First try to restart your computer one more time to see if it fixes the issue. When you click on \"Manually\" below \"Turn Wi-Fi back on\", what options does Windows offer you ?Click on the Start button, type \"control\" and click on \"Control Panel\". On the top right set \"View by:\" on \"Small icons\" and in the list click \"Network and sharing centre\".On the left click \"Change adapter settings\", right-click on your WiFi network and click \"Diagnose\".If this doesn't help in the Network and sharing centre click on Troubleshoot problems and use the troubleshooter for both \"Internet Connections\" and \"Network adapter\".Regards, Didi","When i click on the “manually” the options are, in 1 hour, in 4 hours, in 1 day. I ran the troubleshooter for both Internet connections and network adapter both came with the same results. “Use the switch on the front or side of the computer, or function keys if available, to enable wireless capability on this computer”"]},{"symptom":"Failure to access browser        Recently I have been having problems with one of the games on Facebook I sent message to the game and as usual got an automated reply, followed instructions as to what steps to take. This did not resolve the problems ie my suspects in the game had grown to gigantic size making it a problem to identify the murderer. Explored other options with no luck so a last chance and I used system restore (!!!!!!) logged back in  to use my normal browser Opera, because all my websites are clear on speed dial and found it would not open neither would Chrome.So went to settings to uninstall to reinstall and found I could not do that either! Eventually managed to do so with Chrome and  carried one but am finding it difficult to use as I have to keep shutting it down and reopening I am a pensioner and this is the extent of my Knowledge can anyone help please.Also what Adblocker would you recommend for Chrome the ads slow down some of my sites like trying to get water from a stone.Thanking you in advance but not too technical please","solutions":[]},{"symptom":"Does System Restore on Windows 10 affects Ubuntu installed via Windows Subsystem for Linux?        After installing Ubuntu or any distro with the support of WSL, when restore points are created and then when the system is restored to this restore points, does this also restores the state of Ubuntu or any linux distro installed?","solutions":["Hi ashwinkabbinahalli Rest assured a System Restore will not affect a Linux distro that is installed on another partition or drive on your PC, that will only roll back the WIndows operating system . . .","Hi ashwinkabbinahalli Rest assured a System Restore will not affect a Linux distro that is installed on another partition or drive on your PC, that will only roll back the WIndows operating system . . .Am sure u did not even read my question completely.I was talking about the linux os installed via Microsoft Store to be used inside Windows (windows Subsystem for linux)Anyways, am sure u wud ve the answer. "]},{"symptom":"Windows update reset all my settings!?        Hi,I updated my Windows to the lastest build.Now Edge is my default browser, I have lost all my extensions and opened pages on other browsers I use routinely.My Calibre ebook manager has been wiped out, dropbox has been removed, and all my downloads have been erased.WTH Microsoft?!How do I roll back to recover everything???","solutions":["Hi choubix, this is happening much too often at the moment, you are logged into a temporary account . . .Before you do anything or move any files around Restart (not shut down) your PC 4 times, each time let your PC get to the Desktop before the next restart, this will fix this issue a lot of the time . ..Otherwise: Please open Windows File Explorer Navigate to C:\\Users Do you see two user folders that look like yours? Open those folders and check inside Pictures, Documents . . . etc. and see if your files are thereIf your files are there: Create a new user profile with Admin privileges Log into the new user profile Copy all your data from the old profile to the new profile (Documents Library, Pictures Library . . . etc.)If you still have not found your files, look for a Windows.old folder on your C Drive, expand that to open the users folder contained inside - check there for your files, icons . . .etc.If you do find your files . . . etc. there, copy them out as soon as possible as Windows will remove the Windows.old folder in timeNOTE VERY IMPORTANT: Do Not copy your files into the Temporary profile you are currently in, when the situation is corrected, your files will be deleted with the Temporary Profile and will not be recoverable !!"]},{"symptom":"Windows 10 setup\/upgrade        I have tried several times to run the Windows 10 setup tool to upgrade from 7 to 10. I get through all steps except what I believe is the last. I get to Getting Updates. The sub title under the folder is checking for updates. I get to 46% each time and it stalls and just spins. I've left it run overnight and it still sits at 46%. How do I get past this?","solutions":[]},{"symptom":"Fix for many sound problems for laptops        After trying driver updates and a number of other fixes, I found the best way to fix a number of audio problems, including those of the dock outputs, is to simply download and reinstall the audio software from the manufacturer of your laptop. For Lenovo laptops with Conexant 20672 Smart Audio HD , the link is https:\/\/download.lenovo.com\/ibmdl\/pub\/pc\/pccbbs\/mobiles\/8aax04ww.exe. It works for Lenovo laptops all the way back to Windows 7 vintage. My laptop is a T420 and runs Windows 10\/64 v1809.Generic approach for other laptops: 1. Go to Device Manager and find out the name of the Audio Software (listed under audio inputs and outputs usually) Write it down and while there uninstall the Driver.2. Go to your laptop's manufacturer site and find the support area where the drivers and downloads are found. Identify the audio area. Find and download the latest software for your specific audio system. Install and reboot.3. Even though you may have a legacy windows 7 laptop like mine, updated to Windows 8 or 10, it is likely a new install of the audio software will work. On reboot Microsoft will install the current driver.","solutions":[]}]}