{"windows":[{"symptom":"windows media player        when I make a play list to record ( using windows 10 )  my player will not record it keeps spitting out the cd","solutions":["Did you click on Burn at the top right?  Did you put you list in the Burn area at the right?Did you then insert the Disc as asked in the proper drive?Then did you click on Start burn?","Hi charliemack53, My name is Marc, thanks for participating in the Microsoft Community, I'm an Independent Advisor and I'll be glad to help you today.Consult and apply the steps in this link that explains the actions to take when you cannot record in Windows Media Player, it is a website shared by some Windows MVPs.https:\/\/www.lifewire.com\/how-to-change-burn-spe...Let me know if you have something else that I can help you with, I'd be happy to help.Have a nice day Regards, Marc M. Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Customising theme packs in Windows 10 Pro        HiI have been trying to customize some theme packs I downloaded recently. If you don't understand, windows had a feature in personalisation where you could choose which pictures from your theme are to be included in the slideshow of your desktop background. Apparently there have been some updates in the process and I can't finda way to do that. Can anyone guide me on how to do it?Version 1903 OS Build 18362.535. Windows 10 Pro","solutions":["Hi Akash. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's no official way to do it but you can get access to the spectacular scenic Background and Lock Screen Spotlight pictures this way to create your own folder of them to use in a slideshow:https:\/\/www.groovypost.com\/howto\/save-windows-1...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.thewindowsclub.com\/where-does-windo...How to create an entire custom Theme: https:\/\/www.laptopmag.com\/articles\/make-windows...Also see how to get color back on the taskBar, Start Menu and window frames after Version 1903 turned the Light Theme dull grey:https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Cannot download anything from Microsoft Store        I'm on Windows 10 and have tried downloading numerous apps in the Microsoft Store: games (both paid and free), Facebook, etc. Nothing will download at all. It gets to \"Acquiring license\" and then gives me the access denied error code on every app. I have tried so many Microsoft Store fixes over the passed 5 hours and nothing has worked. Ive ran the command prompts suggested, including powershell. I've made sure windows was 100% up to date. I've \"Reset\" Microsoft Store, signed out and back in, rebooted the computer... I am at a total loss for what the problem is. I even called Microsoft support and they could not help me. Anyone have any ideas?","solutions":["Hi Chris, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Follow these in order: 1. Try Wsreset: First see if Windows Store Reset works. This should Reset Windows 10 Store cache and if there is a problem with cache, this would clear it.a. Open Run dialog box(Win+R) b. Type in wsreset and Press Enter 2. The next step if Wsreset doesn't help is to Reset the Store app. To do this, follow the steps:a. Open Run Dialog box( Windows+R key) b. Type in ms-settings:appsfeatures and Press Enter(Alternatively, Start>Settings>Apps and features)c. Locate Microsoft Store d. Click Advanced Options e. Locate and click Reset Button 3. Reset Windows Update components: Resetting Windows update components might also help. Here is an article on how to do that.a. https:\/\/www.yourwindowsguide.com\/2015\/12\/reset-... 4. Check for necessary services: Windows Store is dependent on some Services. Please check if the services are running and Automatic as given below.a. Right-click Start>Run and Type in Services.msc to open Services. b. Make sure the status of the following services is Automatic and running i. Windows License Manager ii. Background Intelligence Transfer service iii. Cryptographic Services iv. Windows Update v. Windows Store c. If something is not as intended, you can try Restoring default services https:\/\/www.dropbox.com\/s\/vw3g7llzu6niode\/Resto...5. Repair install: The last Restort is a reinstallation of Windows. You can do a repair install, which keeps everything including your apps and files.a. https:\/\/www.yourwindowsguide.com\/2016\/06\/how-to... Originally written at https:\/\/www.yourwindowsguide.com\/2018\/08\/resolv... Disclaimer: The content is written from a Microsoft MVP, so it is safe."]},{"symptom":"Window 10 Mail and Calendar App error 0x800000b        mail and calendar in windows 10 will not recognize login to yahoo account but gives error 0x800000b,  Yahoo account says it logged in but app errors and does not set up account.  Tried IMAP also-same error.  Could successfully setup gmail account AND a different Yahoo account.  This error has to be originating from APP.  Spent 60 minutes with Microsoft Support yesterday to no avail.  Help!!!! Says its your app.  MS reloaded app.  No avail.Windows 10 32 bit completely fresh new computer with updates I think to 1903.   Pretty sure its the app spitting out garbage.","solutions":[]},{"symptom":"Unable to use headphone on PC        on my win.10 Inspiron all-in-1, the headphone jack is inoperable. went to sound and in playback tab, speakers\/headphones from Realtek are selected as default device??? I've been threw troubleshooting, support, (microsoft and intel). anyone w\/same... please share fix info***Original title: headphone jack not working*** ","solutions":["Hi, Thank you for writing to Microsoft Community Forums.                                                   I understand that you are facing issues with headphone jack on your PC, and I certainly appreciate your efforts in trying to resolve the issue by following certain troubleshooting steps. For further clarity on the issue, please respond to the questions below: Which build version of Windows 10 are you using currently?Are you aware of any changes made to the PC prior to which you weren’t facing this issue?What is the exact make and model of the PC?Have you tried using any other headphone on the PC? Refer the article Which version of Windows operating system am I running? Meanwhile, I would suggest you to refer the article How to Troubleshoot Audio or Sound Playback Issues by Dell and see if that helps. Note: Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","To Mr. Prakhar Khare,I am very appreciative for your very timely and thorough list of, \"do this, try that, and… \" and the fact that you're w\/me to the end, regardless.But, please be patient w\/me for I have too many irons in the old fire. I will address this matter later on this evening.I just had to take a moment to let it be known that I am very impressed w\/the Microsoft Community and that I now appreciate you(z) for being there.signed,  Wowsincerely,Tim b*** Email address is removed for privacy ***(headphone jack inoperable","Hi Tim,Thank you for replying.Please try the steps in your free time, and do let us know if you need any further assistance we will certainly assist you with the issue.Regards,Prakhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows Store is selective with it's download install locations        I bought the Xbox pass, and i'm trying to install my games onto my D: drive. For some bizarre reason, Windows store selectively decides that some games can and others cannot be installed to certain drives. I've tried changing where my apps are saved to in storage with no luck. The game in question here is Prey. I have already installed Forza and Superhot, but for some silly reason Prey refuses to install onto my D drive, with the drop down option not even available .Any insight or help would be greatly appreciated!","solutions":["Hi M1tch, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Is D: drive an external drive? Also is your Windows 10 version up to date? If not, The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/11\/update...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"No power Options        Why is there no power options in settings, only power and sleep settings?","solutions":["Do you still require help?"]},{"symptom":"Turning off Windows S mode HP Stream        I got an HP Stream a couple months ago and I need to remove S mode. I've tried multiple things that I've read and still get the error message when I try to turn it off that say \"try again later something happened on our end\". Any advice on what to do?","solutions":["Hi Kelsey. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to get out of S mode properly which does NOT require Upgrading to Pro:https:\/\/support.microsoft.com\/en-us\/help\/445606...If the servers are busy you can wait and try again later, or contact Microsoft Support by one of these phone numbers:https:\/\/support.microsoft.com\/en-us\/help\/405170...You can also go here: https:\/\/partner.support.services.microsoft.com\/... choose the link for Browser help, interact briefly about your exact problem, keep replying agent until it connects with an agent.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Pro Activation Issues        I Purchased a laptop directly from DELL that had a Windows 7 Pro license that was activated. A couple years later I upgraded this same DELL Laptop with a valid windows 10 Pro license. It was running for over a year now. I noticed an issue where it can;t activate windows right now with an error code of 0x8007251D. This all started to happen after upgrading to feature release of 1903.Any ideas as to what is going on?","solutions":["If you have a Windows 10 Pro licence key then enter the key in Settings > Update and security select Activation and Change product key.Are you using the same MS account on the device.","Is there a reason as to why it is prompting just now? Like I said last time I entered this was years ago.","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.The error code you have encountered relates to a DNS record issue and KMS client. Please run the command \"slmgr \/dlv\" to check if you are using a KMS or MAK product key. \"KMS\" will be noted in the description while others like Retail or OEM will be MAK.If your computer is joined to an Active Directory Domain and using a KMS key, you should check KMS host SRV record.https:\/\/docs.microsoft.com\/en-us\/windows-server... Please let me know if I can help you further!","I've no idea. Other users have seen activation go and come back again, it could be the activation server or an update that has caused the notification.If you have your original licence key it should just activate again when you enter the key.","Thank you for that suggestion. I have taken a screen shot with the information. Could you please tell me the next steps ","So the product key used is KMS. Is this computer joined to an Active Directory Domain?","Yes it is. However they are logged in via a VPN connection to our networks.We didn;t notice this issue until the Feature Release 1903 was installed. If that give any clues.","Ok. Noting the error message, it is likely the KMS SRV DNS record is invalid, or the server is unreachable via VPN. I'm guessing previous activation expired when Feature Release was installed or it is purely coincidental that re-activation interval has reached. Read more here:https:\/\/docs.microsoft.com\/en-us\/windows\/deploy...In this case, the administrator should troubleshoot this. The internal DNS Server and the KMS server in KMS SRV DNS record must be reachable via VPN, in order for client computers to activate Windows successfully.","If you are using a volume licence this didn't come from the Dell upgrade from Windows 7 to Windows 10. These are business licences that require connecting to a domain server to access the activation server to re-arm the licence.If this is the case then the IT dept. should advise.","Yes neilpzz, this was a business license acquired with Volume License website.What IT dept are you talking about. I am my company IT department.Please advise...thanks!  "]},{"symptom":"Lost my windows 10 pro digital license linked to my microsoft account as ssd was stolen. Now need help to get my digital license back.        Hello ,My name is Uwais . I had windows 10 pro from 2016 tied to my microsoft account and it used to windows is activated with a digital license linked to your account.I was upgrading my computer now in november of 2019 as my power supply killed my motherboard and cpu.So i upgraded to a amd platform ryzen 5 3600 and also had to buy a amd motherboard, But my windows was installed on my ssd.During building my new computer my ssd was stolen by a merciless d head and so i lost the drive where windows was already installed.So i had to install windows again on my hard disk. After i finished installing and adding my microsoft account it still says windows is not activated. When i did trouble shoot and then i did recently changed hardware option then it showed my my old motherboard name.When i clicked on it it said cant reactivate from this device please buy a new license from store or something like this. So i thought i should remove this old one from my devices in my microsoft account dashboard. But even after removing it it still doent let me activate it. It says cant find any devices linked to your microsoft account that can be used to reactivate. I dont know what to do as i have no clue going about this now. Any help will be appreciated.Thank you.","solutions":["Unless you have a Windows retail purchased key then you have to buy Windows 10 because you have a new computer.  If you have a retail purchased key you should have transfer rights.   Do not purchase a cheap key as it is probably not legal. ","Unless you have a Windows retail purchased key then you have to buy Windows 10 because you have a new computer.  If you have a retail purchased key you should have transfer rights.   Do not purchase a cheap key as it is probably not legal. Helllo Lacrumb Thank you for your reply . I don't have a retail purchased key as I upgraded from windows 7 ultimate edition. Also now I ordered a new m.2 nvme Samsung ssd . If I don't have any other choice other than buying windows 10 key then after buying if I put my old digital license account again and also put in the new key will I get any error or should I create new Microsoft account . Also is my old digital verified license lost and cancelled. Thank You ","The digital license was tied to the old motherboard so you will get anther one when you purchase Windows 10 again.New motherboard means new computer.","I have similar problem.  I upgraded from win7 ult to win10 pro 3 yrs ago.When I had trouble upgrading to 1709, I had a tech do a remote install upgrade.  Shortly after I got a message that I needed to activate my machine.  I did another inplace upgrade and it worked until I got some updates in November.  Again a message to activate.  That is where I am right now.  I cannot use the mediadcreationtool.  It fails everytime.  I cannot get a tech to help. I get hungup on everytime.  I have tried all of the tricks posted on message boards etc.My guess is that somewhere, someone labeled my license as invalid.  Who can I find to fix this?????"]},{"symptom":"Usage of 'Negative number format' in regional setting        Would like to know the usage of 'Negative number format' in regional setting. A user change this to \"()\" and some program crash. There is another setting 'Negative number format' which make the setting more ambiguous. ","solutions":["Hi my name is Jay, I'm an independent advisor. I'd be happy to help with your inquiry.To further isolate the issue, will you be able to provide a screenshot on where the \"Negative Number Format\" was changed? I tried to replicate it but only found drop down options under Regional Settings. Can you also provide the name of the affected program and describe what's being performed when it crashed? Have you tried to click on \"Reset\" to restore the Number Format to Default? Thank you and regards, Jay","Hi Jay,Thanks for your help, please find below setting. Microsoft allow to put anything other than'-' , I would like to know why this is allow to change and what is the impact to change this. Is there any resource\/documentation saying that this should not be change or when should change this?","Hi Tong, I noticed you didn't capture the whole window of customize format in your screenshot, have you already clicked on Apply button? I tried to replicate what you've shown, I was able to put the \"0\" value but got an error when I tried to apply the change (you can either put a space or a negative sign). I believe it will be the same if you try to click on apply button and won't be able to change the value to zero. I haven't found any documentation that will point that changing the value will affect any programs in any way, unless you provide which application or program got affected when you changed it.Regards, Jay","Hi Jay,I didn't get any error and able to apply it. My question is \"why windows allow user to change this?\"\"(you can either put a space or a negative sign)\"  - any documentation from Microsoft saying this? if i put something else like \"()\"?","Hi Tong,Here are some articles that I found regarding the information you're looking for:https:\/\/support.office.com\/en-us\/article\/change...https:\/\/www.softwareok.com\/?seite=faq-Windows-1...I hope this helps, thank you. Regards,JayDisclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Jay,Both links doesn't explain\/touch 'Negative Sign Symbol'. By the way, thanks for you reply.","Apologies as I wasn't able to provide the answer to your inquiry. I will reopen the task so that another expert can help you."]},{"symptom":"file sharing        i set up file sharing on my desktop but cannot see it on laptop","solutions":["Hi Kpar. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Windows sharing has been broken ever since they removed Homegroup, causing many to believe this was intentional to push us to OneDrive sharing. More about that option later.I'll give you everything possible to try for file sharing problems so at least something will work. If you need help performing any steps I am standing by here to help:See here for how to share files and printers over network after removal of HomeGroup in Version 1803:https:\/\/www.windowscentral.com\/how-share-files-...https:\/\/www.tenforums.com\/tutorials\/111783-shar...https:\/\/www.windowscentral.com\/how-access-files...To troubleshoot sharing problems: https:\/\/www.lifewire.com\/troubleshooting-window...https:\/\/windowsunplugged.blog\/2018\/03\/27\/networ...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/superuser.com\/questions\/1202441\/windows...If you cannot get past the password protected sharing prompt: https:\/\/www.isunshare.com\/windows-10\/fix-enter-...https:\/\/www.speedguide.net\/faq\/windows-is-askin...https:\/\/www.tenforums.com\/network-sharing\/61689...If Windows 7 is involved make sure if applicable you have the WIndows Update released to fix Windows 7 sharing issues here:https:\/\/www.bleepingcomputer.com\/news\/microsoft... Test if turning off Controlled Folder access helps: https:\/\/www.thewindowsclub.com\/controlled-folde... See these additional resources for when a PC does not show up on network: http:\/\/woshub.com\/network-computers-not-showing...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/social.technet.microsoft.com\/Forums\/en-...You may want to change to sharing via OneDrive: https:\/\/www.computerworld.com\/article\/3256907\/m... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Super unstable wifi        Laptop - Acer Nitro 5Wifi Adapter: Qualcomm Atheros QCA61x4A Wireless Network AdapterISP: RogersWifi crashes a bunch and is super laggy. Used to be super solid for a year, yet now I lag hard in games and usually crashes during matches. It's very random, too. Sometimes I get 3 hours of solid usage before it crashes, other times it crashes 5 times in 2 minutes. Constantly have to use troubleshooter which either gives 2 responses - \"Default gateway not available\" or \"There is a issue with the broadband modem\". I'm not even sure it's my wifi adapter as sometimes when I use my phone it's stuck loading a website and the next time I try it's fast again. Things I tried:-Uninstalling and reinstalling drivers-Disabling the 'cut power to network adapter' option-Resetting network settings in windows to factory default-Downloading the latest drivers for my network adapter-Resetting router -Plugging in to ethernet (was stable, but still had an odd lagspike and plus my cable is super short)-Trying different frequencies (2.4ghz used to be stable now it has massive lagspikes, but rarely crashes)-Cleaning my laptop-Using inSSIDer - my channels are clear and have a good signal.-I get 200mb\/s download on speedtestKinda at my wit's end. I'm not sure it's a software issue, hardware issue, router issue, isp issue, or all of them. My router gets a ton of \"critical error - no ranging response received\" as well. My adapter says it's working fine, though I don't trust that. Other electronics experience lagspikes as well, though I don't use them enough to expierence a crash. A couple months ago rogers installed new wires into the ground and my friends have been expierencing some instability as well. I'm not sure which one it is.","solutions":["Hello SomePoptarts, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.When all of your electronics appear lagspikes of some kind then the problem likely is with your connection and not with device settings. Moreover since you tried it with a cable the problem isnt any adapter or signal interference.I would look at the endpoint of your network for the cause of trouble. Update the router firmware if outdated to keep intruders out. If you measured this thoroughly already the best will be to also contact your provider about the issue.Your provider ought to deliver some kind of stable connection or he might breach his contract.If the provider denys the problem you got to take measurements by metering your connection to then use the evidence but for now informing them about the problem might be just enough for them to look for it.If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","Little correction: When all of your electronics appear *to have* lagspikes of some kind then the problem likely is with your connection and not with device settings."]},{"symptom":"Get error code 0x80004005 when trying to setup mail accounts in Windows 10 mail app        I'm trying to add a mail account to the windows 10 mail app. When I try to add my outlook account a pop up shows that its creating account with little dots following and then I get a popup saying that something went wrong and I get the error code 0x80004005.  I also tried to add a yahoo account and it prompted me to login to the account and then once i completed answering everything I got the same error of something went wrong and error code 0x80004005. I ran the troubleshooter for the mail app and nothing changed.","solutions":["Hi msusernj My name is Sarah Kong and I am an independent adviser that is here to try and help you with your issue.Let's rule out windows corruption. You can try a couple things. Right click your start button and select Command prompt (Admin) to bring up elevated Command prompt.In Command prompt type sfc \/scannow and press enter. Restart the computer. If that doesn't work then try this, Right click your start button and select Command prompt (Admin) to bring up elevated Command prompt.In the Administrator: Command Prompt window, type the following commands. Press Enter key after each command: DISM.exe \/Online \/Cleanup-image \/Scanhealth DISM.exe \/Online \/Cleanup-image \/Restorehealth Important: When you run this command, DISM uses Windows Update to provide the files that are required to fix corruptions.To close the Administrator: Command prompt window, type Exit, and then press Enter.Restart your computer.","I tried both of your recommendations and still have the problem. When I did the scans and repairs, both times it said that no errors or corruption was found.","Hello msusernj, I'm Independent Advisor and Microsoft MVP, here to help you with your question. Try re-registering Mail app. Perform these steps: 1. Search for Windows PowerShell using Cortana or Windows Search. 2. From results, right click on Windows PowerShell and select Run as administrator.3. Then type following command and press Enter key: Get-AppXPackage -AllUsers -Name microsoft.windowscommunicationsapps | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register “$($_.InstallLocation)\\AppXManifest.xml” -Verbose}Let the command complete. 4. Close Windows PowerShell and see if the issue is resolved now. Let us know if this helps!","Try running the Windows App troubleshooter Got to search and troubleshoot Scroll down to the bottom Click Windows Store Apps Click Run the Troubleshooter That does not work then try resetting Windows Store Go to search and type command prompt right click and select run as administrator.Type the following and hit enter WSreset.exe Reboot","I tried this and the first time I ran it I got an error that an app was running. I closed the window and reran the script and it stated that it was verbose mode. It just sat there for over 2hrs, and nothing looked like there was anything happening. I rebooted the laptop, tried to install the mail app, had many problems with that. When i tried to add my outlook account after many attemps and laptop restarts, i still get the error 0x80004005 for my outlook account and when I tried to add my yahoo account I got an error code: 0x8007139f. ","I ran the troubleshooter and that did not help. I then ran the wsreset, and that allow me to download the mail app. When I tried again, after numerous reboots\/restarts, I still get an error code 0x80004005 for when I try to add my outlook account and an error code 0x8007139f for when i try to add a yahoo account.","Try creating a new account on your pc See if it works in there. see link https:\/\/support.microsoft.com\/en-ca\/help\/402692...","I created a new account and still got the same error code 0x80004005. The frustrating part is I have no problems when I login to the websites for any of the accounts. I also tried to add my gmail account and got error code 0x8007139f.I am on Windows 10 build 1809 version 17763.292 if that helps.","Try refreshing your windows by doing a repair upgrade. See link by Andre to do that. This will not wipe apps or data but make a backup of your data just in case. https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Same problem here.Fresh Windows 10 installation (1809).Windows mail works properly when I add an account on a user with administration rights. When I try to set up windows mail for regular user - 0x80004005 error.Any idea how to fix it?I guess that it has a connection with settings for application mail and calendar.Unfortunately, options for this app are not available for a regular user. (buttons are grey and not enabled) "]},{"symptom":"EPG warning        I have EPG123 installed on my WMC to replace the ROVI Guide.  But every time I invoke the guide in MCE I get a warning message from Microsoft about replacing the old ROVI Guide.  I need to know how to disable the message from repeatedly NAGGING me to take action (which I have ALLREADY done!).  Please reply to me quickly before I have a nervous breakdown.Thanks in advance,- johndgorman1","solutions":[]},{"symptom":"how do I delete my signature in outlook email        How do I delete my signature in my outlook email?","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.If you use Outlook on the web:https:\/\/support.office.com\/en-us\/article\/create...If you use Microsoft Office Outlook:https:\/\/support.office.com\/en-us\/article\/create...Let us know if there are any other questions."]},{"symptom":"Wireless display returning me \"Couldn't connect to your device. Try to reconnect through the action center.\" every time        The title says it all, every single time i try to connect to my samsung 6 series 50\" TV i see the \"connecting to xx\" at the top of my tv screen and then it goes away and a few seconds later on my pc it says couldn't connect, every single time, im using the Wifi 6 antenna that came with my ASRock x570 Taichi motherboard (which is an intel Wi-Fi 6 AX200 160 MHz) and the system is using a Radeon RX 580 8 GB and a ryzen 5 2600 cpu, along with 16 GB of DDR4 16GB 3000 MHz CL16 RAM, and although the RAM information probably doesn't matter, i'm going to include it anyways, since there has not been a single instance of my solution on the entirety of the internet, so the system is perfectly supported, it even says its supported, and its connected via ethernet as well, so once connection is established it could also use miracast over Infrastructure if the wireless connection fails, so there really should be no reason as to why this isn't working, but i'm no network engineer, so i can't seem to solve it no matter how hard I try, i should also add, going into device manager and clicking miracast devices reveals a device labelled Samsung 6 series 50\" TV, and going into it's properties and revealing its events shows three messages that are what i believe to be the reason this isn't working shown below.\"Device installed (miradisp.inf_amd64_9226386ab2b27633)Driver Management concluded the process to install driver miradisp.inf_amd64_9226386ab2b27633 for Device Instance ID SWD\\WIFIDIRECT\\9E:8C:6E:1F:26:87#MIRACAST with the following status: 0x0.This message occurs before the \"Device started (WUDFRd)\" message every time.And the next message occurs after the device started message   \"Device Configured (Miradisp.inf)\"Device SWD\\WiFiDirect\\9E:8C:6E:1F:26:87#Miracast was configured.Driver Name: miradisp.infClass Guid: {d421b08e-6d16-41ca-9c4d-9147e5ac98e0}Driver Date: 06\/21\/2006Driver Version: 10.0.18362.387Driver Provider: MicrosoftDriver Section: MiraDisp_InstDriver Rank: 0xFF2000Matching Device Id: WFD\\MiracastDisplayDeviceOutranked Drivers: Device Updated: falseParent Device: SWD\\WiFiDirect\\9E:8C:6E:1F:26:87And the next message after that says\"Device install requested\"Device SWD\\WiFiDirect\\9E:8C:6E:1F:26:87#Miracast requires further installation.I've tried uninstalling the samsung tv in device manager, and restarting, as well as restarting after having attempted connection once to attempt to allow the \"further installation\" this event message mysteriously speaks of to no avail","solutions":[]},{"symptom":"Cannot Install Update 1903        It fails at 60% complete every time, telling me \"Windows could not configure one or more system components. To install windows, restart the computer and then restart the installation.\"Thus far, I have attempted to install it:1) As prompted by the XBox Gamepass for Windows installer2) Directly through Windows Update3) With a USB and then a CD created using the Media Creation Tool4) Using the Windows 10 Upgrade AssistantI have also tried clearing out my software distribution folder and running the Windows Update repair tool. If anyone has any recommendations I am all ears.","solutions":["I’ve managed to fix this issue for myself, I too was having the exact same message pop up at exactly 60%, and was unable to disable IIS. What worked for me was this:1. Boot in Safe Mode2. Delete the contents of C:\\ProgramData\\Microsoft\\Crypto\\RSA\\MachineKeysif like myself you have issues regarding permissions and it won’t authorise you to delete them, rename the folder to something else, move it elsewhere (desktop will do) and create a new MachineKeys folder in C:\\ProgramData\\Microsoft\\Crypto\\RSA\\ - effectively giving you the same result as deleting the files in there as you’ll now have an empty folder. 3. Rename C:\\Windows\\System32\\inetsrv to inetsrv.old4. Boot back up in normal mode5.  Go to Control Panel - Uninstall a Program6. Go to Turn Windows features on or off7. Uncheck ‘Internet Information Services’, click okay and pray that it doesn’t encounter an error.After spending days attempting to find a way to disable IIS, this is what worked for me. Once I succeeded I applied the update to 1903 and it worked, no freezing at 60%! If anyone still has issues after trying this, say so and I’ll look back through this thread and list anything I have done that hasn’t already been suggested."]},{"symptom":"Apps & features disc space doesn't add up to storage use listed        Under \"Settings,\" and \"Storage,\" my OS_Install (C:) total size is 238 GB.Under \"This is how your storage is used and how you can free up space,\" it says...Apps & features....98.8 GBYet even a cursory total of all programs listed (by size) under Apps & features reveals a total of about 1.5 GB.And, a bunch of programs are listed at the bottom (including at least one that needs a lot of storage space) without *any* numbers.Should I presume that the Settings -> Storage utility is incapable of listing ALL programs and all of the space they require?Why the massive difference (98.8 GB vs 1.5 GB)?","solutions":[]},{"symptom":"Wrong Characters from Slack Notifications        Hello,I've recently been experiencing problems with notifications from the application Slack. For some characters, it replaces it with some sort of HTML special entities. Does anyone know a specific fix for this issue? Below is an example of what I'm experiencing.Thanks, GavinMoved from: (Office | Unknown\/other | Windows 10 | Office 2016)","solutions":["Hi, Thank you for writing to Microsoft Community Forums. We understand your concern as you are experiencing problems with notifications from the application Slack. Upon checking the screenshot that you have posted, we can see in the notification message that the html entities being displayed. In order to get clarity and to assist you accordingly, please reply with the answers to the questions below.What is the Windows 10 version and Build (1903\/1909) installed? (Typewinver in Windows search\/Run command)Are you aware of any recent changes on the PC, prior to this issue?Do you see this issue on notifications for other applications? However, most of the times the issues with toast notifications are application specific. Hence, I would suggest you to repair the app from Windows Settings.Press Windows + I key to open Settings.Click on Apps and select Apps & features from the left pane.Search for Slack app and click onAdvance option.Click on Repair and check if the issue persists.If the issue persist then Reset the app.Note: Resetting the app will not delete the data but you need to reconfigure it with the email account that you were using prior to the reset. Also refer this article from slacks and check if it helps: Guide to desktop notifications If the issue still persists, then please contact (click the link and select Help Centre under resources)Slack forum for further investigation on this issue. We await your response. Aditya RoyMicrosoft Community – Moderator","Hello,I am on version 1909 for Windows 10. Unfortunately, for the Slack notification, advanced options doesn't appear. I can find it on my other applications, but not Slack. I contacted Slack and it is a well known issue for them, so it likely isn't a problem you guys can fix.I appreciate the help.Gavin","Hi Gavin,Thank you for your response and the information.Yes, if you installed Slack from the slack website, you will not get the advanced option in Apps & feature. If you have installed Slack from Microsoft Store, then you will be able to see the Advanced Options like the others.However, as you have mentioned that the issue is from Slack, then wait for the resolution from there end.Hope, I am able to guide you to the right direction and we appreciate you time and patience for troubleshooting the issue.Regards,Aditya RoyMicrosoft Community – Moderator"]}]}