{"windows":[{"symptom":"Can't access Downloads folder in Windows 10        When I try to open my Downloads folder, I get the spinning circle and the message 'working on it'. The downloads folder never opens and when I try to close it, it crashes Windows explorer, which then quickly reloads by itself. All other folders (documents, pictures, etc.) open normally. But here is the weird thing: the download folder in question opens and displays just fine over my network and its contents are visible and can be read\/written to by all of my network computers. It is only the computer on which the downloads folder resides that is unable to open the folder. I have never encountered a problem like this. If there were file corruption issues or some other problem with the downloads folder, I wouldn't think that it would open over my network either. Thanks for the assistance!","solutions":["I had the same problem,This worked perfectly for me:https:\/\/www.itechtics.com\/downloads-folder-freeze\/","Is this only the Downloadsfulder under This PC, or do you also see the issue with c:\\users\\<username>\\ Downloads?Keith"]},{"symptom":"goggle voice        HiI have a goggle question does anybody know where to enable goggle voice cant find it in the settings?THANK YOU","solutions":["Well, Google Hangouts and Google Voice are two entirely separate (but cooperating) apps. Google Hangouts is also a Chrome extension and if you don't want it, click Remove, just as your image shows."]},{"symptom":"Touchpad zoom\/ pinch feature issues        I'm trying to turn off the touchpad's zoom feature on my Lenovo Ideapad 130-15ast that has Windows 10 and cannot for the life of me figure it out. There is no 'Device Settings' tab, no 'UltraNav' tab or anything suggested or listed elsewhere and it's driving me up a wall. Trying to write essays and getting zoomed clear out or in because I brush the touchpad is infuriating and frustrating. I am not a tech-fluent person, so simply termed would be best. Also- My audio going up and down and back up every song, video or audio clip- even mid-song at times is another issue. It's deafening me when I have one clip going, three minutes in, then it jumps clear up in volume. I need it fixed and don't know how.","solutions":["Go Settings, Devices, Mouse, Additional mouse options, Touchpad.","Hi Mikka. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Check in Windows Settings > Devices > Touchpad and also the Additional Settings including the last tab the touchpad software will install with more Settings.Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Sound won't turn up or down while airpods are connected.        So I'm trying to listen to Spotify and I connected my air pods but my volume wont go up or down. It stays as one volume and doesn't change. I can move the volume bar with my mouse but it doesn't change pitch its just the same volume the whole time. I don't know how to fix it because when I disconnect my air pods the volume works but when connected it doesn't.","solutions":["When you click the speaker on the taskbar is there an ^ after the title?  If so click on it and pick another title."]},{"symptom":"You do not have sufficient privileges to install the program to install Canon Printer Driver        Hi I am getting \"You do not have sufficient privileges to install the program to install\" when I attempt to install a wireless Canon Printer Driver.Please note I am the only \"Admin\" on this laptop. I tried the solutions posted on the net like \"Run as administrator\" and \"net user administrator \/active:yes\"; none worked. Any solutions?I am using Canon ImageClass MF244DW; Windows 10 Pro Version 1909. THank you","solutions":["Hi, Thank you for posting your concern. I am Paulo, a Community advisor. Let me assist you with as much as I can.I found an existing article that might help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/answers.microsoft.com\/en-us\/windows\/for...I hope this helps with your concern! Please let me know if you have further questions.","Hi PauloThanks for this. I don't understand why the solution should be so complicated as mentioned in that thread? Please note:- Windows is up to date.- I did not lose the Admin privileges. I am the admin.- I created a \"Local Account\" and changed the account to Admin but when I restart the laptop I cannot log in to that account to try to reinstall the driver. - I have an antivirus (Webroot SecureAnyWhere). I cannot uninstall it because the company needs to install it again; they are in a different state. - Device Guard is not installed.- This is a brand new laptop and I don't think System Restore would work.The problem still exists. "]},{"symptom":"Escritorio remoto, Inicio de sesion        Hola, me gustaria saber con que usuario y contraseña puedo asociar la app escritorio remoto de mi telefono android, ya que lo intento con mi cuenta de microsoft y no puedo acceder. ayuda por favor. gracias de antemano.","solutions":["Hola Soy Edisson, un Asesor independiente dispuesto a ayudarte. ¿Cuál aplicación de Android estas usando para este fin? Si estas utilizando la aplicación que diseño Microsoft, debes tener en cuenta lo siguiente primero:https:\/\/support.microsoft.com\/es-co\/help\/402837...Atento a comentarios, coméntame si la información te fu de utilidad. Saludos, Edisson V","Hola. Estuve usando RD Client, descargada de Google Play Store en un Sony Xperia XZ. He intentado de todo y la informacion que hay en el Centro de Soporte no me ayuda en nada. Trato de iniciar sesion con mi cuenta de microsoft pero el RD Client no me deja. Lo desinstalare a ver si la version Beta me ayuda a lograr esta vinculacion.","Realice todos los pasos para la activacion de escritorio remoto en mi PC y en mi Xperia. pero simplemente no funciona. ","La versión Beta te lo permitió?"]},{"symptom":"Canon CR3 Codec for Windows 10        Are there already codecs out there for thumbnails in Windows Explorer Windows 10 for Canon CR3 files?Thanks","solutions":["Hello, Microsoft doesn't specifically have one; however, there are some third-party apps that do...https:\/\/www.fastpictureviewer.com\/codecs\/The above apparently can be used.","The last update for this software was in April 23, 2017 1.5 year which is before canon created the CR3 os probably not going to work.","Hi, This version may also work as it uses the raw-level coding of the file: https:\/\/www.fastrawviewer.com\/blog\/FastRawViewe...Try this out and let me know.","not working","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.There are several suggestions from other users that this software will provide the functionality you are looking for:https:\/\/www.faststone.org\/FSViewerDetail.htmRegards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I am looking for fixing the thumbnails in Windows Explorer (Windows 10) not for third-party software browsing images.","HI, Unfortunately Windows doesn't provide that functionality, however this is the closest alternative.Regards, Ross","Hello, Microsoft doesn't specifically have one; however, there are some third-party apps that do...https:\/\/www.fastpictureviewer.com\/codecs\/The above apparently can be used. Faststone viewer works good","<?F4FORM version=\"0.93\"?> <F4REPORT xmlns=\"http:\/\/fz122.fss.ru\" xmlns:xsd=\"http:\/\/www.w3.org\/2001\/XMLSchema-instance\" xsd:schemaLocation=\"http:\/\/fz122.fss.ru\/doc\/f4form_2017_3.xsd\"> <TITLE T1R1C2=\"8\" OKVED=\"22.29\" REG_NUM=\"7701064046\" KPS_NUM=\"50431\" INN=\"7743937981\" KPP=\"504701001\" OGRN=\"1147746985484\" QUART_NUM=\"03\" YEAR_NUM=\"2018\" NAME=\"ОБЩЕСТВО С ОГРАНИЧЕННОЙ ОТВЕТСТВЕННОСТЬЮ \"СТРОЙПЛАСТ\"\" CRE_DATE=\"2018-04-12\" CEO=\"МАСЛЯНКИНА ОКСАНА АЛЕКСЕЕВНА\" CADDR=\"643,141446,50,,ХИМКИ Г,ПОДРЕЗКОВО МКР,КОМСОМОЛЬСКАЯ УЛ,16,,\" Upoln=\"1\"\/> <F4INFO T1R3C2=\"599869.57\" C1=\"197869.57\" C2=\"201000\" C3=\"201000\" RATE_MIS=\"0.5\" IS_INV=\"0\" IS_BUDJET=\"0\" T7R1C1=\"0\" T7R3C1=\"0\" T7R5C1=\"989.35\" T7R6C1=\"1005\" T7R7C1=\"1005\" T7R18C1=\"0\" T7R19C1=\"739.97\" T7R40C1=\"739.97\" T7R21C1=\"0\" T7R27C1=\"0\" T7R30C1=\"989.35\" T7R31C1=\"1005\" T7R34C1=\"265.03\"> <PAYM_ORDER NUM=\"66\" DT=\"2018-02-09\" SUM=\"989.35\"\/> <PAYM_ORDER NUM=\"172\" DT=\"2018-03-06\" SUM=\"1005\"\/> <\/F4INFO> <\/F4REPORT>"]},{"symptom":"i LOCKED MYSELF OUT OF COMPUTER.  Links dont work on sign in page either.  Can I recover my password for that computer from this computer?  or any other suggestion would be very welcome        Links dont work on sign in page either.  Can I recover my password for that computer from this computer?  or any other suggestion would be very welcome","solutions":["Hi Paco. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Yes for a MS account you can change the password here: https:\/\/support.microsoft.com\/en-us\/help\/402683... Then make sure the PC is online at the sign in screen from network icon in bottom corner so it sync's the password.For Local Account you have to have the test questions set up ahead of time to reset password from sign-in screen.I will give you everything possible to fix sign in failure so that at least something will work, based on helping with this issue several times a day for years. I'll also be standing by to guide you as needed:Try restarting the PC to see if anything changes. Then see the various troubleshooting steps here: https:\/\/www.groovypost.com\/howto\/reset-windows-...https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/www.groovypost.com\/howto\/recover-lost-w...This could also be due to account corruption so see the fixes here: https:\/\/www.techbout.com\/fix-corrupt-user-profi...If you cannot sign in then it will save time to create a new Admin account to replace the old one.Follow this tutorial to enable the hidden Built-in Administrator from the Sign In screen:https:\/\/www.isumsoft.com\/it\/enable-hidden-admin..., sign into it, create a new Local or Microsoft Admin account in Settings > Accounts > Family & Other People, sign into it, move your files over, test all programs run correctly, then when ready delete the old account and hide the built-in Admin again. You can then change to your MS Account.You can also run the Repair Install from the Admin account to see if it fixes the old account first, by install the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.If none of the above work You may need to create bootable media to access Repair Mode or do the Clean install:To create Windows 10 Installation Media on another PC install Media Creation Tool and follow the directions here:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... Uncheck the box for Recommended Settings to choose the exact version and bit rate for the target PC only.Insert media, boot it by powering up PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... If the media won't boot you may need to enter BIOS\/UEFI Setup (pressing key given in chart in link above) to turn off Fast Boot or Fast Startup first.Choose the boot device as a UEFI device if offered, on second screen choose Repair Your Computer, then Advanced Troubleshoot Options, then Command Prompt to try the steps here to enable Built-in Admin to do the above steps to create a new account and move into it: https:\/\/www.tenforums.com\/tutorials\/2969-enable...If that fails go back to Troubleshoot Options to try a Reset. If that fails choose Install Now, then Custom Install, then at the drive selection screen delete all partitions down to Unallocated Space to get it cleanest, click Next to let it create needed partitions and start install - this makes it foolproof. Everything needed to get the best possible Clean Install is here: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki.... It is a better install than any amount of money can buy and a great learning experience that will make you the master of your PC because you will learn what works best and how to apply it with your own hands. If you have files that aren't backed up you can use the same bootable media to try to rescue your files using this method:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows10 upgrade        Was upgrading from windows 7 Ultimate was at 27% when got a message \"dwn.exe - system error\" - went on to say buffer overflow.  Would not continue the upgrade - actually froze - and had to revert to Windows 7. Any ideas?","solutions":["Try going to youre pc mfg web,downloads,see if any are for youre pc model & Win 10.If so,the pc is compatable,if not,then maybe the pc hardware is not Win 10 able.If it is,download Microsoft Windows Upgrade Assistant.Or Windows Media Creation Tool.https:\/\/social.technet.microsoft.com\/Search\/en-US?query=windows%2010%20upgrade%20mgr&ac=5","Thank you Andrew, the machine is a Dell and I was using the Media Creation Tool from the official Microsoft website."]},{"symptom":"I cannot install my TTF fonts via control; panel that I have purchased before (Not from Microsoft) January 2020        January 2020I want to install some of my stored TTF front that I have purchased for a project and for some reason, the latest Win 10 update now do not allow you to add a font EXCEPT if you buy them from Microsoft. This seems unfair competition and  we lose the freedom of choice to install some of the wonderful fonts out there. We used to be able to right click on the font and it would install but this feature is now missing.H E L P please.","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.Just open it by double clicking above and clicking install ... like the photo below.Marco ;-)"]},{"symptom":"Word\/Scan disK        Hi! Can anyone tell me where I can see where a dialogue is? I am not the greatest IT person and I have recently purchased a new HP computer. Use to Mac. I have been trying to see stuff I saved onto my USB drive from the MAC. However, the support page keeps popping up and saying I can't see the file until I close the dialogue.Thanks!","solutions":["Hi, My name is Will, i'm an independent adviser. A dialogue box or window refers to popups programs use to draw the users attention. For example you might have seen one when you try to close a program when editing a document. And a Window popups up asking you if you want to save first.Have you got a link to the support page? I might be able to help yo troubleshoot this further.","Hi, My name is Will, i'm an independent adviser. A dialogue box or window refers to popups programs use to draw the users attention. For example you might have seen one when you try to close a program when editing a document. And a Window popups up asking you if you want to save first.Have you got a link to the support page? I might be able to help yo troubleshoot this further.Thanks so much! Greatly appreciate your reply! It helped!"]},{"symptom":"Windows 10 Random Shutdown        Few weeks ago, I install Windows 10 Pro 1909 on my laptop. First few days with it I had no problem whatsoever.But, for past few days my Windows 10 shutdown randomly. It makes me really uncomfortable when working with my laptop.What should I do to fix this?","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.To better understand the issue, Please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.","This is my System logsLink: https:\/\/1drv.ms\/u\/s!AjIjlI5vEiqSgiRsyMZnuu8c3utK?e=oRRxAG"]},{"symptom":"Search tool, feedback hub, windows recovery not working. How can I restore everything to normal again?        Hi I am having a problem:Search tool, feedback hub, windows recovery are not working at all (I click and nothing happens). How can I restore everything to normal again?Thank you.","solutions":["Hi Felipie, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The best way to fix is to do a repair install but let us check if SFC helps first.Do a System File check and run DISM tool and post back the results in the next reply:http:\/\/www.yourwindowsguide.com\/2016\/06\/run-sys...Content on the above blog is written by a Microsoft MVP so it is safe."]},{"symptom":"Startup repair couldn't Repair your pc        HELPMy laptop froze. I had to press the power off button to turn it off.Since then, when I want to turn it on, I have \"please wait\" showing up. Then, i land on a blue screen with the options Troubleshoot or Shut down. If I choose Troublshoot, I land on the Advanced options page with Startup Repair, command prompt, uninstall updates, uefi firmware settings, system restore, and system image recovery options.If I click on Startup Repair, i have the message \"Diagnosing your pc\" and then \"Startup Repair couldn't  repair your PC\".I can then Shut down or go in Advanced Options. Etc. Please, help!!!!","solutions":["Hi Chris, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Let us try repairing the existing OS. On a working computer, create an Installation media of Windows 10 that allows you to repair existing Windows Installation.Create a USB Flash Drive https:\/\/www.tenforums.com\/tutorials\/2376-create...Boot from the USB Flash drive-Make sure you have disabled Secure boot\/Fast boot in BIOS Settings.https:\/\/www.tenforums.com\/tutorials\/21756-boot-...https:\/\/www.tenforums.com\/tutorials\/21284-enabl...Then open Advanced Startup options after the computer boots from USB. Click Repair your computer at the first screen that says Install now.https:\/\/www.tenforums.com\/tutorials\/2294-boot-a...Select Startup repair, let it finish the job and see if the computer can boot afterward.If that doesn't help, consider doing a clean install after rescuing your files. Rescue Files when Windows won't start https:\/\/answers.microsoft.com\/en-us\/windows\/for...How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: Tenforums is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Visual glitches throughout Windows        Getting a weird visual error throughout Windows. Not sure what to do.","solutions":["Hi, I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Please see the below options: Option 1.Try Rolling back if you have an option: Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do: 1. Uninstall everything of Display driver using DDU http:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot. 3. Make sure your device manager shows Microsoft Basic Display adapter. 4. Download the driver from the OEM or the maker like AMD 5.Run the Setup and you should be good to go. Disclaimer: Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Black Screen after last Windows update. Any solutions?        Black Screen blue's..","solutions":["Hi WE. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Here are steps to recover from failed Updates or Version Update install which causes Windows to fail to start or function. If any steps won't work then report back and move on to the next. At least one step will always work, leading up to if necessary doing an automated Reset or a gold standard Clean Install: 1) Try whichever method works in this tutorial link to get into Advanced Startup Options to run System Restore or Uninstall Updates button, or if this is a version update Go Back to Old Version:https:\/\/www.tenforums.com\/tutorials\/2294-advanc.... Easiest is to restart or force shutdown the PC 3 times to force it into Repair Mode.If you are able to access System Restore or Go Back and it fails, skip to step 3.2) If necessary borrow another PC and follow the steps in the middle of this download page to create bootable installation media to access the repair options if not accessible by any other method:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m.... The bootable media is also the only method that doesn't require the password if you're stuck on that.Boot media by powering up the PC while pressing the BIOS Boot Menu Key: https:\/\/www.sysnative.com\/forums\/hardware-tutor... You may need to enter BIOS\/UEFI Setup to turn off Fast Boot if it won't allow the Boot Menu key to interrupt starting Windows:https:\/\/www.mydigitallife.net\/comprehensive-lis... Choose UEFI version of media if offered, browse to second screen to Repair Your Computer link.3) Choose Advanced Troubleshoot options to run System Restore, or if this was a version Update choose More Options to Go Back to Old Version.If it rolls back then you can hide the Windows Updates and Version Upgrade responsible until they mature by installing and running immediately the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... There is a new option after Version 1809 to roll back Windows Updates from the Repair Mode in Option Four here:https:\/\/www.tenforums.com\/tutorials\/5486-uninst... If this fails try a Startup Repair, or go back to Troubleshoot Options on the previous screen to Reset your PC which will save your files while reinstalling Windows.4) If that fails you can use the booted media created in Step 2 to Clean Install the latest version which should get you past all difficulties as it has hundreds of thousands of others who have followed the steps in this link and never come back to report another problem: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The link compiles the best possible install of Windows 10 that will stay that way as long as you stick with the tools and methods given.There is a step to rescue files from the same bootable media: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.The media provided for the Clean Install is latest and normally the problems go away with the Clean Install, however if they don't you can find earlier version media to use here:https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD or create bootable 8+gb flash stick installer using this tool installed to Windows:https:\/\/www.microsoft.com\/en-us\/download\/detail... Then once you're back in Windows 10, you can block the problem Update using one of these methods:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...For Version Updates the most stable method to install is using the media as shown in these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Good news, Microsoft is giving back to users more control over Updates as announced recently here:https:\/\/blogs.windows.com\/windowsexperience\/201... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks Greg..","I'm glad to help. Keep me posted on your progress as I will be here to help until the case is resolved."]},{"symptom":"The Microsoft Store will not open        My Microsoft Store is stuck loading. This problem arose yesterday when Minecraft Windows 10 edition wouldn't log me in to my Microsoft\/Xbox account. I uninstalled the game and opened the Microsoft Store but it wouldn't open. The loading screen has a blue background with white rotating dots if that helps.Please help","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Follow these in order:1. Try Wsreset: First see if Windows Store Reset works. This should Reset Windows 10 Store cache and if there is a problem with cache, this would clear it.a. Open Run dialog box(Win+R)b. Type in wsreset and Press Enter2. The next step if Wsreset doesn't help is to Reset the Store app. To do this, follow the steps:a. Open Run Dialog box( Windows+R key)b. Type in ms-settings:appsfeatures and Press Enter(Alternatively, Start>Settings>Apps and features)c. Locate Microsoft Stored. Click Advanced Optionse. Locate and click Reset Button3. Reset Windows Update components: Resetting Windows update components might also help. Here is an article on how to do that.a. https:\/\/www.yourwindowsguide.com\/2015\/12\/reset-...4. Check for necessary services: Windows Store is dependent on some Services. Please check if the services are running and Automatic as given below.a. Right-click Start>Run and Type in Services.msc to open Services.b. Make sure the status of the following services is Automatic and runningi. Windows License Managerii. Background Intelligence Transfer serviceiii. Cryptographic Servicesiv. Windows Updatev. Windows Storec. If something is not as intended, you can try Restoring default serviceshttps:\/\/www.dropbox.com\/s\/vw3g7llzu6niode\/Resto...5. Repair install: The last Restort is a reinstallation of Windows. You can do a repair install, which keeps everything including your apps and files.a. https:\/\/www.yourwindowsguide.com\/2016\/06\/how-to...Originally written at https:\/\/www.yourwindowsguide.com\/2018\/08\/resolv...Disclaimer: The content is written from a Microsoft MVP, so it is safe.","Hello, the blue loading screen is gone now, but now my Microsoft Store looks like this and will not load.","Hi Kevin, Did you try all the steps?"]},{"symptom":"Recieving repeated error message. Unable to update.  Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) - Error 0x800711c7        Recieving repeated error message. Unable to update.  Windows Malicious Software Removal Tool x64 - November 2019 (KB890830) - Error 0x800711c7","solutions":["Hi, Kat5459 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.If you have a third-party antivirus, you must disable or uninstall it. Try reset Windows update components: Right click on the start button and select Powershell (admin) or Command Prompt (admin)Write the next hit enter after each line. net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Restart and try again. You can also download the Windows Error Solver: https:\/\/support.microsoft.com\/en-us\/help\/10164\/...https:\/\/aka.ms\/wudiag You can do it manually by downloading the Windows ISO. When updating with the ISO, disconnect the Internet. https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/answers.microsoft.com\/en-us\/windows\/for...","Nothing to do with Antivirus.  Try download from https:\/\/www.catalog.update.microsoft.com\/Search.aspx?q=890830    and install manually.  ","This helps protect your PC and keep it running smoothly.C:\\Users\\michael\\AppData\\Local\\Packages\\Microsoft.MicrosoftEdge_8wekyb3d8bbwe\\TempState\\Downloads\\windows-kb890830-x64-v5.77_ff94a50c30d2defcdfb0e843fa28e571b0d2ce75 (1).exeStill want to run this unverified app?this is the message I get. why? because i use w10 in mode s.why doesn't w10 in mode s install the nov malicious tool, when all previous monthly tools installed correctly?help!","* Merged. I give up on this total piece of crap. Lost the chat tech. the download did not work. FRUSTRATED.Microsoft should be embarrassed by the OS that they run, sell.","Hi Kat, please try to run Windows update troubleshooter: Settings, Troubleshoot, Additional troubleshooters.","why doesn't w10 in mode s install the nov malicious tool, when all previous monthly tools installed correctly?- \"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remo","why doesn't w10 in mode s install the nov malicious tool, when all previous monthly tools installed correctly?- \"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remoFirst, I get Access Denied on that support.ms.com link. Second - asking the typical WIn10S customer to ignore an error message is a lousy response. Third - why can't Windows Update determine it's delivering to a 10S device and turn the update off?","\"Win10-S mode is not supported, there is no added value of running MSRT on this platform. Any install failures of attempting to install the package can be safely ignored.\"Source: https:\/\/support.microsoft.com\/en-us\/help\/890830\/remove-specific-prevalent-malware-with-windows-malicious-software-remoFirst, I get Access Denied on that support.ms.com link. Second - asking the typical WIn10S customer to ignore an error message is a lousy response. Third - why can't Windows Update determine it's delivering to a 10S device and turn the update off?-  1. I have no problems accessing that link. Perhaps use another browser...2. Yes, weird isn't it...3. Don't ask me. I'm not working for Microsoft....","What a joke. Microsoft invents a new platform designed to run more efficiently and securely, then cannot even manage their own OS to detect and overt problems related to updates and security. This drive the common user crazy. At least include an error code that indicates update not required in S-Mode. ","Yes. One wonders."]},{"symptom":"Blue screen error while idle        Blue screen occurs after extended periods of time on idle, and not during normal use. The error is DRIVER_IRQL_NOT_LESS_OR_EQUAL (d1) Here is the link to the dumpdump file","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.The crash was caused by Memory corruption. The next step,Let us try finding any misbehaving driverEnable Driver Verifier: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki...(Must create a Restore point before)Upload the newer dumps when you get Driver_Verifier_detected_voilation. Please note that the system might crash before you reach the desktop-if it does please let us know so that we can guide you to disable Verifier.","I have followed the steps on your link and have gotten the new dump. I was greeted by a blue screen before windows booted the first time but managed to work around it.dump","Hi Hoodie, Weren't any minidumps generated from the crash? C:\/Windows\/Minidump","do you need all minidumps or just the latest file","Just the latest file."]},{"symptom":"Printing Doesn't Work at All Windows 10        I can't print from my laptop. I've tried everything and am desperate for solutions.It is not a problem with the printer, as I have been able to successfully print with other devices.Here is what I have tried to no avail:1) Restart PC and printer2) Remove and reconnect printer (it's a WiFi printer)3) Update, uninstall, and reinstall all printing drivers)4) Run the printer troubleshooter and try all fixesComputer: MSI GF63 9RCXPrinter: HP OfficeJet 3830 seriesI seriously don't know what's going on or why this is happening but I really need help. Any suggestions would be appreciated.","solutions":["My HP officeJet 8600 will not print as of Today.  When trying to print it wants to Save to a File location the output of the print .  I have checked ALL settings and set the Default to this printer.  It is a wireless printer and has worked fine on Win 10 for a long while until TODAY.","It may be hardware issue >>"]}]}