{"windows":[{"symptom":"ps4 controller connecting as an audio device        I have used this same controller and PC plenty of times with no issues. then one day I plugged in my controller and now it is only recognized as an audio device. I have tried disabling it and plugging it back in, updating the driver, uninstalling the device, e.t.c. nothing in any forum or help thread has worked for me that has worked for other people. and I would try going the Bluetooth route but my PC has always had trouble with Bluetooth and I have never managed to get that working either. now I am unable to play my games with my controller. please help.","solutions":["Hi TristanBale, I'll try to help you out. The issue with PS4 controlers is that they aren't \"plug and play\", and you need some \"tricks\" to make it work.What are you using as software in order to use the PS controler ? In the device manager, search for the controler, and the \"uninstall\" it (instead of disabling it).I'll wait for your news Regards"]},{"symptom":"Microsoft Store, and pretty much anything connected to it wont open.        Now i had in mind just resseting the PC, but i wanted to see if i could quickly get it done, for past few months i had things like Calculator and Store not wanting to open[ bassically i click on it and then, a square appears for a brief moment as if it were to open, but then it just dissapears] I wasn't too off this since i still had the browser so i could, just use some browser things, but i noticed even games didn't, well just 1 that i have, Forza Apex. Now i tried some things that i, well, could simply do, reset trough the apps and features, powershell and even check if i disabled something, but no, however while browsing some other discussions [which got me nowhere besides this] someone had link to microsoft store home on browser, when i enter it this message appeared, or error [ms-windows-store:\/\/home link to site now i remembered] 'This file does not have an app associated with it for performing this action. Please install an app, or if one is already installed, create an assoiciation in the default apps seetings page.' I actually already saw this when i gone trough Store trough browser [which going in normally then logging from inside worked, but when i clicked on install\/play button on any game this message also showed' I don't know what this exactly means, besides that it might mean i actually did somehow remove it or disable it.So i wonder if there is a simple fix for this, or do i have to reset windows.Note:I may not imedietly reply but i should come back to check on in few minutes.","solutions":["Hi, Lebhleb My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"pctures won't open in photo app.        I click on the picture I want to view, it comes up with the black screen in attempt to load and the a pop up comes up saying the app didn't load.","solutions":["Hi, SandyBrown5 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Log In        My Windows 10 laptop has an annoying habit in that when I leave it on for a period it goes to a \"screensaver\" showing pictures from around the world.  Unfortunately, once it does this I cannot get back to the log in page.  If I hit any key, mouse key or certain function keys, the picture blurs for about 15-20 seconds and then returns to the screensaver.  Nothing I can do will get me back to the log-in page.  The only thing I can do, is crash close the laptop and restart it, but that means I lose any work in progress.  Any suggestions on fixing this, frankly annoying,flaw?","solutions":["Hi EI Open the Settings App (gear icon on your start Menu) Go to System - Power and Sleep If you want to stop your PC from sleeping, set the time intervals to never on that page . . .While in the Settings App, go to Home - Accounts - Sign-In Options Is there a drop down at the top of that page regarding a requirement to log in after returning from sleep, if so, turn that off . . ."]},{"symptom":"How to sort photos by date in Windows 10. It's not easy apparently.        I just began using Windows 10 after using Windows 7 for years. It's been a huge change and I need some help with how to sort photos. I downloaded a couple thousand photos from my iphone to my pc and then renamed each one so they have titles. After I finished, I noticed they're all now displayed in alphabetical thumbnails which obviously means they're no longer in chronological order. I have tried numerous things but haven't been able to get them back in chronological order. The \"Sort by\" function won't let me remove \"by name\". Any ideas are welcome! So far, I hate Windows 10.","solutions":["HI Cindy. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.To do this in your User Pictures folder in File Explorer, show View tab and select Sort by: Date then Descending or Ascending as you wish.There is more about this including some tricks and tips here: https:\/\/pureinfotech.com\/how-to-perfectly-sort-...To use the new Photos app which can be used to edit, make pictures into Albums, create photo montage videos, etc. see here:https:\/\/www.techradar.com\/how-to\/computing\/how-...https:\/\/www.howtogeek.com\/320942\/how-to-use-win...Alternatives to the Windows 10 Photos app are here: https:\/\/www.guidingtech.com\/best-alternatives-w...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 printing issue; can only print as Administrator        Since the v1909 update borked my Windows 10 desktop machine, I did a clean install of v1909. Sadly, I haven't restored printing to its previous state. Printer is an HP LaserJet Pro MFP M127fn, driver & apps package freshly downloaded from HP (installer hasn't changed for years). I can print when logged in to one of my Administrators account, but cannot print from a standard user account. Event Viewer shows errors such as;The application-specific permission settings do not grant Local Activation permission for the COM Server application with CLSID {2593F8B9-4EAF-457C-B68A-50F6B8EA6B54} and APPID {15C20B67-12E7-4BB6-92BB-7AFF07997402} to the user HOME-DESKTOP\\me SID (redacted) from address LocalHost (Using LRPC) running in the application container Unavailable SID (Unavailable). This security permission can be modified using the Component Services administrative tool. Yes, I've uninstalled and reinstalled the HP driver and apps.Yes, I've run the Troubleshooter. Yes, I've tried a second standard user account. This permissions issue seems to go back at least a year or two, and obviously MS has not fixed it yet. There were no permission problems before, with the HP installer, so it seems to me that v1909 has some bugs. Is this even fixable? ","solutions":["The fact you say the driver hasn't changed for years may be the problem. As Windows 10 develops and the manufacturers don't keep up with new drivers then the hardware can reach the end of life.Using the software  in compatibility mode to run as administrator may now be the only way to use it for now and the future. Microsoft won't have anything to fix the responsibility is with HP.","Hi Really, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"How to change Personal Vault verification method from email to pin after initial setup        I just set up Personal Vault in One Drive. I did not see an option to use a pin. I currently enter my email address and receive a code to access. How can I change my verification method from email code to pin?","solutions":["Hi Mel, Please open the Personal Vault in your mobile, click the pull down menu at the top and select Personal Vault Settings. It will show you the Personal Vault PIN. We do hope that this will help you solve your current issue. Please give us your feedback once done. Thanks and regards,"]},{"symptom":"{Resolved} New downloads disappear after about a half hour post-download        I've been trying to download a large (about 4.6 Gigabyte) ZIP file. I was able to find it in the downloads folder when it was done, but after at least 30 minutes, the file goes missing and I have to re-download it. I can make a copy within that time and the copy is unaffected. Hidden files are shown and it doesn't affect past downloads.","solutions":["Hi Poke. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Download, install and run a full scan with the most powerful on-demand free scanner Malwarebytes:https:\/\/www.malwarebytes.com\/mwb-download\/.In the Scan Settings first set it to include scanning for Rootkits. If necessary run it in Safe Mode with Networking, or Safe Mode accessed by one of these methods:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... Clean up anything found, restart PC and then run again until it comes up clean. Check for any remainders in Settings > Apps > Apps & Features, and also in each of your browser's Extensions, Home Page settings, Search service or Add-On's as shown here:https:\/\/community.box.com\/t5\/How-to-Guides-for-... Then check for damaged System Files: https:\/\/www.lifewire.com\/how-to-use-sfc-scannow... If it cannot repair them see Step 10 here to continue: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Check OneDrive settings for Folder Protection and Files on Demand: https:\/\/www.tenforums.com\/tutorials\/116029-turn...https:\/\/support.office.com\/en-us\/article\/save-d...Try downloading in another browser to compare. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.If it turns out to be the browser deleting the download then reset it: https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...If you want to keep Malwarebytes as an on-demand scanner then you can turn off its Real Time trial version in it's Settings > Account Details tab.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.______________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thank you for the help. I've determined that the problem was the browser I was using. The problem was fixed for other browsers.","Hey Poke. I'm glad that worked for you. Let me know if there's anything else. Also when ready please mark the post which helped most as the Answer, to help others. A rating is also appreciated."]},{"symptom":"Unable to convert word file from PDF file, how to turn off encoding        Unable to convert word file from PDF file, how to turn off encoding","solutions":["Hi Dan, Please check these articles in order for you to see how to convert it and also give you views on how to turn off encoding.https:\/\/support.office.com\/en-us\/article\/choose...https:\/\/www.howtogeek.com\/352668\/how-to-convert...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Paint 3D, window won't open        Hey, I have several Paint 3D windows open with different parts of my project open. Some I can click on and open without any issue, but others won't. I can hover over it and the correct screen is shown, but when I click on it the screen reverts to the last screen I was looking at. I have even tried to close the one window to save and reopen it, but it won't even close. Not sure what's going on!","solutions":["Hi, LeanneSP My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Bluetooth Malfunctions After Reboot        Hey all,I've had a recurring issue for the past year and a half or so. Whenever I reboot my PC, my Bluetooth is completely inoperable; it's automatically off, and the button that I would use to turn it on isn't present on my Windows 10 control panel. I've been able to temporarily fix the issue by opening up the Bluetooth troubleshooter, which prompts me to reinstall my Bluetooth drivers. Upon reinstallation, everything works perfectly.While I can make do as-is for now, it's time-consuming to hop through this whole shebang every time I need to turn my PC off. Does anybody know about any long term solutions?I appreciate any and all help; thank you!","solutions":["Hi, MisterMacrae My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833..."]},{"symptom":"Help solving hardware BSOD on new build        I'm having a hardware issue I'd like some help in resolving. Below is what I've managed to pull from reliability monitor and event viewer.dmp files here https:\/\/www.dropbox.com\/sh\/30ajmjhl51rmorq\/AAAgGJ5h2f7CkpxHZf15eZAma?dl=0-------A problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name:    LiveKernelEventCode:    141Parameter 1:    ffff928ad14e6050Parameter 2:    fffff804656509f0Parameter 3:    0Parameter 4:    4OS version:    10_0_18363Service Pack:    0_0Product:    256_1OS Version:    10.0.18363.2.0.0.256.48Locale ID:    1033------------------------------- System   - Provider    [ Name]  Microsoft-Windows-Kernel-Power    [ Guid]  {331c3b3a-2005-44c2-ac5e-77220c37d6b4}     EventID 41     Version 6     Level 1     Task 63     Opcode 0     Keywords 0x8000400000000002    - TimeCreated    [ SystemTime]  2020-01-02T20:26:15.694778300Z     EventRecordID 5948     Correlation    - Execution    [ ProcessID]  4    [ ThreadID]  8     Channel System     Computer DESKTOP-BI8SUN6    - Security    [ UserID]  S-1-5-18  - EventData   BugcheckCode 278   BugcheckParameter1 0xffff928ad0775050   BugcheckParameter2 0xfffff80465650818   BugcheckParameter3 0xffffffffc0000001   BugcheckParameter4 0x3   SleepInProgress 6   PowerButtonTimestamp 0   BootAppStatus 3221225473   Checkpoint 16   ConnectedStandbyInProgress false   SystemSleepTransitionsToOn 2   CsEntryScenarioInstanceId 0   BugcheckInfoFromEFI false   CheckpointStatus 0","solutions":["Hi Whatisvalis, How often do you experience this issue? Did you updated your Drivers as well? There's a lot of things to consider in this kind of issue. However, what I can suggest is to update all your Chipset Drivers as well together with the most recent updated driver for your GPU.Please let me know if you already did. Thanks and regards,","It seems to be happening around once every other day.The system has never crashed in use - browsing internet, gaming or using other intensive applications.The crashes either seem to be during a restart and it will report windows not shutting down correctly alongside the radeon software host application hanging or other services.I've reinstalled latest graphics driver and everything, including BIOS, is up to date.","I believe it's the display driver causing issues.I uninstalled AMD software and driver using the display driver uninstaller. What's interesting is restarting in Safe Modes with no driver installed my monitor behaved as normal. I've noticed it not finding a signal sometimes during restart or waking - I assumed it was just the monitor because turning it off and on again resolved the issue.I've now reinstalled the drivers and will keep an eye in things. Restarting seems to work as expected - my monitor does not lose signal.","Hi Whatisvalis, That's cool. Please let us know if you encountered another issue. We're always here to help. You have a good day!"]},{"symptom":"Problems with Photos app in Pictures folder        The first problem is, when I try to open a file in This PC > Pictures, I get this error message The error does not occur if I go to Owner > Pictures instead of This PC > Pictures, or if I am already in This PC > Pictures and I click on the folder again, then open the file.However, another problem I have that always occurs is that when I open a file in Pictures, there are no left or right navigation buttons to move to adjacent files in the Photos app. Pictures is the only folder I've found where I have this problem.So far I've tried resetting, repairing and completely reinstalling the Photos app; using DISM scan and repair; and doing an in-place upgrade of Windows 10. Nothing has worked. In fact, the problem of being unable to go to neighboring files in the Photos app didn't start until I went through these steps.","solutions":["Hi Its, My name is Riccardo and I would be happy to assist with this... Have you tried a third-party application to see if the problem is with your files or with the actual app?https:\/\/www.xnview.com\/en\/Try the above, does the file open with this? I believe you have exhausted every troubleshooting item....this may now require a clean install...https:\/\/answers.microsoft.com\/en-us\/insider\/for...DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Alright, I tried ImageGlass and it worked fine.","Have you tried re-associating JPG to the Photo app...right-click one of the JPEG's and go open with and choose Photo App again?","Yeah, I get the same error. And this wasn't just happening with JPGs. Anyway if nobody else has any ideas I might just start using ImageGlass now instead of busted Photos","Given that you did a lot of troubleshooting, what I suggest (if you want to fix the Photo app) - you may need to do a Windows Repair:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Thanks!","I already did that. It's what I meant by in-place upgrade.","I see, I suggest than a clean install (backing up your data, etc) https:\/\/answers.microsoft.com\/en-us\/insider\/for...","I'm sure that would \"fix\" it, in the same way that getting a new car would fix a tail light, but now that ImageGlass seems to be working just as well I don't know if it would be worth it. I'm going to leave this open a couple days to see if anyone else has ideas and if not I'll just say you solved it with your suggestion for third-party software.","Understood. Have a great day."]},{"symptom":"Action Center Box        How do I remove the Windows Action Center box from my screen? It appeared during updates but now I can't remove it and it is on bottom right on every page. There is no \"X\" and nothing happens when I right click. There is an \"Action Center\" box at top of box and \"Open Action Center\" hyperlink at bottom of box. They both work. There is text in the middle of the box that reads: \"You can use Action Center to review recent messages about your computer's status and find solutions to problems. \" But I don't want to go to action center, I want the box off my screen. This is Windows 7 system.Help!","solutions":["I don't want to go to Action Center either so I made this adjustment:","Found it! About to log off and see if that gets rid of the box. Thanks!","It worked! After changing the settings as you showed and then rebooting, the box is gone. Thank you ElderN"]},{"symptom":"Why do Microsoft constantly change things that are working?        Tell me, you wonks at Microsoft. Why do you constantly change things that were working fine? Why do you have a bar down the side of most things that you have to mouse on to widen it? Why cant I set file associations freely and easily? Why do I have to use your dumb apps like photo viewer? Its like you have absolutely no idea how to write decent software. And your processes running make my machine slower than Grandma on Prozac!And whjy are you doing constant updates that I cant stop and that dont work?I really would like to know the answers to these questions.","solutions":["Go Ease of Access, Display, Automatically hide scroll bars.  Turn it off.If you look around you will find these things."]},{"symptom":"Log in every time        Hi,   I have a windows 10 desktop. I have been able to log into my accounts without any trouble. Recently I have had to have someone call or send me a text with a password so I can log on. It gets to be a pain. These are sites I use every day, and I am the only one who uses this computer. I hope you are able to help me.Sharon Rose*** Email address is removed for privacy ***","solutions":["Is it all fixed now, Sharon?"]},{"symptom":"How to block a website in Windows etc\/hosts?        I want to block a games website from my computer and on the internet, one suggestion was to edit \/etc\/hosts and put in these rules.C:\\WINDOWS\\system32\\drivers\\  etc\\hosts127.0.0.1    http:\/\/crazygames.com127.0.0.1    http:\/\/www.crazygames.comBut it does not work.Any help appreciated.","solutions":["Hi goodnewsforyou, This is one of the best ways to do it as it would be difficult for a person to change it after the fact...You don't need to add the http or https just add it like this: 127.0.0.1 crazygames.com 127.0.0.1 www.crazygames.com then restart see the attached screenshot. Let me know if you need anything further.","@RickFran84 and others,For some reason, this does not work on https:\/\/poki.com\/en\/warCan you please try it out yourself?I tried127.0.0.1    www.poki.com127.0.0.1    poki.com\/en\/war127.0.0.1    poki.com"]},{"symptom":"It looks like you don't have any applicable devices linked to your Microsoft account.        i tried to download paint 3d, but it said It looks like you don't have any applicable devices linked to your Microsoft account.i tried to link a device and it told me to go to accounts > your info. i went to accounts and...there was no where that said 'more info.' it seems like i cant download paint 3d until i figure out whats going on.","solutions":["- - - - -SOLUTION - - - - I first want to say that this notification is really misleading. You just have to update your windows to the latest version to install things. I just had the same problem and after 4 hours was finally able to solve it byupdating windows. I couldnt install age of empires 2 for this reason. Which is absolutely absurd because there is no way AOE2 needs the latest version of windows to run, but it does need the latest update of windows to install it. I'm really dissapointed in the direction microsoft is taking with its products and 'new features'. Still better than apple or linux though, but still"]},{"symptom":"Logitech Options (LogiOptionsMgr.exe) crashes!        Hello!Couple of days ago I assembled my new PC. Here are the specs:Asus Crosshair VII Hero WIFI (bios 2501)AMD Ryzen 3900XCorsair Vengeance RGB PRO 32GB 3000MHz CL15Samsung SSD NVMe 970PRO 512GBWindows 10 1903and some other components.I haven't installed\/tested everything yet, but so far everything is working great - except for one app: Logitech Options. I tried all versions available on Logitech website, but with the same result. What's the problem? When Windows starts or if I run the app manually, Logitech Options runs 3 processes: Logi Overlay, LogiOptions.exe and LogiOptionsMgr.exe. At this point everything works as it should, but once I start running applications - let it be Edge or whatever - LogiOptionsMgr.exe disappears from the processes list (there's no information that it crashed or anything). Mouse and keyboard are still working, but once LogiOptionsMgr.exe closes, I lose possibility to use customized buttons (I have Mx Master S2 mouse + Craft keyboard and I do a lot of video editing, so this feature is very important to me!). In event viewer there's an error:Faulting application name: LogiOptionsMgr.exe, version: 7.14.70.0, time stamp: 0x5d1858e5Faulting module name: LogiOptionsMgr.exe, version: 7.14.70.0, time stamp: 0x5d1858e5Exception code: 0xc0000409Fault offset: 0x000000000067ee90Faulting process id: 0x128cFaulting application start time: 0x01d5513156b00a32Faulting application path: C:\\ProgramData\\Logishrd\\LogiOptions\\Software\\Current\\LogiOptionsMgr.exeFaulting module path: C:\\ProgramData\\Logishrd\\LogiOptions\\Software\\Current\\LogiOptionsMgr.exeReport Id: 31e18188-71fd-450a-abc1-0abc119b7982Faulting package full name: Faulting package-relative application ID: I have no idea what's causing LogiOptionsMgr.exe to close\\crash, but I've already tested some things:1. It happens with every version of Logitech Options.2. I thought that maybe some driver\/app was causing it to act like that, so I installed a fresh copy of Windows 10 1903 and then, before installing any driver\/app, I ran the newest version of Logitech Options - LogiOptionsMgr.exe crashed\/disappeard from the processes list right after I ran some other application.3. I suspected that perhaps the newest version (1903) of Windows 10 is causing these problems, so I did a fresh install of 1803 version which worked with no issues on my old PC (Asus P8Z77-V, Intel 3770K, Corsair Vengeance 16GB). That didn't help either. LogiOptionsMgr.exe was crashing again.4. Since I switched from Intel to AMD and this issue started happening, I think the problem lies in the platform (AMD\/Asus). In my workplace I use the PC with Ryzen 2700X cpu and the newest version of Windows 10 on which the Logitech Options software is working flawlessly. That means it must be the new platform that's causing problems (maybe the bios, maybe some driver; perhaps Win10 doesn't work with it properly yet - I don't know).Since I'm not sure where I should address this issue, I'm reporting it to AMD, Asus, Microsoft and Logitech.In the meantime, does anyone have any ideas on how to fix it?Thanks!","solutions":["Hi, did you look for updated BIOS? Can you try to downclock memory slightly?","Thank you for your reply. The BIOS I'm currently using is the newest one (2501) available on Asus website.I don't think downclocking memory would help to fix my issue as it's the only app\/process I'm having problems with.","Please try to repair system files by DISM.exe \/Online \/Cleanup-Image \/RestoreHealth command from Windows PowerShell (administrator) environment. I do not think it should help but there is no harm in trying.","Unfortunately, that didn't work either. I also tried to install Logitech Options in safe boot mode, but with the same result. Any other ideas?","I suggest to downclock CPU and RAM as low as possible. Just for test. In very rare cases RAM or cache or other modules may operate with certain code sequences incorrectly.","Tried that today as well - again, no luck. Is there any way to send this issue to Microsoft so they can look into it or something?","The problem is with Logitech file so it is better to ask help from Logitech support.","I wouldn't be so sure it's Logitech's fault...Can't believe it, but I've managed to fix this issue! Believe it or not, but it was the account name that was causing the problem. I thought that with a new Windows installation I would finally change my nickname I've been using for years to my name and surname. I'm from Poland and my name and surname have polish characters in it - maybe that's the reason. Anyway, I created a new account with my nickname, installed Logitech Options and it worked! Then I switched to my name\/surname account and Logitech Options crashed. Just to be sure, I've installed a fresh copy of Windows 10 1903, created an account with my nickname and now Logitech Options is working great.","Great! Glad to see your problem solved. But I recommend to file a bug report to Logitech support.","I wouldn't be so sure it's Logitech's fault...Can't believe it, but I've managed to fix this issue! Believe it or not, but it was the account name that was causing the problem. I thought that with a new Windows installation I would finally change my nickname I've been using for years to my name and surname. I'm from Poland and my name and surname have polish characters in it - maybe that's the reason. Anyway, I created a new account with my nickname, installed Logitech Options and it worked! Then I switched to my name\/surname account and Logitech Options crashed. Just to be sure, I've installed a fresh copy of Windows 10 1903, created an account with my nickname and now Logitech Options is working great.Hi! I have been having the exact same problem with Windows 10 1903 - Logitech options crashes the second I try to double click the exe file to install it and nothing I try has fixed it.  So I am intrigued with this solution that you posted.But what is not clear to me is when you say 'nickname' - what nickname?  Do you mean the Windows 10 username you changed to get it to work - or do you mean a name within Logitech account somewhere?  Can you be specific on what nickname I need to change to get it?  Please note - I cannot format or redo windows - its a very long story but I have I have soo much custom software on here and I just can't start over.  Hoping this is an easy fix to get it working...Andrew"]},{"symptom":"I have lost connection to OneDrive, and cannot reconnect, My Mail address is no longer being recognized        I have lost connection to OneDrive, and cannot reconnect, My Mail address is no longer being recognized","solutions":["Hi Kristian, I'm an Independent Advisor here to help you out, Can you try and sign into OneDrive through https:\/\/onedrive.live.com\/ and see if you get the same result? If you're able to sign in through the website, then it may be an issue with your sync client.Let me know and we can take it from there, Thanks, Nick"]}]}