{"windows":[{"symptom":"Out of Windows 10 Minecraft redeem codes?        So I'm trying to redeem Minecraft for Windows 10 (I purchased the game back in 2011) and I keep getting this error upon hitting the redeem button:Error! It looks like we've temporarily run out of gift codes for Minecraft for Windows 10. Don't worry though, more codes should be on their way. Please check back later!Are there really no codes available right now or is this a error on my end somehow?","solutions":["I am having the exact same issue, it's been about a week for me now and I can't even seem to reach Xbox support, I contacted Mojang but their support is on backlog so god knows how long they'll take to reply with \"contact xbox support\". From what it seemed everyone else in the past was getting a response to contact Xbox support. And all the official replies to these questions in the community are literally useless troubleshooting. I don't even think the people from 2017 got their codes!","I'm fairly certain the people back in 2017 got their codes eventually, somewhere around 2 weeks after they ran out it looks like.  There's no records of this happening any other time between then and now, which wouldn't make much sense, you'd figure one or two posts would have popped up somewhere in 2018 if that were the case.  I'm now seeing a bunch of posts popping up now across the Microsoft forums with people having the same issue so it looks like it's round 2 of being out of codes for a few weeks for Mojang.  Be persistent, send e-mails, and wait is all we can do now.","Just look for the minecraft game > click Buy Now > Click on Login > the system will detect that you already purchased it > click Download","we're trying to get windows 10 with the codes we got for free so we can't really do that.","did u solved that problem?Cause im having this problem right now ; ( ","No i didnt solve it, technically this is week 2 now lol ","thats sad :\/ i just send them an email askin if they can give me a code or something like that Dx","i tried that but got nothing back and its been at least a week since. In my opinion there is not excuse for this to go on this long, they told us if we had it before that they'll give us the windows 10 edition for free, yet they're not giving it to us now. All that has to be done is a code has to be run that generates random codes and then they have just have to be put in a database. this problem should not have existed for more than 2 days.","so u are saying that they wont give a new code for us anymore?","Has anyone recieved a reply from Minecraft Support yet?"]},{"symptom":"Remix 3D Sunset        Hello,   On January 10, 2020, Microsoft support agents will no longer reply to posts on theRemix 3D topic in Apps on Windows 10.  While we will moderate the topic, we won’t be monitoring or answering questions.  You are welcome and encouraged to continue to use the forum to ask questions and interact with each other.    Check this page for more information about the Remix 3D retirement. ","solutions":[]},{"symptom":"End of Support for Microsoft Security Essentials and Windows 7: January 14, 2020        Will Microsoft Security Essentials (MSE) continue to protect my computer after the end of support?No, your Windows 7 computer is not protected by MSE after January 14, 2020.  MSE is unique to Windows 7 and follows the same lifecycle dates for support. Learn more about MSE. Source: https:\/\/support.microsoft.com\/en-us\/help\/4527878\/faq-about-extended-security-updates-for-windows-7Also: https:\/\/support.microsoft.com\/en-us\/help\/4057281\/windows-7-support-will-end-on-january-14-2020================================================================================EDIT: Both above articles got updated. Article 4527878 on Dec 18, 2019, Article 4057281 on Dec 16, 2019:\" Microsoft Security Essentials (MSE) will continue to receive signature updates after January 14, 2020. However, the MSE platform will no longer be updated.\"  Also see: https:\/\/techcommunity.microsoft.com\/t5\/Windows-AMA\/Microsoft-Security-Essentials-availability-after-Win7-EOL\/m-p\/1070283================================================================================Suggest reading everything here: Answers to common security questions - Best Practicesespecially: Choosing an Anti-Virus Program Supplementing your Anti-Virus Program with Anti-Malware ToolsPinned until 12\/25","solutions":["Which Antivirus product to choose?This is a controversial topic.  I suggest you visit this web site to get a sense of which AV software does the best job, depending on what kind of user you are:   http:\/\/www.av-comparatives.org\/   This is a non-profit that has been around for a long time and I trust their results.   Their latest report:  https:\/\/www.av-comparatives.org\/comparison\/When you interpret these results, keep in mind the difference between a product that detects 95% and another 99% of infections, is actually 5 times more likely to allow an infection.I am speaking from a great deal of experience.  I support 130 client computers.  I have been doing this for 17 years.  My clients NEVER have infections.The only products I will use or recommend are ANTIVIRUS-ONLY products.  Any product that is called complete protection, Internet security or deems itself to be a comprehensive security product is prohibited on my client computers.I have good reason for this. Over the years and hundreds of PCs, I’ve learned a lesson well.  That it is very difficult to diagnose and fix the problem(s) when components of an Internet Security product are actively working to prevent that diagnosis.  The software sees the technician (me in this case) as a threat.  I discovered that if I uninstalled that software, I am able to much more likely and quickly discover an fix the problem.  Antivirus ONLY products do not behave like this.The other components in these IS products (other than the AV itself) cause more problems than any benefit they bring and mostly work by shutting down the Windows component that does a very good job of that particular task anyway.It is the Antivirus software that you need.  It is actually all that you need with Windows 7.Most of the big name suppliers much prefer to sell their all-in products because they can sell them for a higher price.  Some do not offer an antivirus-only product.  Some push their all in ones and still sell the AV only product, but you may have to look for them.  There is at least one and it is either the best or close to it.Beware of products that try to actively engage you in the security process by asking your permission to run a program named xd43_45d*.exe, or the like.  Also look out for products that report a lot of false positives, misleading you into believing you have an infection when in fact, you do not.Do not use any product that claims to make your computer run better.  Virtually all of them are either bogus, themselves an infection, or put your computer at risk. Remove everything that claims to be there to prevent infections or claims to make your computer run better, with the singular exception of just one antivirus product.Note well.  You should never have more than one protection product installed.  Always ensure that you completely remove any and all protection software packages before installing a new one.  That includes software that may have come pre-installed on your computer when new.  Some products will conflict with one another, causing yet more problems.You cannot fully remove most any AV software by simply using the standard Windows 7 uninstall tool.  Most of the majors also publish a “removal tool” that gets the rest of it.  If you do not completely remove it, it will cause very hard to understand and diagnose problems."]},{"symptom":"Forum Article List in Windows Community        In this list there are some of the articles present present in Windows Community, divided for operating system or argument: Basic troubleshooting \/ HOW TO:Event Viewer What's going on in your computer?Driver View A very handy utility for examining driversWindows performance recorder - Microsoft CommunityUpdating a driver.Memoryproblems.You can learnhow to test your memoryYou can read more aboutBSODSSafe mode & clean boot procedures - how to make use of themWhy do they do this? They are paid to. The software maker pays them to install the...\">\"Decrapify\" your Windows ComputerBasic Troubleshooting. Hardware \/ Windows.TroubleshootingVideo Card Problems (BSODs, Instable Driver and Brightness)How to run the Activation TroubleshooterHow to divide your hard driveinto smaller partitionsNaming Groups on the Start ScreenHow to find which version of Windows you're using.BCC101 Clock Watchdog Timeout troubleshootingLow Disk Space - How to free up hard drive space on your Laptop or PCBCC116 & BCC117 \"your video driver has stopped\"BugCheck Code 124How to migrate from 32 bit versions of Windows to Windows 8 64 bitBootmgr is missing message or black screen with blinking cursorHD Checking -- How to test yoursSystem file check (SFC) Scan & repair System filesDriver verifier -Tracking down a mis-behaving driver MSCONFIGthe system utility.BugCheck Code 124BCC116\/7 Your video driver has stoppedEmail Systems... Differences explainedBasic HOW TO Windows 7\/8\/8.1:Windows 8 \/ 8.1 \/ 10 Total Backup System - What MS forgot to tell youHow to get the best performance from your wireless networkWindows 10 Xbox App (VIDEO)KeepMedia Center on Top in Windows 8How to find which version of Windows you're using.Remove Power Button on Start ScreenEasy Guide: Create a User Account and Change PrivilegesEasy Guide: How to Find Your Skype ID in Skype 8 or Skype for Windows 10Easy Guide: How to Change Your Display Name in Skype 8 or Skype for Windows 10How to find your Wi-Fi network passwordTip:Quick access to common operations in Windows 8 - Windows + XWindows 8\/8.1 Local GroupsSpecifying Domain Controller for Group Policy in Windows 8.1 Enterprise Domain ClientWindows 8.1 Enterprise Add or Remove FeaturesBasic HOW TO Windows 10:Safe mode in win 10 (before you need it)Easy Guide: How to Rip an Audio CD Using Windows Media Player in Windows 10 and Troubleshoot ItEasy Guide: How to Add Skype for Windows 10 or Other Apps to Your Startup Folder in Windows 10Easy Guide: How to Change the Screen Brightness in Windows 10Easy Guide: How to Create Desktop Shortcuts for Microsoft Store and Desktop AppsEasy Guide: Delete a App Folder on the Windows 10 Start MenuEasy Guide: How to Install and Uninstall Languages in Windows 10Can't play my Xbox Game on Windows 10Removing the Xbox App from Windows 10Easy Guide: How to use the Photos app to Rotate an Image in Windows 10How to create a photo albumWindows 10 Start Menu (VIDEO)Windows Store (VIDEO)Windows 10 OneDrive (VIDEO)How to change AutoPlay settings in Windows 10How to run a program designed for an earlier version of WindowsSetting up a Gmail or other account in mail app.Automated Solutions for Windows 10How to reset your Microsoft account passwordMake Windows 10 Task scheduler run a batch file minimised & with a specific iconSend Feedback to MS DevelopersHow to uninstall a Windows Store app using PowerShellQuick Tip: Download and Update apps in Windows 10Quick Tipe: How to monitor your Windows 10 download progressWindows 10 and Cortana Help (VIDEO)Windows 10: How to Get Help (VIDEO)How to install JAVA on WindowsGeneric HOW TO:The Internet Archive site: https:\/\/archive.org\/“UNOFFICIAL” SOURCES OF HELP FOR AVERAGE USERHow to Sign in and Setup Skype 8 on macOS Using Your Skype ID or EmailHow to Insert Images in the Forum - Examples of Screen Capture Tools to create imagesEmail Systems... Differences explainedAsking an effective question gets help fasterWindows Update: troubleshooting and HOW TO:How to manage updates using Windows Update for Business and Home useDownload Windows Updates at a fixed timeChecking for and Installing UpdatesEasyGuide:How to Install Updates in Windows 10Windows Update Troubleshooting Guide - Windows 8.1Install and upgrade Windows 10:How to get the Windows 10 Free upgrade has been made even easierAfter the Windows 10 Free Upgrade is over, what are my options. Note: The free upgrade is still active for users of assistive technologies.Willdocuments and apps remain, or are app installs requiredWindows 10 update historyBlack screen with cursor\/infinite loading dots after updating Windows 10How to dual boot Windows 10 and Windows 7 if your PC came with Windows 10 pre-installed or Windows 10 is the first version installed on your disk driveHow to Upgrade Using Earlier Versions of a Windows 10 Feature UpdateGet the Windows 10 October 2018 UpdateHow to: Determine if an application or hardware device is compatible with Windows 10How to extend the 10 day limit to go back to your previous version of WindowsOptimizing and Personalize Windows 10:Improve Performance by Optimizing DrivesEasy Guide: How to Enable Windows Spotlight Lock Screen Images in Windows 10 and TroubleshootWindows 10 - how to make the command prompt text easier to readWindows Tweaking and Optimization: Myths and RealityEasy Guide: How to Choose Your Own Desktop Wallpaper in Windows 10Free up space automaticallyOrganize open apps with virtual desktopsHow to: 10 things to do after installing Windows 10Troubleshooting Windows 10:RunningDisk Defragmenter from the Command Line for More ControlOn-screen keyboard automatic popup doesn't workImprove Performance by Optimizing DrivesHow To: Use Device Manager to Look for Audio Issues (VIDEO)System Refresh or Restore: Some files are missing or Windows isn't booting.Office 365\/Office Product\/Outlook in Windows 10:How to Install Office 365 Pro Plus with the new Ribbon Interface on Windows 10Backing up your important Outlook.com email data .Outlook Mail (also known as Outlook on the web)Windows 8 \/ Windows 8.1:Editing Group Policy Settings WIndows 8.1 EnterpriseWindows 8\/8.1 Local GroupsWindows 8.1 Group Policy Objects OverviewDIY Windows 8 Start Screen Tiles – Pin to Start ScreenWindows 8.1 Group Policy ADMX Template OverviewWindows 8.1 Enterprise Add or Remove FeaturesOneDrive sync issues: Windows 8 and belowSpecifying Domain Controller for Group Policy in Windows 8.1 Enterprise Domain ClientSwitch the Microsoft Account Connected to Windows 8.1Tip:Quick access to common operations in Windows 8 - Windows + XCommon Windows 8 to 8.1 Upgrade problems.Windows 7:How to successfully do and troubleshoot Windows Anytime UpgradesHow to: Fix Windows 7 or Windows 8.1 Reporting Not Activated or Genuine after Rollback from Windows 10Security and privacy - Windows 10 \/ Windows Defender:Avoiding tech support scamsArticles about Win 10 (8 and 7) Privacy issues and how to fix themEasy Guide: Exclude a File or Application in Windows Defender Security CenterEasy Guide: How to Scan a Thumb Drive or External Hard Disk Using Windows DefenderSecuring your computer with SyskeyHow to reset your Microsoft account password","solutions":["Check this link for a lot more Forum Articles that are not on your listing.Windows Forums listing filtered for Forum Articleshttps:\/\/answers.microsoft.com\/en-us\/windows\/forum?sort=LastReplyDate&dir=Desc&tab=All&status=&mod=&modAge=&advFil=&postedAfter=&postedBefore=&threadType=articles&isFilterExpanded=true&page=20Rob - SpiritX","I recommend to update the list with Bitlocker problems like this: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/cannot-access-bitlocker-encrypted-drive\/ea31da96-b61e-415a-9156-03cee9a511c9","Hi Guys,Do you have any printer troubleshoot guide?","Erling, as with most hardware devices, the best printer troubleshooting guide would be at the printer maker's site.There is a Windows Printer troubleshooter which can help in some cases available at Start - Settings - Devices - Printers & Scanners - scroll down to \"Troubleshoot your printer\".Hope this helps. --------------------------------------------------------------------------------------------Rob Brown - Microsoft MVP <- profile - Windows and Devices for IT : Bicycle - Mark Twain said it right."]},{"symptom":"Windows 10: How to access a file share as a different user than the local user?        I have a Windows 7 PC. Let's name it server. A share on server can be accessed as user A.I also have a Windows 10 PC, named client. I am logged on to clientas user B and want to access user A's share on server.On Windows 7 and earlier clients, I can provide user A's credentials when mapping a share. I have not found this feature on Windows 10. In fact, I have not seen anything about \"mapping\" on Windows 10.I could probably change the permissions on server, but I only want user A to have access.What options do I have?","solutions":["Hi BerndBausch, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.When mapping a drive in Windows 10, you should see the option to \"Connect using different credentials\". I have included a screenshot of this, as well as the instructions to map a network drive in Windows 10 below:1. Open File Explorer from the taskbar or the Start menu, or press the Windows logo key + E.2. Select This PC from the left pane. Then, on the Computer tab, select Map network drive.3. In the Drive list, select a drive letter. (Any available letter will do.) 4. In the Folder box, type the path of the folder or computer, or select Browse to find the folder or computer. To connect every time you log on to your PC, select the Reconnect at sign-in check box.** This is the point where you should also choose \"Connect using different credentials\". Upon clicking Finish in the next step, it will ask you for the username and password to use.5. Select Finish. Source: https:\/\/support.microsoft.com\/en-ca\/help\/402663... I hope this has helped you. If this does not work or if you have any other error messages or questions, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton"]},{"symptom":"icon permanently on screen        Can someone tell me what this icon is and how I can hide it from my screen.sorry it will not copy it is a black vertical box about 6cm x 2 cm with a sliding % scale in the middle and an X at the bottom. The X does not close it down.Thank you","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? This sounds like the new volume button, the X may mute the sound rather than close the box.Does this appear when pressing the volume keys? It should automatically close after 2 seconds. Check the keyboard for a stuck volume key. I’ll continue checking for further solutions.","Hello Virginia , thank you for your help it says it is version 18362 so none of the ones in your mail. There does not appear to be any keys stuck and it is definitely not closing down.It is also in the top left hand corner and very annoying as I can not access anything behind it :(","That is 1903, the latest is 1909 so first try updating to this. Are you running Chrome or the new Edge browser based on Chrome? If so then this is the cause of the icon showing & can be turned off within Chrome.If not then look here for a potential solution: Right-click on the task bar & then select Settings. Under the Notification area, choose Turn system icons on or off & then click on Turn off volume."]},{"symptom":"Black screen windows10        I started getting a blue screen with a stopcde.  So i followed instructions to go into safe mode and remove last updates.  Then when I went back in I got a black screen with no logo, curser, and it shuts off shortly after.  I have tried all the suggestions to get rid of the black screen, but nothing has worked.  Please help!","solutions":["What was the Blue Screen error code?Are you able to boot into safemode?What update did you removed?","Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,I would recommend going into the windows recovery environment to use access multiple troubleshooting options.Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.a) Startup repair Go to troubleshoot, advanced options, startup repair (This would attempt to repair the system)b) System Restore Go to Troubleshoot, advanced option, system restore (This would roll back the system's configuration to a specific time and date)c) Safe mode Go to Troubleshoot, advanced option, startup setting, click on restart and this would provide you multiple options in terms of booting up the computer.Choose to boot into safe mode, once accessed you could either uninstall the update or check if all your drivers are up to date. A clean boot under safe mode would also help to make sure no softwares are affecting the system1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart d) Reset this PC In the event that it still fails, I would recommend reinstalling the operating system. The option enables you to keep your files although uninstall programs that did not came with the system.Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","I don,t remember the error code.  I can't get into safe mode because I now have a black screen and not even will the logo come up when I start up.  Then my laptop almost immediately shuts down.  I need help getting out of the black screen.  I have already tried the suggestions and nothing works. Please help.Thank you.","I now have a black screen and don't even get a logo when I start my laptop.  Then it shuts off.  I tried the.holding down the power button for 10 seconds then turning back on 3 times, and nothing happens.  I need help to get out of the black screen,   Thanks.","I don't remember the update I uninstalled, but it was the last update done to my laptop.","Do you have any suggestions on how I can get out of this black screen?","Hey, Gary, May i say that you do not need to repeat the process for a hard\/force shutdown 3-5 times, you only need to do it once.My adviceJamie","Do you have a desktop PC? If so, then locate the graphics driver (Example)It should be near your DVI port.Jamie","I have a laptop.","I went inside my laptop to check my ram modules and found that my ssd had come loose.  I reinstalled it and the ram module and I'm back in business.  That's for all your help."]},{"symptom":"Disk management        Sir i want to install windows 10 but i got Hard Disk Drives 174 gb free of 270gb and D 38.8 gb free of 195gb system Reserved (F) 40.5mb free of 99.9mb only.i would be grateful if you kindly help.","solutions":["Sir i want to install windows 10 but i got Hard Disk Drives 174 gb free of 270gb and D 38.8 gb free of 195gb system Reserved (F) 40.5mb free of 99.9mb only.i would be grateful if you kindly help.What is your question?"," I m using windows 7 ultimate now my question is how install windows 10 with my above mentioned limited hard disk drives."," I m using windows 7 ultimate now my question is how install windows 10 with my above mentioned limited hard disk drives.You go to this page and follow the instructions:http:\/\/windows.microsoft.com\/en-us\/windows-10\/media-creation-tool-installYou have plenty of free disk space."]},{"symptom":"windows 10 settings will not load        when clicking on the settings icon in windows 10  it will not open up the programme","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Open powershell with admin & enter: SFC \/SCANNOW DISM \/Online \/Cleanup-Image \/StartComponentCleanup DISM \/Online \/Cleanup-Image \/RestoreHealth and try again. If Settings still doesn’t open then run a repair install: I recommend an in-place upgrade repair. To repair Windows without losing any data then follow the instruction here: https:\/\/www.tenforums.com\/tutorials\/16397-repai...This will also upgrade you to the latest version of Windows - currently 1909. In a nutshell you just insert the Windows 10 media (USB\/DVD) & run setup from within Windows.Please note a repair install is not a reset, this is a last attempt at repairing a PC without a clean install. If this fails to repair the problem then usually a clean install is required.Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"I need a way to have a WIFI capability when using Dell XPS 8300 as my WIFI cars DW1501 will not connect to my Uveres Router        I need a way to have a WIFI capability when using Dell XPS 8300 as my WIFI cars DW1501 will not connect to my Uveres (ATT) Router","solutions":["Hi ShevachSaraf,clearly specify what your problem is or what the error message you receive when you connect via Wi-Fi."]},{"symptom":"Picture\/Pin Password for AD accounts        Hello,I've introduced Picture password and Pins for a few users within my organisation, however, I am interested in setting it up for the whole company but on the AD network level.Currently, the users are setting this up via the Local account, meaning that any time they move (which is fairly common) the users will have to set up the picture password\/ pin all over again.Any help of this will be appreciated. ThanksBradley ","solutions":[]},{"symptom":"Cortana and task bar        I have Cortana turned off in its settings because I do not use it. I've never set it up. However, whenever I move my arrow to the bottom of the screen, for example, if I want to scroll the the right or left, the task bar pops up and freezes in place so that I can no longer see what is on the bottom of the screen. I have the task bar setting so that the task bar is not supposed to freeze. I've discovered that it seems to be caused by Cortana. If I click on the Cortana button and then back on to my screen, the task bar will then go away. I tried hiding the Cortana button, but the task bar was still freezing and then I had to unhide Cortana so that I could click on it so that the task bar would go away and I could see the bottom of my screen. Moving the task bar to the side has not helped because it just freezes in place there and I can't see the side of my screen. I've tried shutting everything off related to Cortana in the settings, but nothing is helping. Short of completely removing Cortana via the registry I'm not sure what else to try. Can someone help because it is getting really annoying to have to click on Cortana and then back on the screen every time I want to unfreeze the task bar.  Thanks.","solutions":[]},{"symptom":"Windows 10 cannot update.        I get a message saying this PC cannot run Windows 10. I have been running it on this PC for almost a year. I am running version 1803 ","solutions":["How old is the PC? It may be that message is stating it cannot run anything newer than 1803, you can try scanning for the 1909 update, if it doesn’t show then the PC isn’t compatible with this version."]},{"symptom":"Moving Files to Windows 10        Sorry I am pretty upset because Microsoft drops support on Windows 7.  When you cannot move files for VA hospitals there is a problem.When I backup the files they create files and\/or maybe programs because of poor terminology.Why we ever referred to a program that is executable as a file I will never know.I can copy the contents of a drive to a backup device and I have tried all 9 on the market.  It is creating some whatever (program or data file) called VDRed_.cabI cannot find a device that will not create this file.  I have been told this is the only way to stop this file from being created and that it is not a Microsoft problem.  When it happens On Removable drive, Flash Drives, CD's , etc. there is something with Microsoft.  Some people have said it was a problem with the Report Module in Access????    I thought the report module was nothing but a form?I need another suggestion, I have tried many and no one has told me why the Windows 7 backup has done this.    Now I have been advise to try to go to a Windows 8.11 machine and I am trying to find one to see if that is the problem?One entity even said there was a Windows 9 machine that I never heard of?Something so simple should not take over 5 weeks.  What do I tell the doctors at the VA hospitals, the application is tough enough without new jucnk coming out of Microsoft.  Way too much advertising and I do not need those interferences.Len","solutions":["There are several methods to move your files to Win10 but by far the simplest method consists of copying your data folders (e.g. Documents) to an external USB disk, then to the Win10 PC.If you work in a hospital then your system administrator should do this for you. For him it would be pure routine.","Frederick;Thanks, that is exactly what I did.Any other ideas will be appreciatedLen","Frederick;Thanks, that is exactly what I did.Any other ideas will be appreciatedLenHere are three additional options:Connect the machines via a network, then copy the files directly.Use a backup \/ restore toolCreate an image of the old machine, using Macrium Reflect, then restore files & folders from the image.","I purchased a very nice external dish and it did not work.  In fact I get messages that the disk was bad.  Went back to Best Buy and they said they were no longer permitted to use products from Windows 7.","I purchased a very nice external dish and it did not work.  In fact I get messages that the disk was bad.  Went back to Best Buy and they said they were no longer permitted to use products from Windows 7.You have been fobbed off. Disks are not specified for operating systems. They work equally well for Windows XP, Windows 7, Windows 7, Windows 10 and Apple Macs. If your disk is faulty then it will equally fail on a Win10 machine.BTW, the subject of this post is wrong. You do not MOVE your files, you COPY them. If you were to move them then you risk losing them in case something goes wrong.","Frederick;  A friend who programs computers told me to get someone who programs computers to write a program using Macro Assembler to copy the fields.  They had the same problem at the Pentagon.What is your opinion on this please.Len","Frederick;  A friend who programs computers told me to get someone who programs computers to write a program using Macro Assembler to copy the fields.  They had the same problem at the Pentagon.What is your opinion on this please.Nobody in his right mind would write an assembler program to copy files from one machine to another. If the process needs to be automated, one would use a script, e.g. Batch, VBScript or PowerShell.What Pentagon problem are you thinking of?","Can anyone telll me what the VC_Red.Cab file is?","Frederick;I want to thank you for trying to assist me in this matter.  IT is quite a mess.  Microsoft tells me it is my problem created by me.  However the Indiana Attorney generals feels it is their problem sine they wrote the backup files program.I learned that this could depend on State law but it is for the Disabled Veterans so I feel it is federal.I am trying to find an assembler language programmer who can look at code and see where it creates the .cab file.Still cannot get Windows 10 up and running but did order some more stuff from Microsoft to see if that will work.Thanks again, you guys have been great.Len"]},{"symptom":"System Idle Process High CPU Usage        I had a Windows 7 Professional and then thought about upgrading to Windows 10 since Windows 7 is coming to end. When I upgraded to Windows 10 i got a random Blue Screen. My PC restarted i opened Task Manager and there it is 100% CPU Usage non-stop. Its really annoying i read the same problem of some guy on this kinda forum, and followed his steps. None of them worked and i'm really annoyed by Windows 10. This never happened on Windows 7 and i'm really hoping there is a way to fix this.My PC:CPU: Intel Core i5 2400 3,10GHzRAM:12GB(4x3)Graphics Card: Nvidia Geforce GTX 1050 Ti 4GB GDDR5HDD:1TBI found out that System Idle Process is taking too much CPU how can I fix this?Waiting for help.","solutions":["I found out that System Idle Process is taking too much CPU how can I fix this?The system idle process tells you for how much of the time the CPU is twiddling its thumbs. The higher the figure, the better! A totally idle CPU would show 100% for the system idle process.","Is there a way to fix it?","Is there a way to fix it? As I said, a high number for the System Idle process is good. It does not need fixing. On the other hand, if the CPU loading is consistently above 50% (see below) then you need to find out which process demands excessive CPU resources. Use snippingtool.exe to capture the Detail column of the Task Manager. Save the snapshot to your desktop, then attach it to your reply."," Please help me out.","Please do this:Terminate Google Chrome.Launch the Task Manager.Click on the Performance tab.Let the machine run for an hour without you doing anything.Take this snapshot and post it here:"," After one hour its still 100%.","OK, your CPU is running flat out but, as I mentioned before, the cause is something other than the System Idle process. Assuming that you killed Google Chrome before taking this snapshot, it must be some background process that's responsible. I recommend you do this:Run msconfig.exe.Click the Services tab.Tick the box to hide all MS services.Disable the rest.Reboot.Check if the CPU loading remains at 100%.","Already done that doesn't help. Please help me dear sir.","Already done that doesn't help. It helps mentioning this in your initial post so that respondents can eliminate this potential cause right at the beginning.The next steps require direct access to the machine, which I obviously do not have. To see what is involved you should to ask Google like so:determine cause of excessive cpu loadingAfter solving your problem, please remember to post the solution here for the benefit of other posters with a similar problem.","Sir, could u give me the specific link? Im sorry but there is too much of them i don't know which one to choose.And as well i wanna mention that my PC Blue Screens randomly. Im waiting for help, sir."]},{"symptom":"Apps keep reapearing for download.        Why is it that apps keep reappearing for download in Microsoft store? Once I download it it shows the update date as 2019.Have run the troubleshooter, Reset\/removed the cache of store too without any luck.Just check the screenshots for the before & after. Have to keep on downloading about 28 apps.Vijay.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command prompt DISM \/Online \/Cleanup-Image \/RestoreHealth Run these commands on the command prompt to restart windows update services net stop bits net stop cryptsvc net stop wuauserv net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start bits net start cryptsvc net start wuauserv net start msiserver After successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig 2. On the system configuration window go to the services tab 3. Tick on hide all microsoft service so that this won't be affected 4. Choose to disable all services 5. Next, go to the startup tab and on the window choose to open task manager 6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok 8. A prompt to restart the computer will show up, choose to restart This should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update the applications again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo... 2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept. 4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","These downloads and updates are the regular updates that the system is doing as it makes minor changes to the programs to keep up with the changes to the System Updates.  This is an on-going process.  You may or may not have these in your usage.  Most of the updates are very minor and do not effect you usage.  .A lot of what you show is that you do not get Store Updates and downloads on a regular basis.","Sorry lacrumb, I don't think that is the case.If it was regular updates then once downloaded it will show the current date. If you see the 2nd screenshot (taken today), the installed date is shown as 2019.Vijay.","That is because you did not go to the Store and do any updates for a number of months.","Here is the same issue that I posted on 6th.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/no-option-to-change-the-pin\/61f46e99-2b00-44ee-8fd8-936ec956707fPlease don't assume things. The least you can do is if you don't know something is to ask rather than pass judgements.Vijay.","Hi Gary,Thanks for the suggestions.Doing the first set of things seems to have worked. Last 24 Hrs, it hasn't come up. Will update if it happens again.Not too keen on doing the in-place upgrade. Last week there was an issue with creating pin so customer support did a in-place upgrade.These two showed \"Access denied\" message.Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old Vijay.","Hi Vijay, Make sure to have executed these command net stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverBefore running these commands Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old","I did. All those were showing as stopped(screenshot attached in the earlier post).Vijay.","Hi Vijay. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What is the status on this now? Have you got it all sorted out or do you need more help?If it's fixed then please mark the post above that most helped as Answer, to help others who find this thread.If not then one thing that might help is to re-register all the Store apps from Option One here:http:\/\/www.tenforums.com\/tutorials\/3175-apps-re... Keep me posted on your progress as I will be here to help until the case is resolved.______________________________________________ Note: Linked tutorial is from Shawn Brink who is a trusted Microsoft MVP.","Unfortunately, Its back.Vijay."]},{"symptom":"Start up issue Windows 10        Hi,This morning i started my machine and windows did not start and the system looks as if its checking mynhard drive for errors.It's been running for about 5 hours and its starting that ETA is 56 hours. Message on screen isFixing (D:) Storage 1: 23% (10710 of 46336); Total: 7%; ETA: 56:21:46.What's happening and is this time scale normalThanksTony","solutions":["Hi Tony Windows must have found an error on your hard drive and is checking and repairing your Disk.It will not take 56 Hours, that is always reported incorrectly and will finish much quicker than that.It is not safe to stop a disk check, in Stage 1 or 2, you could corrupt your hard drive . . ."]},{"symptom":"Ethernet issue on Windows 10        Hi, I am a Windows 10 user and I encountered a problem when trying to connect my desktop computer to network by Ethernet.The following message is returned by the Network troubleshooter:'Your computer appears to be correctly configured but the device or resource (www.microsoft.com.com) is not responding'I have tried the solutions from both Windows Support and Microsoft Community (please see reference links below) but none of them helps. Icalled my ISP for help as well and they said the connection has no problem. Reference links: Fix network connection issues in Windows'Your computer appears to be correctly configured but the device or resource (www.microsoft.com.com) is not responding' issue Windows 10 I have no clue what I can do to fix the problem now, would anyone like to lend me a helping hand? Feel free to ask me for details if needed.Thank you so much!","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? My first thought is that the web address has an extra .com in it which will affect visiting that site; Is this the case or is the URL correct?"]},{"symptom":"DVD drive is not rcognised by Windows 10, registry error code 19. Is there a fix?        registry error code 19","solutions":["Hello HJHSO, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemHave you added a new hardware to your computer lately? Please try at first to uninstall the CD\/DVD drivers: * Type device manager in start menu and open it. * Search for DVD\/CD -ROM devices and uninstall it. * Restart your system and check if it gets a new driver afterwards. It should workFeel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah","unfortunately it appears that the registry entry is incomplete or corrupted, any ideas how to fix it ?","Hello there, Please check the steps in this link, start a powershell as an administrator and restore the default settings for DC\/DVD ROMhttp:\/\/woshub.com\/restore-missing-cddvd-drive-i...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Audio\/Video becomes more and more out of sync during playback        When playing a video, whether it is streaming online or viewing a video stored on the computer, the audio and video gradually become out of sync. During the first few minutes it isn't really noticeable, but after 5 minutes or so the audio will be a few seconds out of sync with the video, and the problem only gets worse (further out of sync) the longer the content is played.I have had this problem since building this computer and I have already tried the following to resolve it:Running the audio troubleshooterInstalling all available Windows updatesReinstalling Realtek Audio DriversInstalling all available driver updates (using \"Driver Easy\")Checking audio devices are connected correctlyChanging between audio formats (cd, dvd, studio, etc)Disabling HPETHowever none of these methods have gotten rid of this annoying quirk. Any help would be greatly appreciated.","solutions":["Hi Brodie. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.What browser are you using? Try another browser. I would have several browsers on your task bar so there's always one that's best for the task. I use Firefox, Edge and Chrome in that order of preference. It's easy to share bookmarks between all of them in their settings under Import Favorites from another Browser, and Firefox and Chrome let you sign in to save and\/or sync your Favorites on any other device you sign into. Set the preferred browser as Default in Settings > Apps > Default Apps.If the problem is the same in another browser, then reset the browsers following this guide:https:\/\/www.howtogeek.com\/171924\/how-to-reset-y...Run this Flash tool in all browsers to make sure it's enabled properly and latest:https:\/\/helpx.adobe.com\/flash-player.htmlFor Edge follow these extra steps: https:\/\/www.digitalcitizen.life\/how-unblock-fla... If those steps don't help then I'll give you all possible solutions for Sound problems in order of priority, so please try any you've already tried again in order. If you have any problems performing any steps I'll be standing by here to help you.1) Update the sound driver from the PC or device maker's Support Downloads webpage for your exact model, if it is newer than the one presently installed in Device Manager reached by right clicking the Start button. While there compare to make sure you also have the latest BIOS, Chipset, Display, Network and all other drivers. 2) Restore the Windows Audio Service which may have become disabled: https:\/\/www.tenforums.com\/tutorials\/57567-resto... 3) Next try these checklists: https:\/\/support.microsoft.com\/en-in\/help\/402699... https:\/\/www.howtogeek.com\/443702\/how-to-fix-sou...4) Right click Volume icon in System Tray, choose Sound Settings, from the Output and Input devices dropdown menus, choose then one(s) affected to see if that helps. If not use the Troubleshoot button nearby.5) Run the Playing Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.6) Try rolling back the sound drivers in Device Manager reached by right clicking the Start button. Choose Sound controller and other audio devices, then Driver tab, then Roll back if available.7) If no newer sound drivers then uninstall the one presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.8) Try other and older drivers for your model Sound controller, too. For example, try the next oldest driver in the model's online Support Downloads list. To try all previous drivers installed on your system, in Device Manager choose Sound controller's Driver tab, then Update Driver, then Browse, then Let Me Pick. Finally, try installing the latest Sound driver in Compatibility Mode as shown here:https:\/\/social.technet.microsoft.com\/Forums\/win...9) If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 10) If this was caused by a Version update (which you can confirm at Settings > System > About) then you can roll back the version in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... 11) You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... 12) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. 13) If nothing else helps then run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This solves many problems and will also bring it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 Pro openssh server permission denied.        Good day Community.I try to setup ssh tunnel which will be used to secure remote desktop session between two computers.ssh server OS: windows 10 pro ver 1909(2)I installed openssh server via \"add optional features.\"When I ssh in I from client with cmd command ssh admin1@ip server replies first with:The authenticity of host (host's IP)' can't be established.ECDSA key fingerprint is SHA256:JqYEwLJJm\/gR9by+aQhftpUsqbRnY06Cv\/lRiC4syf4.Are you sure you want to continue connecting (yes\/no)? yesbut when I enter correct password, server replies with:\"permission denied, please try again\"I then created admin2 account on server and tried ssh in again using admin2 credentials and I was able to dialin no problem.ps: admin1's password  has ! character, I also tried to use simpler password but this did not help","solutions":[]},{"symptom":"OxC1900101-Ox4000D 2nd Boot error during migrate data operation        I am still unable to update to 1903 or 1909-currently on 1803-I get the above error at 89% installation then have to power off as the computer freezes. When I power on it recovers the previous version.I have tried the following:Disconnecting from the InternetDisabling anti-virusInstalling from ISO on a DVDDeleting files in Software DistributionRemoving supplementary hard drive from USB socketA friend suggested I put all my files except system files in the D partition as this is currently almost empty. Anyone had experience with that? Also perhaps removing any large files such as videos. What about an incompatible application Pinnacle Studio 12 video-editing software (no longer available free of charge). If I do the latter how do I back it up if I have to do a clean install? (which I don't want to do)","solutions":["Hi,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/for...The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","Here are the One Drive links to the 2 Panther files setupact.log and setuperr.loghttps:\/\/1drv.ms\/u\/s!AkWdY4cFj24Tga9ZlAtRdJ9RQ-39xwhttps:\/\/1drv.ms\/u\/s!AkWdY4cFj24Tga9YX7XYhnXosYLE-QI haven't done the rollback ones yet but maybe you can deduce something from the above.Many thanksDaphne","Thanks Daphne. Apparently the logs ended without telling the reason what caused the setup to fail.Please turn off unnecessary features and perform a clean boot and then try again.https:\/\/www.sevenforums.com\/tutorials\/5023-wind...https:\/\/support.microsoft.com\/en-in\/help\/929135...The fastest way to get the upgrade is through Media creation tool or ISO file. Please download Media Creation Tool from the link below and select Upgrade this PC at the first screen.https:\/\/go.microsoft.com\/fwlink\/?LinkId=691209All steps, including upgrading using ISO file and Media creation tool, are covered here:https:\/\/www.yourwindowsguide.com\/2019\/05\/update...Content on the above blog is written by a Microsoft MVP so it is safe. Disclaimer: There are links to non-Microsoft websites which would provide accurate and safe information. Watch out for ads on the websites which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Windows 10 Clean Install Crashing        Issue:So I've just completed a custom computer rebuild and I booted my computer to make sure everything was fine. I ended up running updates just to protect the computer, but after a few updates the computer just shut down and rebooted. I thought it was normal since there was a motherboard, GPU, and RAM change, so I just went ahead and reinstalled Windows (also bought Windows 10 Pro key from the MS Store, since mine was ancient and wouldn't work anymore). I got through the install and setup Windows 10 and it was running for a while. I started updates again, and after a few moments the computer shut down again. When it rebooted this time it didn't even make it past the Windows initialization (the spinning dots). I let it fail to Automatic Repair and booted to safe mode, the computer was able to get into safe mode fine and is stable there about 80% of the time.TL:DR - Computer isn't stable in a Normal Windows environment, but is usually stable in Safe Mode.Troubleshooting:- I've reinstalled Windows multiple times- tried a DISM repair from a shared Windows folder from the computer I'm on right now- Ran checkdisk and sfc (chkdsk found errors and attempted a repair but didn't get back into Windows cleanly, sfc showed no issues)- adjusted CSM support from Legacy only to UEFI First in the UEFI for the motherboard (this makes an initial Windows 10 install more stable, but it still crashes)- Tested different RAM and GPUs (even though everything has been working fine in other computers)- Installed WIndows 10 to a different drive (NVMe to SATA 2.5\" SSD)- System is currently running Fedora 31 installed to the NVMe drive and the computer is stable there.- Disabled all non-Microsoft startup items and tried to boot into Windows 10 with only Microsoft startup items- Updated UEFI from version 0801 to 1301-ntbtlog file was showing NOT_LOADED components for the following (listing unique)-- BOOTLOG_NOT_LOADED @kdnic.inf,%kdnic.devicedesc%;Microsoft Kernel Debug Network Adapter-- BOOTLOG_NOT_LOADED @cpu.inf,%intelppm.devicedesc%;Intel Processor-- @oem3 Nvidia graphicsI don't have the bootlog file anymore since I used the flash drive for the Fedora installer, but I will gladly reinstall Windows on another drive I have to get this computer running with Windows 10. There may be others that were NOT LOADED in there, like dgx****.System components:Intel Core i7 6700KAsus ROG Maximus IX Extreme4x8GB G.Skill Trident Z Royal @ 3333 MHz (this is a 3600 MHz CL17 kit, but that XMP profile isn't working with my board)Gigabyte Nvidia GTX 980 ti Xtreme Gaming Waterforce256GB Samsung 950 Pro NVMe1TB Samsung 840 Evo (was disconnected during most Windows installs, also the other drive I tested to make sure it wasn't a drive issue)1TB Samsung 850 Evo (was disconnected during most Windows installs)Corsair AX1200i power supply9x Lian Li Bora Digital RGB fansThe rest is just a bunch of watercooling components like, Pump, reservoir, radiators and all the components to connect that to the CPU monoblock.The CPU is idling at ~25-30 C. There have been no leaks in the system, and I know this because I've been checking on it every couple hours that I'm home.Any help is greatly appreciated!(edited for additional troubleshooting performed)","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please create another installation media (Flash Drive) using the media creation tool. You may need to use another PC is this one is not booting.Go to the following page and download the media creation tool. Run the tool, insert a flash drive and create the installation media. https:\/\/www.microsoft.com\/en-in\/software-downlo...Use this installation media to perform a clean boot.","I've done that and it's still didn't work. I've used the Windows Media creation tool to create\/recreate USB media on 2 different USBs and created an ISO and used Rufus 3.8 to create a bootable USB. All result in the same behavior described above. I also downloaded the tool separately for each installation.","Here is the problem. Please do not use Rufus. Simply format the flash drive as FAT32. Mount the ISO. Simply select all contents and copy them to the flash drive. Restart the PC and boot it from the flash drive.","It doesn't matter. It was the last thing I tried for my Windows installation as a potential solution. I've installed Windows 6+ times from 3 different flash drives in the past 24 hours with 5 of those installations using the Windows media creation tool and every installation has had the same issue. I just tried it again using your India link download and the computer is still doing the same thing.","Hi,Does this by chance happen after, or while attempting to install Nvidia drivers ?There have been tons of issues with some of them lately..","Hi,Does this by chance happen after, or while attempting to install Nvidia drivers ?There have been tons of issues with some of them lately..It does seem to coincide with the Nvidia drivers. If I pause Windows update, I can usually install all of my motherboard drivers and reboot back into Windows without a problem. I've tried the last 2 WHQL drivers, but I haven't gone further back. Any suggestions for a working version?","Hi,Sorry... I don't.. I encountered a problem last year with a much older card and don't even have the machine hooked up anymore... I don't remember what driver version solved the problem and because of the age of the card it probably would not be usable with your card..I do remember reading about one of the optional features associated with the Nvida Driver package as being a potential source of the problem, but don't remember what it was.. All of my current cards are AMD..It seems to me that it may have been one of these, or both..  PhysX System Software or GeForce Experience....You might check out this link and see if anything might be useful..https:\/\/www.ghacks.net\/2017\/06\/30\/install-only-the-driver-for-nvidia-graphics-cards\/There is a tool called WindowsUpdate Show\\Hide that can be used to block installation of most updates..https:\/\/support.microsoft.com\/en-us\/help\/3183922\/how-to-temporarily-prevent-a-windows-update-from-reinstalling-in-windoIf you use this tool be sure to click \"Advanced\" button and uncheck \"Apply Repairs Automatically\" to avoid anything accidental being done...","Thanks for the info, at the least! I'll give it shot and see if I get it fixed.","Did you try Legacy Boot at BIOS?","Hi Arif,Yes I did try Legacy boot, as that’s what my motherboard defaulted to out of the box. I’m pretty sure its narrowed down to the Nvidia drivers at this point. At one point I was able to get Windows installed, Nvidia drivers installed (and updated) and Windows updated and the computer was working, until I added another User - then the computer crashed and Winload.efi corrupted. I tried restoring to a restore point and it crashed again, then tried again, but Windows wasn’t even detected on the C: drive for system restore to revert changes."]},{"symptom":"Desktop Icons will not execute        Some Icons on desktop and start menu will not execute when I click on them, i.e. games. calculator, etc","solutions":["Hi Dukey5, My name is Riccardo and I would be happy to assist today with this issue. This sounds like you may have a system file issue...There are a few things we can do to fix this issue for you... Step 1: Checking Integrity of File System \/ Updates Go to Start > type in cmd > right-click Command Prompt and run as administrator. Type in the following: sfc \/scannow Let the above process run and complete. After that is done, type in the following: dism \/online \/cleanup-image \/restorehealth Step 2: Do a Repair Upgrade If after doing all of the above, it is still not functioning properly, do a Windows 10 Repair Upgrade. Although your files should stay intact; we always suggest backing them up as a precaution.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Let me know if this works for you as I will be here to assist with any further issues.","Thanks for your help.  When I did the scan I got this message: Windows  resource protection found corrupt files but was unable to fix some of them. For online repairs, details are included in the CBS log file  located at windir\\logs\/cvbs.log. When I did the:  dism \/online \/cleanup-image \/restorehealth I got a   error 87. The online\/cleanup-image\/restorehealth option is unknown.  At this point do I go ahead and do a Windows Repair upgrade. Thanks Dukey  ","Ricardo Thanks for your help.  When I did the scan I got this message: Windows resource protection found corrupt files but was unable to fix some of them. For online repairs, details are included in the CBS log file located at windir\\logs\/cvbs.log. When I did the:  dism \/online \/cleanup-image \/restorehealth I got a error 87. The online\/cleanup-image\/restorehealth option is unknown. At this point do I go ahead and do a Windows Repair upgrade. Thanks Dukey"]}]}