{"windows":[{"symptom":"Windows 10 - Mouse cursor sticks to edge between multiple monitors        Shared edges in multiple displays are sticky, registry keys that fixed it in Windows 8.1 no longer work.This needs to be addressed yesterday, this feature is widely considered to be a bug.","solutions":["Hi Brian,Thank you for being a part of Windows 10 family.I would suggest you to try configuring multiple monitors and check if the issue is fixed. If still the issue persists, then we can report this as a bug.Refer to the following Microsoft Help article to configure multiple monitors. The steps for Windows 8\/Windows 8.1 applies to Windows 10 as well.http:\/\/windows.microsoft.com\/en-US\/windows-8\/how-connect-multiple-monitorsPlease feel free to visit our website for any help with Windows Operating System.","I also have this problem. When I grab the title bar and move the app toward the second display, the cursor gets stuck at the edge of the first display.","Only thing I've found is to go into settings, system, multitasking and disable snap... However this disables it completely. A real fix would also be nice...","Yeah, I really hope MS fixes this. I have found that if you move the window super fast, it will break through this invisible wall and move to the next monitor. But that threshold is WAY too fast. The default needs to be way lower and give people the ability to change the speed threshold if they want.But how did this get passed by QA before release?! This is painful!And yes, I don't want to disable Snap to \"Fix\" this. As I love to snap apps for a quick split work view. This worked great with multiple monitors in Windows 8 and now it's terrible.UPDATE: This has been fixed for me for months now.","You thing if someone have dual monitors need advice how to setup the system??WINDOWS 10 HAVE THE SAME ISSUE LIKE WINDOWS 8\/8.1 ON DUAL MONITORS. ON WINDOWS 8\/8.1 WAS A REGISTRY FIX.So as a forum moderator ask microsoft to fix this stupid issue and then come back to give as advices how to connect dual monitors on our system.","Is not from the SNAP....HereI use the window snapping feature a lot, but mainly for maximizing windows. I have adual screen setup and when I drag a window along the top edge of the screen onto the second screen, it becomes stuck. This is very annoying, because I often want to move a window from screen 1 to screen 2 and maximize it at the same time.I first thought that this issue was related to the new ability to snap windows to one of the four corners. But even if I turn off snapping entirely and even if I am not dragging a window at all, mymouse becomes stuck in the top right corner of the first screen.http:\/\/www.tenforums.com\/customization\/13364-prevent-mouse-getting-stuck-corners-dual-screen-setup.html","Yes, this is exactly what I am seeing too.  You can break the barrier by speeding the mouse cursor across the boundary between monitors, but it's ridiculous interface behaviour and surely not right.","Is not even the speed of the mouse.... Is 28x28 pixels dead zone for the mouse on the top and bottom middle area of the desktops. I have this issue also with 3 monitors. I give them another week...if is not fix I move back to 7","The symptom you are talking about, is indeed not part of the Snap feature. But it is also not the issue this thread is about. And it is not part of Windows 10. You are referring to the Charms Bar. Which is activated by the top-right corner as well as the whole right each of each screen. The Charms Bar has been removed completely from Windows 10.The issue here is specific to Windows 10 only. While Windows 8 first introduced the Snap feature, Windows 8 and 8.1 have a different threshold of sensitivity to the screen borders. In Windows 8.x, you can easily move windows between multiple monitors without getting stuck between screens. You actually have to make an effort to go slow enough and pause at the border between screens to activate the Snap feature. But in Windows 10, this threshold is way too sensitive\/low\/high\/fast. As it activates way too easily. Microsoft should have left the threshold setting the same as Windows 8.x or offered a slider bar for the user to adjust the sensitivity.At this point, I would be happy with even a registry edit to give it the same Snap threshold as Windows 8.x, but I have not found that yet. I am also still hoping that Microsoft releases a Windows update to put the setting back to the way it was in Windows 8.Again this issue, of this thread, is specific to Windows 10 only right now.","Hi there.You try to tell me that your mouse can move between the monitors ( Top or Bottom ) without stop?? ( I'm talking about windows 10 ) I mean with or with out window move.If your answer is YES....then we are talking about different issue.I have contact Microsoft support last week and they login in to my computer ( I point them also this thread ) I show them the issue and they confirm that they are investigating the problem at the moment and they let an update fix in the future.I have try also with 3 monitors and I have this issue\/problem also. The mouse sticks in the top\/bottom middle of the monitors.... Is like a 28X28 pixels DEAD\/WALL area on this points.P.S. Is not the threshold you are talking about."]},{"symptom":"Is there automatic backup to One Drive?        Howdy,I have just started using Windows 10.I cannot add my files to One Drive because I understand they would no longer be in a folder on the C drive. My new Win10 computer has an SSD to make file access faster, so I wouldn't want to be downloading them when opening, slowing things down even more than a standard HDD. Also, the files have tens of thousands of hard-coded links between them that would no longer work.I've learned I could copy my files to One Drive instead of putting them there, but this manual system requires me to figure out what files and folders I have changed each day. I would like an automatic backup system, say one that once or twice a day, goes through a folder and backs up files with extensions I have specified so it's less likely I could lose my data.Can One Drive leave my files where they are and automatically backup all files with specific extensions for me?Thanks,   -- dunn","solutions":["Hi dunn Do you mean the folder is in the root of your C Drive? If so, by default OneDrive can only sync your User Library folders, however, trusted MVP Shawn Brink has as usual found a work around and you can find that on this link:https:\/\/www.tenforums.com\/tutorials\/92892-sync-...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.."]},{"symptom":"my taskbar has moved up 2 inches on my laptop windows 10        my taskbar has moved up 2 inches on my laptop.  I have a Lenovo Yoga 730 13' with windows 10.","solutions":["You can restart the computer. Or simply change the resolution\/background picture. (Surely, you can go back to the previous  resolution\/background settings after getting the problem addressed) ","Hi Steve,First, you should unlock the taskbar.Hover your cursor on the bottom taskbar. Right-click ----> Uncheck \"Lock the taskbar\"Move the mouse over the edge of the taskbar and it will look like a retractable box.Now, you can move up\/down to resize the height of the taskbar"]},{"symptom":"Having issues with my wi-fi wireless adapter any help would be appreciated        Not really sure if I'm in the right place but I'm hoping someone can help...I'm running windows 10 but for the last couple of months I've had to \"reset my wireless network adapter\" multiple times here lately I can work for maybe 5-10 minutes and than the wifi is out and I have to troubleshoot and its always \"fixed\" after the adapter has been reset. I don't have a issue with my tablet, my grandson uses his xbox and his laptop with no issues. I haven't made any changes I'm using the laptop in the same room. I've done a network reset (that hasn't helped) but I'm wondering if I need to purchase a new wireless adapter or someone said maybe uninstall and reinstall windows 10. This computer is only 2 years old. I need my computer to work any suggestions would really help! ","solutions":["Hi ClaudetteMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.1. Try running the troubleshooterPress windows key & IHead over to Updates & Security > Troubleshoot. Select Internet Connections, and go to Run the TroubleshooterFollow further on-screen instructions and let the process finish.Restart your computer2. Reset TCP\/IP stackRight-click on Start Menu button and choose Command Prompt (Admin) or click Start and type cmd, right click command prompt and run as AdministratorEnter the following lines into Command Prompt and press Enter after each one:netsh int ip resetnetsh int tcp set heuristics disablednetsh int tcp set global autotuninglevel=disablednetsh int tcp set global rss=enabledRestart your computer and see if you’re able to connect to WiFi now3. Re-install network adapter driverGo to Search, type devm, and open Device Manager.Expand network adapters and find your network adapter.Right-click your network adapter, and go to Uninstall.Follow further on-screen instructions.Restart your computer.Hope this helps.","Hi Jon, thank you for your reply. I'm going to try #2 because I've tried 1 and 3. Actually #1 is telling me it's resetting my wireless adapter.","Hi Claudette, no problem, let me know how you get on."]},{"symptom":"cannot down load the latest Windows10 update troubleshooter        when I try to download the windows10 update troubleshooter the download places a troubleshooter icon but never completes the download","solutions":["Hi John. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.When Troubleshooters don't work we check over the System to find and fix problems. Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. For other Updates fixes that are working now, I'll give you everything possible for fixing failed Windows Updates, so that at least something will work before you work through them all:Some Updates will sort themselves out in a few days so I'd wait to see. If not or they are bothering you then here are steps you can take:1) Run the Windows Update Troubleshooter from Windows Settings > Update & Security > Troubleshoot.2) There is a new guided walk-through from Microsoft for repairing Windows Update that leads up to resetting components if necessary:https:\/\/support.microsoft.com\/en-us\/help\/10164\/.... Try running that first. 3) If that fails try manually resetting Windows Update Service: Open administrative Command Prompt and type following commands one-by-one followed by Enter key.net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver Close Command Prompt and see if Windows Updates works then 4) You can also install the Updates manually that fail to install, which are logged at Settings > Update & Security > Windows Update > Installed Update History, and then search for those to download and install from this Catalog:http:\/\/test.catalog.update.microsoft.com\/v7\/sit... 5) If they continue to fail and interfere, then you can block them using one of these methods:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... 6) If problems with Updates have become chronic and especially if you have other performance problems, go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 7) If nothing else works then do a Repair Install, by installing Media Creation Tool, open installed Tool and choose to Upgrade the PC Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version 1909. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... _____________________ Good news! There are major changes in Version 1903 giving back control over Updates to the consumer. Microsoft has heard us at the highest level who announced this here:https:\/\/blogs.windows.com\/windowsexperience\/201..._____________________ I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to stay signed on on Firefox?        Hello,Can someone in the Microsoft Community please tell me how to stay signed in with Outlook Mailon on Firefox?I get signed out every few minutes on Firefox.Putting a check in the \"Stay signed in\" box does not work.Thanks,A.W.","solutions":["Firefox is a web browser not a mail program.","Hello,I should have said,\"how do I stay signed in to Outlook Mail when usingFirefox\".The stay signed box with a check does not work.Thanks,A.W.","Hi,Thank you for writing to Microsoft Community Forums.I understand that you are signed out of Outlook Mail in Firefox even if the Stay signed in option is selected. I’ll help you with this issue.It could be possible that the browser is set to clear cookies. You may want to add an exception for Outlook.com and see if that helps. Refer the steps mentioned below:Open Firefox and click on the Hamburger button (3 dash).Click on Options.Now, click on Privacy & Security.Scroll down to Cookies and site data section.Make sure the checkbox for Delete Cookies and site data when Firefox is closed is unchecked.To add an exception, click on Manage Permissions and add Outlook.com.For more information, see Control whether Firefox automatically fills in forms andHow to fix preferences that won't saveLet us know how it goes.Regards,Nikhar KhareMicrosoft Community - Moderator","Hello Nikhar_K,Thank you for your email,and for the information.I wrote down all the steps you sent me in your email.I found and did all the steps,(this was good detailed info.),but,I still have to sign in every time to open Outlook mail.I will try the two links you sent me,later. It is getting late here,and I have togo back to the V.A. tomorrow,a 100 mile trip.Thanks,A.W.","Hi,Thank you for replying.Please keep us posted on the issue. Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"Windows updates are failed in Windows Server 2016          We are using Windows Server 2016 for additional AD. And We are tried to install windows update in server. But Update Failed to install. I had try to lot of  steps, The below error is showed ,            • 2019-12 Cumulative Update for Windows Server 2016 for x64-based Systems (KB4530689) - Error 0x80073701Please provide best solution.","solutions":["Hi Syed I am sorry, Community is just a consumer forum, due to the scope of your question (Server 2016) can you please post this question to our sister forum on TechNet in the Server 2016 section (linked below)Over there you will have access to a host of Server 2016 experts and will get a knowledgeable and quick answer to this question . ..https:\/\/social.technet.microsoft.com\/Forums\/en-...","Hi DaveM121,Thanks For your Reply,Sure, i will ask question  to TechNet."]},{"symptom":"Some Keyboard Keys Not Working        On my laptop’s built in keyboard, the keys escape, caps lock, tab, 1, and ‘ dont work. 1. Yes, the on screen keyboards work when i click it on there2. I already uninstalled and reinstalled my computers keyboard driver multiple times3. My keys used to work if i spam clicked them multiple times, but now none of them work","solutions":["Hi Jeffrey. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything possible for keyboard problems. If you need help with any steps I'll be standing by here to help you.Sometimes a stuck key can be due to crumbs getting under it. Unplug keyboard or power off laptop, turn it upside down over a trash can and gently rake the keys to dislodge crumbs. If the key is still stuck, remove and clean under it as shown here:https:\/\/www.wikihow.com\/Repair-a-Laptop-Keyhttps:\/\/www.youtube.com\/watch?v=QCYOiK9QP08Try the Keyboard Troubleshooter at Settings > Update & Security > Troubleshoot. If this began within the recent past, See if you can System Restore to a point before the problem began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Check which Updates were installed at Settings > Update & Security > Windows Update > Installed Update History and try uninstalling any from around the time this started. If they return and cause the same problem then hide them with the Hide Updates tool:https:\/\/www.howtogeek.com\/224471\/how-to-prevent... What also might work is to go into Device Manager, reached by right clicking the Start button, choose the Keyboard device, on Driver tab try Updating the driver automatically.If this fails from the same location try rolling back or Uninstalling the Keyboard driver, which works in a surprising number of cases where keyboard is messed up by Updates. Restart PC to reinstall driver.See if the keyboard will work in Safe Mode with Networking, or Safe Mode: https:\/\/www.digitalcitizen.life\/4-ways-boot-saf... If not see if the On-screen Keyboard works at Settings > Ease of Access > Keyboard > Turn On the On Screen Keyboard.If so then it could confirm the keyboard is failing, so test it in repair mode to see if it works since it uses different drivers there:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... If not you can contact a laptop manufacturer to see if you can still get it replaced under warranty, or check for replacement keyboards for that model from the PC maker or online from after-market OEM's that exactly match it.Try resetting the keyboard: http:\/\/www.thewindowsclub.com\/reset-keyboard-se... You can also remap keyboard keys using one of these methods: https:\/\/www.makeuseof.com\/tag\/missing-key-remap... Check in your BIOS or UEFI firmware Setup for keyboard settings there, too. If it's a hardware problem then you can often easily replace a keyboard by asking Google for a replacement for your full model number laptop, confirm with seller it fits that unit, locate a video or tutorial the same way which demonstates swapping it in.If none of these works then go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.Another thing that might help as it solves many problems is to Upgrade to the latest version by installing the Media Creation Tool from this linkhttp:\/\/windows.microsoft.com\/en-us\/windows-10\/m... choosing Download Tool Now, install the tool, open it and choose Upgrade this PC Now. This will save your files and apps while bringing you up to the latest version by the most stable method. It will also bring all of your Updates current and solve most problems since it reinstalls Windows.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","The keys underneath my keyboard are clean. Also is there anyway to test if its an issue with the driver\/hardware or if the keyboard itself doesnt work","All that is covered in the many steps I gave. It sounds like you only did the first step!Please do not skip any steps. We often find out later that the fix was the skipped step. If you need help performing any step I will help.","This sounds like something was spilled on the keyboard and it needs to be cleaned.  If it was dry stuff turn the keyboard upside down and rap on the bottom or use canned air and blow the stuff out.If it was liquid you need to get some Contact cleaner and wash out that area of the keyboard."]},{"symptom":"Realtime high frequency data refresh using WinForms and C#        I am facing an issue where the main thread is not handling high frequency data refresh.This is causing the application to slow down and impacting other tasks.Is there any way to increase the data refresh to more than 400 times per second.This issue is occurring on Windows 10 but is working on Windows 7.","solutions":["Hi MS(93) I am sorry, Community is just a consumer forum, due to the scope of your question (Windows App Development) can you please post this question to our sister forum on MSDN (The Developer Network) in the C# section (linked below)Over there you will have access to a host of C# Developers and will get a knowledgeable and quick answer to this question . ..https:\/\/social.msdn.microsoft.com\/Forums\/en-US\/..."]},{"symptom":"Cowin E7\/s not working on Windows 10        Hi everyone, Im sort of at the end of my rope here, been trying to get this thing to work forever. The Cowin E7's are bluetooth headphones which are pretty nice overall. My only problem is that I cannot for the life of me get them to work. They are able to pair to my PC's bluetooth, and connect just fine as shown below. The microphone will work just fine. When using discord, it will detect audio being transmitted from my end. My issue however, is that I can't hear a thing. No audio comes through on my end. Youtube videos, Spotify, games, etc. will not transmit any sort of sound. When checking the sound panel settings however, it shows that the green bar for sound is fluctuating, like it is detecting audio.I have managed to get it to work once, but I am not sure what I did to make it happen. Even then, it would only play audio for about 10 seconds, and then cut out completely and indefinitely until I restarted the PC. Sometimes, the headphones will work just fine, but then the microphone won't be detected at all, preventing me from communicating. Seems to be no middle ground.I have attempted several fixes, such as deleting the Bluetooth stuff from the Device Manager, changing the Bluetooth support service to automatic, and a whole heap of other things such as changing the windows version in the Registry Editor back to 6.2 instead of 6.3Does anyone else have these headphones? And if so, have you managed to get them to work? Really frustrated right now, and any help at all would be greatly appreciated.Thanks,Jared ","solutions":["Hi P4CK Greetings! I am Vijay, an Independent Advisor. To diagnose the issue, I would request you to provide following information -A. Windows Key+r > Type msinfo32.exe and Enter > Post the image here B. Also Windows key+x > Device manager > View (on top) > Show hidden devices > Expand Sound, video and game controllers adapters > Double click on your audio driver to open Properties > Driver tab > Post the screenshot. .Post for Bluetooth driver as well.","Hi Vijay,Thanks for responding so quickly, I appreciate it immensely.Here is the system summary:Here is the Sounds, video, controllers page:And here is my Bluetooth page:Thanks a ton,Jared","This page of MSI lists down BIOS and varioud driver updates. You should update them -https:\/\/www.msi.com\/Motherboard\/support\/X470-GA... Note - Create a system restore point first so that if something wrong happens you can revert.Type restore point in Cortana Search > Create a Restore point > Check whether against your drive, Protection is ON or not. If not ON, click Configure button below to Make it ON > Now press Create to create a restore pointDisclaimer - This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","@P4AK A PUNCH: I have the same problem with my Cowin E7 headphone. It was working fine until the 1903 update to Windows 10. I reverted back to the 1809 release to make it work but Microsoft is ending support for that release. Sent in a problem report to Microsoft to no avail. Hope this is fixed soon!","What I think is going on is that the device is acting as two devices.  A hands free headset and a headphones set.  When you disable the hands free headset profile, it allows the headphones profile to work.  At least, that is what I have experienced with mine.I have a separate BT dongle, which is working fine and everything pairs and shows up.  I can get some audio tests to work for the headset in hands free mode, however nothing is using it when I set the hands free profile for the audio output.  I think forgetting and repairing the device should allow us to get reset to where removing the hands free profile allows full stereo sound again.You may want to reach out to their CS to see if they know of any tricks, since this issue is usually due to design flaws\/cost cutting.https:\/\/www.cowinaudio.com\/pages\/cowin-customer-support","I just figured a temp fix until Cowin responds:1. When connected, go to the bluetooth control panel page2. Right click on the headphones\/device and choose to delete.  Say yes to permanently remove it.3. Power cycle the headphones to force broadcasting (turn it off and back on).4. Pair the headset.  Open the sound control panel (not the enhanced windows one, the old control panel -> sound)5. Make sure the hands free device is present and works.  Check the sound tray by the clock in the taskbar.6. In the bluetooth control panel, double click the headset.  Right click on the hands free profile and choose disable.7. In the sound control panel again, set the normal headset as the active device, test, and make sure, like in step 5, that the normal headset is the active device.It should work and allow music.  You won't have a mic.  If you enable the hands free profile for the mic, it will corrupt the setup and you have to go through the steps above to rebuild it to a working state.  And it may be something to do every time you turn them on and pair them to the machine.  Haven't tested that yet.","I have the same problem. I can re-pair the headset and have both the headphones and the hands-free devices showing in the sound control panel but have yet been able to get the mic work for anything. So far I have only gotten the headphones bit to work and I've tried resolving this for hours now","Thank you for your suggestions, Seikojin. I have always had my hands-free headset device disabled since I just use the headphones.The audio on the headphones just cuts off after a while even though the control panel shows the device as being connected. Sometimes, the audio resumes after a few minutes automatically if I do not do anything. Most of the time, I intervene manually to regain audio by disconnecting the headphone from the control panel and re-connecting. Hopefully, Cowin fixes the problem soon.","I wrote Cowin and linked this article and they so far have offered to replace the headset.  I think the issue is not the headset in a fault sense, but in a design sense.","I have some friends and at work have had issues with BT headsets losing audio.  Sometimes this is a fault with a wifi and BT radio on the same chip\/circuit. Other times there could be power saving features dropping BT when it is 'idle' long enough, hits a power threshold, battery life on the machine, etc. "]},{"symptom":"Cannot load Windows 10 under Intel HD Graphics Family Driver with Intel 2nd Generation CPU        Hi,I found I have a PC with Intel HD Graphics Family Driver with Intel 2nd Generation CPU. It works fine on Windows 7 - 64 bit. But it cannot load into windows either in normal mode or safe mode after get latest windows updates. Please help.BRUser","solutions":["HI User. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.1) If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... You can also use System Restore from within Windows to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r... If you cannot get into Windows then you can System Restore from Repair Mode reached by one of these methods:https:\/\/www.tenforums.com\/tutorials\/2294-advanc...While there you can also try the new Uninstall Updates button in the Advanced Troubleshoot Options, see Option four:https:\/\/www.tenforums.com\/tutorials\/5486-uninst... 2) If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...3) Compare it to the driver you have with the offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... You can also try installing the driver in Compatibility Mode to see if it will run the latest version\/Updates:https:\/\/social.technet.microsoft.com\/Forums\/win...4) It's possible it may not be supported any longer in Windows 10. You may need to replace it or stick with the older version, block the newer versions or affecting Updates as shown here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"New motherboard - windows 10 re-activation        Hi, just recently needed to replace my motherboard and now Windows thinks it's a new computer. I had Windows 10 pre-installed, so it is a digital license. When I try to troubleshoot and pick the option that I recently changed hardware, I always get the option Unable to activate Windows We can’t reactivate Windows on this device. Try again later. Well, I've tried again later. Every day. Finally fed up, I called tech support and waited 1 hour and 37 minutes before getting hung up on. I'm not sure what else I can do here. Any suggestions would be greatly appreciated.Thanks.","solutions":["Hi bartz008, I am an independent advisor and a Microsoft user like you, and I would be happy to help you out with this.Do you recall if you had an OEM version or a Retail version of Windows 10? OEM versions are not transferrable, while a Retail version is. When the motherboard is changed, it is generally considered a new computer and so I believe the original license may have been OEM in your case.The Windows activation is generally linked to the Microsoft Account you use to log in, so activation would hopefully occur seamlessly if you are using the same account to log in.If you are not using a Microsoft account and if you haven't done this already, you can try to run the Activation Troubleshooter located from the Start Menu > Settings > Update and security > Activation and run the troubleshooter.Otherwise, you may need to contact Microsoft Support directly via phone or live chat:https:\/\/partner.support.services.microsoft.com\/...This article has an overview of the activation process which may be helpful: https:\/\/www.groovypost.com\/howto\/transfer-windo...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. I hope this has helped you. If this is not what you are looking for, please reply and let us know and we would be happy to look into providing some different suggestions!Regards, -Ashton","WINDOWS 10 HOME FOR HIGH END DEVICES DIGITAL License is what my receipt says, it doesn't say oem. And like I've said, I tried the troubleshooting and keep getting the error Unable to activate Windows We can’t reactivate Windows on this device. Try again later. I tried the live chat. It gave me a phone number. I called and was on hold for 1 hour and 37 minutes until I was hung up on. ","Hi bartz008, Thank you for this helpful information. Sorry to hear that you were on hold with the support line for so long.For info, we do not have any ability to look up or modify license information so we can only provide a referral to Microsoft for license activation lookup\/modifications.I looked up that license, and it appears to be linked to Cyberpower PC (https:\/\/www.cyberpowerpc.com\/)Is this where you got your computer? If so, it looks like they have Windows pre-installed and shipped on the computer, which means it was very likely an OEM (Original Equipment Manufacturer) license. Retail licenses are usually purchased individually in a store or online, and separate from a computer.If Cyberpower shipped you the replacement motherboard, they may be able to help out with providing a new license for it. I would suggest to contact them as a manufacturer to see what they can do:https:\/\/support.cyberpowerpc.com\/hc\/en-usI hope this helps - please keep us posted and let us know if you have any further questions!-Ashton","That's correct. I guess I need to contact them then. Thank you for the follow up! ","You're welcome! Let us know if we can be of any further assistance.","They just told me to go through you guys (Microsoft) and if that didn't work there's nothing they can do. I had Windows 10 for years but now I guess I'm out of luck on this because a motherboard failed.","Thanks bartz008, for getting back to us. We here are not Microsoft and don't have the ability to look at licenses, however I do encourage you to contact Microsoft directly:https:\/\/partner.support.services.microsoft.com\/... Hopefully you will not have to be on hold for as long as you were before, and they are able to work something out with you for the license.Best wishes, -Ashton","Sorry I forgot you weren't directly with Microsoft. Thank you for reminding me the phone method may still work. Thank you for taking the time to help, I appreciate it!Matt","Hi Matt, no worries at all. I hope they are able to help you out! Happy New Year! -Ashton"]},{"symptom":"Keystrokes        Re:  KeystrokesI have a sound when I hit a key on my keyboard, cannot backspace more than 1 space & unable to type 2 identical letters or add 2 spaces together.This happens on the keyboard whether I am using Word, Excel, Internet, etc.I do not think that I did anything, but, obviously, I must have somewhere!  Help!Thanks very much!","solutions":["Hi Susan Open the old Control Panel (clcik your Start Button, then just type control and hit Enter)At the top right of Control Panel, make sure View is set to Icons Click 'Ease of Access', then choose 'Make the Keyboard Easier to use' Turn off Filter keys and all its sub settings Then click 'Apply' and OK to save that setting That should return your keyboard to normal . . .","Thank you very much!  That worked and corrected my problem!","Hi Susan, glad to Help!"]},{"symptom":"Is there any way to copy files to a Win10 computer over a local network?        I would have thought this would be a simple and obvious function for Windows, but it seems that Win10 has made this simple obvious function ridiculously difficult -- or perhaps impossible -- if the existing network consists of Win7 computers.I have an existing network of three Win7 computers -- which all work perfectly (other than the incessant dire warnings from Microsoft that they are all about to turn into pumpkins at the stroke of midnight).I now have two Win10 computers that need to join the network.  These two computers both see the network.  These two computers both see the existing computers on the network.  The other computers on the network can see that these computers exist on the network.Using a Win 10 computer I can copy files from shared folders on any of the Win7 computers (however large transfers seem to die because Win10 keeps stopping transferring the files if it takes too long) -- also it is a major pain to find and drag each file from the Win7 computer simply because the Win10 laptop is a pain in the butt with its weird interface).It would be much more convenient if I could use the Win7 computer to simply tag and drag the files to the Win10 computer, but the process seems to be entirely one way.  Any time I try to access the Win10 laptop from one of the Win7 computers, it wants an ID and password -- but of course there is no such User ID and password.I have only been using computers every day of my life since CP\/M on an 8-bit system that I built from scratch, so obviously I have not yet learned how to use a computer or a network yet.  I've used CP\/M, DOS, Windows 3, 3.1, 3.11, 95, 98, 2000, XP, 7 and probably a version or two that I have forgotten, but I have to admit that Windows 10 is just plain weird to me.  I am used to Microsoft moving stuff around and changing the names of functions and settings, but I cannot find anything in this nightmare.Short of installing Windows 7 on both the new laptops, is there any way to get these computers to actually work?  The two largest frustrations are that open windows want to magically disappear (sometimes to be found hiding on the task bar, sometimes not) and the problems with Win10's aforementioned refusal to play nicely with others allowing other computers to pass files to the Win10 computers.I'm sure that I must be missing something because I cannot believe that anything that works as badly as Win10 seems to could have survived but I cannot find any meaningful instructions for using Win10 beyond the idea that the user is irrelevant and should just let Windows run the show.","solutions":["Hi N4. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Windows sharing has been broken ever since they removed Homegroup, causing many to believe this was intentional to push us to OneDrive sharing. More about that option later.I'll give you everything possible to try for file sharing problems so at least something will work. If you need help performing any steps I am standing by here to help:See here for how to share files and printers over network after removal of HomeGroup in Version 1803:https:\/\/www.windowscentral.com\/how-share-files-...https:\/\/www.tenforums.com\/tutorials\/111783-shar...https:\/\/www.windowscentral.com\/how-access-files...To troubleshoot sharing problems: https:\/\/www.lifewire.com\/troubleshooting-window...https:\/\/windowsunplugged.blog\/2018\/03\/27\/networ...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/superuser.com\/questions\/1202441\/windows...If you cannot get past the password protected sharing prompt: https:\/\/www.isunshare.com\/windows-10\/fix-enter-...https:\/\/www.speedguide.net\/faq\/windows-is-askin...https:\/\/www.tenforums.com\/network-sharing\/61689...If Windows 7 is involved make sure if applicable you have the WIndows Update released to fix Windows 7 sharing issues here:https:\/\/www.bleepingcomputer.com\/news\/microsoft... Test if turning off Controlled Folder access helps: https:\/\/www.thewindowsclub.com\/controlled-folde... See these additional resources for when a PC does not show up on network: http:\/\/woshub.com\/network-computers-not-showing...https:\/\/www.thewindowsclub.com\/network-computer...https:\/\/social.technet.microsoft.com\/Forums\/en-...You may want to change to sharing via OneDrive: https:\/\/www.computerworld.com\/article\/3256907\/m... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... If you want to express your opinion on this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems. If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it.I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Thanks, Greg, I'm sure that I will learn quite a bit as I go through those links.  At least they are certainly a place for me to start looking even though a lot of that is written in Microsoft (which bears little resemblance to English).I can't be 100% certain (due to a lack of experience with Win10) but I strongly suspect that both Win10 laptops are working as Microsoft intended -- my problem is most likely that I am trying to do things that Microsoft doesn't think anyone should be doing (including using Win7) and doing things in ways that no one in Redmond considered.I do know that the Win7 computers are fully updated and working (although again I might be using them in ways that our friends in Redmond never intended).The two Win10 laptops that I am currently battling are my first real foray into Win10 - when Win10 first came out, I \"upgraded\" one of my computers, spent about 10 minutes scratching my head, and had it revert to Win7.   I will readily admit that I am not a fan of change-for-the-sake-of-change which seems to account for most of the Win10 design as an operating system designed entirely for appliance operators.One Win10 laptop belongs to my adult daughter, the other is one I just purchased.  Both will be used mostly for browsing, light word processing, and mostly for watching video files -- and, of course, for exploring Win10.  For the near future at least, my desktop Win7 system will remain my primary computing platform.  My new Win10 laptop was intended to replace my Win7 laptop which has always been relatively lightly used whenever traveling.I have several TB of content on my existing network consisting mostly of docx, pdf, jpg, mp4, and mkv files -- of which between 100-200GB of various files need to be copied to the new Win10 laptops now and then various files copied later.  Very little would ever need to move from the laptops to the network.I had initially expected to be able to handle this pretty much the same way I have been for several years, where I generally get on the desktop, select files, and drag them to the laptops using my local network. That is where I have hit a brick wall with Win10 -- I can't figure out how to use the Win7 computer to copy files onto the Win10 laptops over the network.   I can use the Win10 laptops to copy files from the Win7 system so I know the connection is fine and the files are fine.  The problem seems to be related to the \"better security\" of Win10 but so far I haven't found any clear explanation of what the various setting are or even where they are.","If you want a simple way to workaround the blockage for now, just install Google drive on the PC's, copy any files you want shared into it and it will instantly appear on the other PC\"s. They offer 15gb free storage for this. Download here:https:\/\/www.google.com\/drive\/You can of course do the same with OneDrive (possibly what they intended by removing HomeGroup and breaking File Sharing) but with only 5gb free. But it's built into Windows 10, and easily enough installed to 7 from here:https:\/\/support.office.com\/en-us\/article\/onedri...","That is workable, but requires moving each file twice which has to be done separately from each computer. The awful system that Microsoft has inflicted on Win10 only requires moving the files once, but has to be initiated from the receiving Win10 computer and doesn't seem to do well supporting multiple simultaneous transfers -- which are all things that work perfectly within Win7 but don't work in our beloved \"improved\" Win10."]},{"symptom":"bluetooth        I’m writing this because it’s the second time that something like this has happened, first was with my cowin e7 Bluetooth headphones. I connect them and I’m having trouble not because there is no connection, in fact that’s the easy part but I have no idea why does it show that only voice is connected and my computer keeps on playing any audio from the speakers. This second time happened me with the Samsung level U, I got it to connect one time after been playing with it and reading a lot from different places but that’s it, and even that time I think I was just lucky. No idea why this is really happening and can’t find any forum where someone has the same problem as I do, hope you can help me.  the only think I found that could be a chance its that my computer Bluetooth drivers are not compatible with the windows 10 I have  as you can see in the pic below it just says connected this time, not even voice could connect.","solutions":["1st,as Intel says,the 1st installation after the OS should be the Chipset Software\/Driver,this allows the OS to run Video\/Audio\/Storage controller\/etc,get this from youre pc mfg..Next would be storage,Intel runs Intel storage mgr...Once installed,in cmd type:  services.msc   in msc,scroll to Bluetooth,double click,set to; Auto start,start service,exit,maybe scroll to Win installer & Win Modules,set both to Auto start,exit,restart pc..","Hi Nitram. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I will give you everything that's working for others with the known issues with Bluetooth and headsets:First HEADSET: First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.Sometimes it helps to unpair or disconnect all other Bluetooth devices from the PC in Bluetooth settings, then try again to connect the headset.BLUETOOTH Troubleshooting: See Fixes here: https:\/\/support.microsoft.com\/en-us\/help\/14169\/...http:\/\/superuser.com\/questions\/823894\/how-to-ma...Try the Bluetooth troubleshooter at Settings > Update & Security > Troubleshoot. Try turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change settings that are unavailable > uncheck Fast Startup.Try Updating the Bluetooth driver from the PC maker's Support Downloads webpage for your exact model. Install it even if it's the same or newer than the one in Device Manager reached by right clicking the Start button.Right click Start button to access Device Manager, locate Bluetooth device (if necessary from View tab Show Hidden Devices), on Driver tab see if Roll Back is available, if not try Update Driver, first automatically, then Browse, then Let Me Pick to try all previously installed Drivers. If these fail try to Uninstall the Driver, restart PC to reinstall. Then try pairing again, if necessary run the Bluetooth Troubleshooter again. If you think the BT adapter has failed, you can replace it easily with a USB nano adapter like this one:https:\/\/www.amazon.com\/ZEXMTE-Bluetooth-Receive... ___________________________ If this was caused by Windows Updates then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1909 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10        Hello,     I want to know is there a way to check my windows 7 key to see if it had been upgraded to windows 10? You see I have a few computers and a couple I had dropped back to windows 7.  I would like to move 1 back to 10 but I need to know if there is a way to check my Key for 7 to see if in had been.  Thanks William ","solutions":["No, there isn't a list to check to see which Windows 7 keys you upgraded to 10 then reverted back to 7 were actually upgraded to 10 in the first place.If you did set up a Microsoft Account for 10, you could check to see what is listed there as being installed.Manage your devices for Microsoft Storehttps:\/\/support.microsoft.com\/en-au\/help\/4026440\/microsoft-store-manage-your-devicesWhen your free upgrade to 10 was  originally activated Microsoft will have kept the Hardware Configuration details of your device on their Servers for recognition purposes if you have to reinstall 10.\"Activation in Windows 10\" (Digital entitlement)https:\/\/support.microsoft.com\/en-au\/help\/12440\/windows-10-activationCheers."]},{"symptom":"Windows Stuck Update        Hello I have just installed my new gpu into my old System the gpu is a Zotac 1660 amp It works fine it is just when I try to install the drivers it says it is not compatible with my version of windows. But when I try to update my windows it always doesn't finish. It might go through the whole update but then restarts and then boots right back up and it is stuck on the same version of windows. I have tried many things to fix this but it is not working can you please help me","solutions":["Hi X. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Run Windows Update to see if it finds an adequate driver for the GPU. Go to Settings > Update & Security > Windows Update > Check for Updates, expedite them through restart, go back and check for more.If not then try installing the GPU software and driver in Compatibility Mode: https:\/\/www.groovypost.com\/howto\/run-old-softwa...https:\/\/social.technet.microsoft.com\/Forums\/win...I would manually upgrade to the latest version 1909 by opening the Media Creation Tool from this link:http:\/\/windows.microsoft.com\/en-us\/windows-10\/m..., choose Download Tool Now, then open the tool and choose Upgrade This PC Now. This saves your files, apps and most settings in place, is the most stable method to change versions, brings your Updates current, resolves most problems. If any problems report back the verbatim error and number, then continue with these steps for overcoming Version Upgrade problems:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... If the Version has problems I will work with you to try to resolve them. If the problems are unfixable for now, you have ten days to roll it back in Recovery settings. You can then hide it so it doesn't try to reinstall following this same method:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta... Most problems are resolved by doing this gold standard Clean Install which should get you past all difficulties as it has millions of others who have followed the steps in this link and never come back to report another problem:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... . So read it over and see if its something you want to learn to do.I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to rate my post, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Have you gone Settings, Updates, Recovery, Reset my PC?What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK"]},{"symptom":"How do I get Window's 10 installed for free.        need a answer on this if possible","solutions":["You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"Cannot Load Windows 10 or Access the files on a Hard disk        My computer does not load windows .. when i connect the disk it shows it locked by bitlocker.. i got the password to unlock but still i cannot access files.is there a way i can troubleshoot this disk and get files??help","solutions":["Hi Ken. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See this guide to operating Bitlocker: https:\/\/www.windowscentral.com\/how-use-bitlocke...To recover files if it won't unlock: https:\/\/www.howtogeek.com\/263561\/how-to-recover...http:\/\/woshub.com\/data-recovery-on-a-damaged-ha...To turn off BItlocker: https:\/\/www.tenforums.com\/tutorials\/37060-turn-...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Onedrive said its disabled by administrator        I was recently attacked by malware but I fixed it by formatting windows. When I clicked on one drive it says it was disabled by the administrator but I am the only user on this laptop and I haven't done anything. How do I fix this?","solutions":["Hello Spandan,1. Press the Windows key (start menu) type in gpedit.msc, this will open the Group Policy Object (GPO).2. Goto Computer Configuration, Administrative Templates, Windows Components, and Onedrive.3. Double-click Prevent the usage of Onedrive for file storage.4. Choose Disable and click OK.Close Group Policy Editor.this should solve the problem."]}]}