{"windows":[{"symptom":"No Internet Connection for Desktop        Hi. I suddenly lost internet connection on my desktop. I think I have Windows 10. I rang my internet provider and we tried everything. My cell phone has internet and so does my tv. Anyway my provider said that it’s Error 651 so it’s a Microsoft problem. I’ve tried to troubleshoot offline and Microsoft is saying I need to run a cable from the computer to the router? modem? The problem is that my computer is upstairs and the router is downstairs. Also it was a wireless connection until a few hours ago so a cable connection isn’t the problem. Any ideas?","solutions":["Hi, CarolAlthea My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...https:\/\/support.microsoft.com\/en-us\/help\/10741\/...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Windows 10 1909 Can't type in search bar in Windows explorer        Ever since updating to 1909, I've had this bug where I can't search for files in windows explorer unless I either restart my pc or restart windows explorer.exeIs this a common bug?","solutions":["Hi Linsassin and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi Linsassin and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! I've already done sfc \/scannow and the DISM thing and they both reported back with 0 errors.","Hi Linsassin, I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/windowsreport.com\/windows-10-cant-type-...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Having the same issue. None of the suggestions Ive been able to find fix it. Doesnt look like the two people who replied with suggestions actually read the problem. We can type in the search box on the task bar, but CANNOT type in the search box in Explorer.","Having the same issue. None of the suggestions Ive been able to find fix it. Doesnt look like the two people who replied with suggestions actually read the problem. We can type in the search box on the task bar, but CANNOT type in the search box in Explorer. Unfortunately same issues here. Windows 10 just keeps getting more \"terrible\"","It has been reported here before. Post using the Feedback Hub to report your concerns.","Yeah I bet itll get fixed right away. Found another poster with same issue dating back to Nov. ","I know what you mean but Microsoft delevopers don't come here. This is a user forum group.","Is your task manager working properly aswell? I've recently discovered that it keeps bugging out, sometimes I open it and try to run a new taask it just opens and then blinks and but doesnt show up. I try to click the dropdown arrow on a process and it just freezes , Also my graphics on my taskbar go weird I'm not sure how to describe it. I have noticed aswell that some of the processes run in the background \/ that number next to programme for example Firefox (XXXX) number is really high? or must be wrong compared to an older ver of Windows I used in the past. Why is 1909 so buggy?????","I don't have a problem with search in File Explorer or Task Manager, although I don't try to regularly run a new task. Processes look the same as always to me, although as I type this Edge has 9 running processes 1 suspended.I don't have any issues with version 1909."]},{"symptom":"2019-12  windows 10 version 1909 won't install        I have a new gaming pc and I have tried to install this update 1909(KB4530684) and I have gotten to 100 % installed and then it just fails and does nothing anybody can help me out Also the error code it gave me was(0x800706be)","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Minecraft for Windows 10 Starter Collection        Hello,I recently bought Minecraft for Windows 10 Starter Collection on Microsoft Store, but I cannot log in.Specifically, I get the \"Failed to login\" message and I am informed that there is something wrong with my internet  connection, which is not the case.In the Settings->Profile->Errors I get error code 0. I have the receipt of purchase at hand. What am I doing wrong and how can I resolve this?Thank you","solutions":["Hi, StefanStefanOB My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Sir,I did everything you said, but in the Poweshell window I kept getting messages \"Access denied\" and stufff like that, so nothing was resolved.Then, I downloaded the app you suggested, ran it and got messages that the Microsoft Store cache was destroyed, but it fixed it.The problem, however, still continues. Nothing has changed, I still cannot log in or use the coins I have puchased.Please, help me","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Multiple Windows User Folders        I have inadvertently created several User Folders, some with duplicate files and some with new files.  Can I combine the files into one User folder?","solutions":["Hi Judy Have you manually created those folders or have your created other user profiles, which are attached to those folders?Open 2 File Explorer windows (press the Windows Key + E twice) Set the first Windows to your actual user folder Then in the other File Explorer window, locate the files you want to move and drag those into the correct library folder inside your library folder in the other windowDoes Windows allow you to do that?","Hi Judy Have you manually created those folders or have your created other user profiles, which are attached to those folders?Open 2 File Explorer windows (press the Windows Key + E twice) Set the first Windows to your actual user folder Then in the other File Explorer window, locate the files you want to move and drag those into the correct library folder inside your library folder in the other windowDoes Windows allow you to do that? Hi Dave,No, I did not manually create the folders.  There are seven of them:  Judy Burmeister, Judy, Public, Default, DefaultAppPool, LogMeInRemoteUser, and Default.migrated.I opened the two file explorer windows but just got a list of recent openings and saw no way to set them to a User folder.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I think the simplest way to resolve this would be to pick which of the duplicate users you wish to keep and then manually copy the files each of the duplicate folders into the one you wish to keep.Under each user folder you will have Desktop\/Documents\/Pictures, etc. So just copy these into each of the corresponding folders.Once you have done that you will be able to delete the user from the settings app.Regards, Ross"]},{"symptom":"Problem- auto self shutting down and restart auto there after        My pc has problem... go to start up it with power on button and go 3-sec and auto restart repeatedly Before this when was going to startup when entered Windows auto restart repeatedly May power button has problem or... UPS slot Problem... connect to other slot?Currently when room is hot from heater... the PC ... not shutdown and restart auto self And may go even hour and after be problematic...Where you think is the problem???","solutions":["Hi Leonidas, this behavior may have hardware roots. please check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors and events with description of reboot reasons. DistributedCOM errors should be ignored."]},{"symptom":"block sexual emails        How do I block email with sexual content?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.You best bet for any type of unwanted\/spam emails to to right click each of these and mark as junk. If you keep doing this your email provider will be updated with this information and attempt to block future email from that sender, or content of that nature.Regards, Ross","Thanks Ross. { was at a loss. Am \"computerly challaged\"."]},{"symptom":"Protection history Crash        I scanned a pen-drive which had many folders infected by worm i.e all folders were in the form of .scr file. I scanned using windows defender and accidently I took the action and the folders infected were removed. So I thought to restore the folders. But as soon as I click the protection history button then the windows defender crashes. Please check the issue?Also please tell me how to restore files which is removed by defender with the status: remove?\"\"\"Windows Defender Antivirus has taken action to protect this machine from malware or other potentially unwanted software. For more information please see the following:https:\/\/go.microsoft.com\/fwlink\/?linkid=37020&name=Worm:Win32\/Lightmoon.H&threatid=2147619539&enterprise=0     Name: Worm:Win32\/Lightmoon.H     Severity: Severe     Category: Worm     Path: file:_F:\\20191207-HK Civil core & shell Tender                                   .scr; file:_F:\\Adhiraj                                   .scr; file:_F:\\B Plot Infra-Sachin Sir                                   .scr; file:_F:\\B Plot-Infra                                   .scr; file:_F:\\Documents scanned                                   .scr;              Detection Origin: Local machine     Detection Type: Concrete     Detection Source: User     Process Name: Unknown     Action: Remove     Action Status:  No additional actions required     Error Code: 0x00000000     Error description: The operation completed successfully. \"\"\"","solutions":["Hello SMARTBOIADI, I am Andrew an independent advisor. If you told Defender to delete the files they have been erased, you cannot recover them without expensive data recovery software.To fix Defender crashing you can open Settings, go to Apps and look for Defender. When you find it right click and choose to repair the software.Andrew","I solved the issue. I recover the data through cmd using attrib command. Though the defender deleted the files, pendrive was still showing storage filled i.e may be the files were hidden due to trojan.I cannot find defender in Apps","I'm happy to hear you've gotten the files back on the USB. Another way to reset Defender involves the Services menu and reset the whole Security service. To do this:Type services.msc in to the search bar Find the SECURITY CENTRE in the list Right click it and choose RESET Reboot your computer. Once done this should help Defender work properly again. Take Care, Andrew"]},{"symptom":"Transferring windows from 1 drive to another        Hello,I have recently bought a Samsung 860 evo (500gb) and I wanted to know if i could transfer windows and all its files to the Samsung 860 evo from my current 250gb ssd, without having to buy a new windows license. Thank you for your help!","solutions":["If you are going to put it in the same computer you do not need a new license.The best way to make the change is to Clone the old drive onto the new drive and use the old drive as a backup.There a number of programs to clone drives.  I used EaseUS Todo Backup which you can get free.","Hi Nyan, sure you may transfer Windows from one drive to another using same license. You need just to remove Windows from first drive after transfer.","Hi Nyan, sure you may transfer Windows from one drive to another using same license. You need just to remove Windows from first drive after transfer.When trying to copy and paste the files into the new drive. on some files it says cant transfer file because its in use by windows and when going to the bios and trying to boot to the drive it doesnt work. i also havent wiped the other drive yet ","Direct copying should not work. Please use special programs for disk cloning, e.g. from Terabyte Unlimited or Macrium.","You can also use an image copy backup tool to make a full image backup copy of your current Windows drive.Restore that image on the new drive.Then change the \"boot partition\"https:\/\/www.disk-partition.com\/windows-10\/move-boot-partition-windows-10.html ORJust install the second SSD as a D: drive. Keep the original as the Windows and applications drive. Redirect all of your user files, including the Window USER folders to the new D: drive256GB is more than adequate for Windows and pretty much any applications you want to install. By separating your personal files from Windows and applications installations you can more easily re-isntall Windows, without having to worry about your data files getting wiped. I've done something similar on my machine. It came with dual drives, 128GB SSD and 1TB HD (I'll eventually replace the HD with a SSD when I have the money)."]},{"symptom":"the browse not working .        sir,I am officially microsoft license user and using window 7 professional since last some years, while working on pc and want to download some formatts from pc, the msg coming that your browse limits ends on 14.0.2020, what will be a solution for this?with regards, D.B.PawarIndia, Maharashtra, Talegaon Dabhade P. co 410506","solutions":["sir,I am officially microsoft license user and using window 7 professional since last some years, while working on pc and want to download some formatts from pc, the msg coming that your browse limits ends on 14.0.2020, what will be a solution for this?with regards, D.B.PawarIndia, Maharashtra, Talegaon Dabhade P. co 410506We don't work for Microsoft and Microsoft does not look at these Windows 7 forums. Microsoft ends support for the Windows 7 operating system on the 14th on this month..Keep using 7 or upgrade.If you're looking for information for home users, see Windows 7 support will end on January 14, 2020.With end of support Microsoft is not telling you that your operating systems won't work.What they are saying is that after a certain date they will no longer support them.Whether they still work or not with particular programs is up to the particular program manufacturers.Example: Google Chrome is no longer supported for security updates in XP or Vista by Google and Mozilla Firefox is following the same path.What this basically means with Microsoft no longer supporting an operating system is that even though hackers may find \"holes\" and vulnerabilities to be able to access the operating systems and cause security problems, Microsoft will no longer be monitoring or rectifying those problems by way of Security Updates each month.You are on your own in regards to maintaining the Security of your operating systems.What does it mean if Windows isn't supported?____________________________________________________This will show you when support (Mainstream and Extended Support) for the various operating systems ends.Windows lifecycle fact sheet - Windows Help - Microsoft SupportAnd these FAQs show you how Microsoft arrived at the Support Lifecycle Policy:Microsoft Lifecycle Policy FAQhttps:\/\/support.microsoft.com\/en-au\/help\/17140\/lifecycle-faq-general-policy-questions@@@@@@@@@@@@@@@@@@@@@@@It depends on the hardware requirements of later operating systems and also whether the computer\/laptop manufacturer supports and supplies drivers for the later operating systems as to whether it is possible or feasible to upgrade or not.Windows 8 is no longer supported.@@@@@@@@@@@@@@@@@@@@@@@@Follow these steps before you buy  Windows 8.1; extended support ends January 10, 2023 .Check to see if your Computer\/Laptop Manufacturer has Windows 8.1 Drivers available for your Model.If not available, Windows 8.1 will not install and work correctly for you.\"Windows 8.1 system requirements\"http:\/\/windows.microsoft.com\/en-us\/windows-8\/system-requirementsWindows 8\/8.1 does not come for free; you have to buy itMicrosoft no longer sells 8\/8.1.Try amazon.com, etc.Warning:You do not buy a Product Key by itself, as they are normally stolen\/pirated, Volume Licenses which are not for private use, or MSDN keys which are not to be sold by the original subscription holder.Make sure that you buy the complete sealed package (DVD, license)https:\/\/www.microsoft.com\/en-us\/howtotell\/Shop.aspxRead Section: Beware of Product Keys sold separately.@@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700"]},{"symptom":"Need help with gaming on the pc        Will i lose my progress on the games i have if i switch to another account?","solutions":["Hi Josh, my name is Jay. I'm an independent advisor. I'd be happy to help with your inquiry.I regret to inform you that Game Data and purchases can't be transferred between Microsoft accounts. I hope this helps, thank you.Regards, Jay"]},{"symptom":"error code 0x1900101        Windows 10 version 1903 update keep getting error code 0x1900101","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)"]},{"symptom":"Photos app keeps getting stuck on the screen \"looking for new photos and videos\"        When I go to import photos to my computer from my iPhone, it gets stuck on the screen the says \"looking for new photos and videos\".  It says that it has found over 5000 photos\/videos, but it just give me any option to import.","solutions":["Hi BethBinks, Let's try resetting the photo app. GO to Start > type in Apps and features > click the apps and features icon Scroll down to Microsoft Photos Click Microsoft Photos Click Advanced options Scroll down and click Reset Then click Repair Then restart and try again Let me know if this works.","Ive tried those things and they did not work. ","Hello, I am Arif Ahmed, Windows Advisor. I would be happy to help you. You have already reset the Photos app, hence I would suggest you to Reinstall the App and check if it imports the images.Please perform the following steps to Reinstall Photos app. Please Run PowerShell as Administrator. Enter the following command: Get-AppxPackage *photos* | Remove-AppxPackage Restart the PC. Go to Store > Search for Photos app and download it.","I followed those instructions and it still won't let me import pictures.","Hi BethBinks My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try the older File Explorer method to import your photos: https:\/\/www.kapilarya.com\/how-to-import-ipad-ip...Disclaimer: Included link in this reply refers to blog post by a trusted Microsoft MVP.Hope this helps."]},{"symptom":"windows 10 will expre soon mesage        activation status is \"windows is activated using your organization activation service\"","solutions":["Hi Michel, for home computer this message says the activation and possibly installation were made illegally. This could do unfair seller, technician or any other person during computer repairing. Please, ask PC manufacturer whether it preinstalled Windows on this device. And if you don't have a license you need to buy one.","This means that your Windows license was intended for business use. It has to connect to a specific server periodically to validate the Windows license..As Igor says, you have to talk to the person you bought the computer from to get a legal Office license. Otherwise you are going to have to pay US$200 to buy a copy of Windows 10 Home.In the Start menu, Search for \"System Information\" In the System summary, OS Name you will see something like \"Windows 10 Enterprise\" instead of \"Windows 10 Home\""]},{"symptom":"Crashing while Gaming        Computer keeps crashing randomly while playing League of Legends\/TFT. Doesn't appear to happen during any other activity. Memory was tested and passed. Pretty sure it's a driver problem but I can't pinpoint where and this problem is driving me nuts. Please see post here for steps taken so far: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/frequent-crashes-while-gaming\/a802a538-9a3f-4bf8-9af3-ac68122dbe83 See folder here for all minidumps: https:\/\/drive.google.com\/drive\/u\/0\/folders\/1Xmrs3ImrrVmtF0_LaLbfH0kxWtuCSUI5","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Did you try Reinstalling the game?","Multiple times, it's not the game. Please look into the minidumps and help me identify which driver is causing BSODs.","There are multiple drivers affected. I suggest you to kindly download and install the Graphics Driver from the Manufacturer website.Also, I suggest you to Restore the PC to an earlier time when it was working properly.","I have done multiple reinstalls of graphics drivers. There's no point in restoring because this has been a problem for a very long time. I don't know of a working restore point.","Hello Keiuran, I am Andrew and wish to offer another option. If you're unsure which driver is causing the issue then I suggest making sure they are all updated by the manufacturer.If you dont want to go 1 by 1 another option is to reset the PC to its original state. As in when you first got it. This option will allow you to keep all personal files, anything installed by you will be taken out. To do this please followSelect Start > Settings > Update & Security > Recovery > Reset this PCTake Care,Andrew"]},{"symptom":"protection update        get error code:  2145124348 when trying to update protection definition.help?","solutions":["Hi,My name is Gary an independent advisor and I would be happy to help you out with your concern,Open cmd by searching \"cmd\" on the start menu, make sure to run it as administratorExecute this command on the command promptDISM \/Online \/Cleanup-Image \/RestoreHealthRun these commands on the command prompt to restart windows update servicesnet stop bitsnet stop cryptsvcnet stop wuauservnet stop msiserverRen C:\\Windows\\SoftwareDistribution SoftwareDistribution.oldRen C:\\Windows\\System32\\catroot2 Catroot2.old net start bitsnet start cryptsvcnet start wuauservnet start msiserverAfter successfully executing the commands, I would suggest performing a clean boot to disable third party background services that may be interrupting with the windows update services1. Go to start menu\/search msconfig2. On the system configuration window go to the services tab3. Tick on hide all microsoft service so that this won't be affected4. Choose to disable all services5. Next, go to the startup tab and on the window choose to open task manager6. Choose to disable each applications from starting up when computer is booting up7. Close task manager and hit apply then ok8. A prompt to restart the computer will show up, choose to restartThis should restart the computer with minimal third party services starting up right after windows boots up. Once the system boots up. After this, try to update again.In the event that it still fails, I would suggest performing an in-place upgrade, this process overrides the system files which would fix corruptions or damages within the system files\/packages while updating the system to the latest version of windows 10.To perform an in-place upgrade, 1. Open this link https:\/\/www.microsoft.com\/en-us\/software-downlo...2. Select Download tool, and select Run. You need to be an administrator to run this tool.3. On the License terms page, if you accept the license terms, select Accept.4. On the What do you want to do? page, select Upgrade this PC now, and then select Next.5. After downloading and installing, the tool will walk you through how to set up Windows 10 on your PC.6. When Windows 10 is ready to install, you'll have an option to keep your personal files and apps, keep personal files, or to keep nothing during the upgrade7. The process would take a while and may consist of multiple reboots. Make sure that there won't be interruption within the process to make sure that everything would sort everything outLet me know how it goes. :)","get error code:  2145124348 when trying to update protection definition.help?Hello,Try to download latest Windows Defender update definitions manually:https:\/\/www.microsoft.com\/en-us\/wdsi\/definitionsLet us know if this helps!"]},{"symptom":"Cortana disappears before I can ask a question        Cortana pops up but disappears before I can ask a question. Can I lock it onto my screen?","solutions":["Hi Gwen. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First make sure Cortana is set up right as shown here: https:\/\/www.windowscentral.com\/how-setup-and-us...http:\/\/www.thewindowsclub.com\/set-up-cortana-in...https:\/\/blogs.windows.com\/windowsexperience\/201...Then troubleshoot if necessary using these guides which are working for others: https:\/\/www.lifewire.com\/fix-cortana-4151935https:\/\/support.microsoft.com\/en-us\/help\/12385\/...https:\/\/www.kapilarya.com\/how-to-reset-cortana-...Usually one of those will do it. If not then there may be problems with your WIndows install. Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. Update your drivers from the PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version 1903 which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Cortana pops up but disappears before I can ask a question. Can I lock it onto my screen?Hello,Try re-registering Cortana. Perform these steps:1. Open Windows PowerShell as administrator.2. Then type following command and press Enter key:Get-AppXPackage -Name Microsoft.Windows.Cortana | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Let the command complete.3. Close Windows PowerShell and see if the issue is resolved now.Reference: https:\/\/www.kapilarya.com\/how-to-reinstall-or-re-register-cortana-in-windows-10Let us know if this helps! Note: Included link in this reply refers to blog post by a trusted Microsoft MVP."]},{"symptom":"Swipe on multiple posts in Instagram for Windows 10        I have Instagram for PC on my laptop but I'm unable to swipe on multiple posts. I see the blue dots and the layered symbol but no amount of clicking or hovering seems to do anything. I have already tried reinstalling it and can find nothing on the internet about where to go with this. Any advice would be greatly appreciated.***Post moved by the moderator to the appropriate forum category.******Subject edited for clarity by the moderator.***","solutions":["Hi,Only certain features of the app are supported and available on other devices running Windows 10. It's one of the possible reasons why you're unable to swipe on multiple posts. We'd like to confirm if you are referring to the highlighted blue dots on this picture.If so, please be reminded that clicking on it to view the next post is not yet available when you're using a Windows 10 computer or laptop. Regarding your query, we suggest contacting the app developer. This way, they might consider adding this feature or functionality on their next update. Let us know if you have further questions."]},{"symptom":"Internet connection        Desktop and laptop both running same version of Win10 will not connect to some sites, but not the same ones. i.e. desktop will not connect to my email but the laptop will, the laptop will not to sites that the desktop will connect to","solutions":["Hi Frank! I'm Steve, an Independent Advisor and a Windows user like you. I'm happy to help with your query.That sounds quite frustrating. What's the error you're getting when your desktop or laptop won't load a website and is the same error on both all the time?Also which web browser are you using when you get the error and do you get the same error if you go to the same website using a different browser (e.g. Edge \/ Chrome)?","The error messages are as follows:Desktop using FirefoxSecure Connection FailedAn error occurred during a connection to my.bt.com. PR_END_OF_FILE_ERROR    The page you are trying to view cannot be shown because the authenticity of the received data could not be verified.    Please contact the website owners to inform them of this problem.Desktop using EdgeHmmm... cannot reach this pageTry thisMake sure that you’ve got the right web address: https:\/\/signin1.bt.comSearch for \"https:\/\/signin1.bt.com\" on BingRefresh the pageCannot securely connect to this pageThis might be because the site uses outdated or unsafe TLS security settings. If this keeps happening, try contacting the website’s owner.Your TLS security settings aren’t set to the defaults, which could also be causing this error.Try this:This site connects properly using my laptopLaptop error messages are (Using Firefox, Chrome and Edge)Hmmm... cannot reach this pageTry thisMake sure that you’ve got the right web address:(web address)Search for \"https:\/\/ on BingRefresh the pageThese sites connect on the DesktopFrank","Hi Frank, It seems that your desktop and laptop may be experiencing different issues but in both cases the result is that certain web pages fail to load.For your desktop I would recommend to try 'Solution 1' in the following article to change the TLS settings for your web browsers:https:\/\/appuals.com\/how-to-fix-cant-connect-sec... For your laptop I would recommend to try the following steps to clear its DNS cache:Open Start > type 'cmd' and open command prompt > in the cmd window type 'ipconfig \/flushdns' (without the quote marks) > restart your laptop and try loading the website again.Please let me know how you get on. Steve ____________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi SteveThe solution for the laptop seems to have worked, however the desktop problem is still apparent, I believe that I've tried the suggested desktop fix before.Frank","Hello Frank, I am Andrew. I want to suggest you flush your DNS on both computers as it worked for your laptop."]},{"symptom":"Windows Mail setup for Verizon (now AOL) account        I just got a new PC with Windows 10, and for some reason cannot get the Windows Mail app to sync with my Verizon \/ AOL email account.   (Verizon email was bought by AOL some time back; email address and server settings are still Verizon though).    I'm using all the same settings as my previous PC (Windows Live Mail) as well as several other devices (phones).   So I know the settings are correct, however the Mail client will not sync (retrieve email to Inbox).   Help please!Using:Incoming email server pop3.verizon.net:995Outgoing email server smtp.verizon.net:465Authentication on both incoming and outgoingOutgoing is POP3 serverThanks","solutions":["Hi Jas. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See here how to add a Verizon AOL Account to Windows 10 Mail: https:\/\/help.aol.com\/articles\/how-do-i-set-up-o...Keep me posted on your progress as I will be here to help until the case is resolved.","Thanks, but I have tried all that, and it does not seem to work.   Is there any way to diagnose what's going on under the hood (e.g. error code), short of using something like Wireshark?One thing to note is - Microsoft appears to have incorrect information or the POP and SMTP settings for AOL for the Verizon.net domain*.   These subscribers (including me) still use the pop.verizon.net and smtp.verizon.net addresses.  The aol.com addresses do not work for me; if I try to use these anywhere (e.g. on my phone, or old PC) they fail, and when I change then back to verizon.net they work again.(*referring to: https:\/\/support.office.com\/en-us\/article\/pop-and-imap-email-settings-for-outlook-8361e398-8af4-4e97-b147-6c6c4ac95353)Perhaps this is related to my problem?   I notice that when I first try to set up my Mail account, that it defaults to the aol.com addresses, based on my verizon.net email address.   I can change the outgoing and incoming server settings, to verizon.net, but it still doesn't work.   Perhaps the Email app is overriding my changed settings with its assumption (incorrect) that all verizon.net email addresses must use aol.com?Edit to add:Two new things:I see from dnschecker.org that pop.verizon.net and pop.aol.com both have two associated IP addresses, and they are the same.  (74.6.137.86 and 66.218.85.35)    So either should work theoretically; however in practice this seems to not be the case, since verizon.net is the only one that works on my devices.I did install Wireshark and run it.    When I look at the trace I do see it contacting pop.verizon.net at 66.218.85.35 and communicating with it.   Hard to tell what's going on though.Edit 2:Outgoing email does work.  I am able to send email from the Mail client successfully, and verify on other account (gmail) that it went through.   Only incoming is not working.Edit 3: One other thought \/ question.   I don't see any option in the client for when the emails on the server are to be deleted.  E.g. in Windows Live Mail has a \"Leave a copy of messages on server\" checkbox, and if that is checked there is a \"Remove from the server after NN days\" setting.   The lack of these settings in the Mail app makes me think there is a different sync mechanism in this app, and I'm wondering if this sync mechanism is what's blocking me from retrieving emails.  (?)  ","This reminds me of how Yahoo accounts get hijacked by ATT. After going through a year of trying to liberate my parent's Yahoo account from ATT they haven't had for years, I would recommend anyone who finds themselves in this situation not waste the hours I have trying sort it out with Support Levels 1-2-3 but instead simply start a perfect new Gmail, Outlook or Yahoo account to free yourself. Easily add it to Windows 10 Mail, transfer contacts into the new account,  forward your old mail to the new account and notify contacts - all easily searchable how-to via google. Otherwise I cannot assure you that it will ever end, only drive you crazy in a New Year you could instead liberate yourself from them.","Well that's not really helpful.   This *should* be an easy thing.   Email clients that use POP have been around for decades, of course, this isn't new.   Forwarding emails to another account isn't really a useful solution, since that breaks the \"reply\" functionality that you can't really live without.   We have probably hundreds of contacts that use this email address.","There is a solution reported here in Verizon forums to try: https:\/\/forums.verizon.com\/t5\/Verizon-net-Email...I also found this guide for problems with AOL mail: https:\/\/help.aol.com\/articles\/why-cant-i-access...","There is a solution reported here in Verizon forums to try: https:\/\/forums.verizon.com\/t5\/Verizon-net-Email...I also found this guide for problems with AOL mail: https:\/\/help.aol.com\/articles\/why-cant-i-access...Thanks.   I had seen that second link, but not the first.   Unfortunately that didn't help any - it still doesn't retrieve it whether the \"allow apps that use less secure login\" item is selected or not.   It appears that option is being removed in two months anyway; as a matter of fact in my case it was already set to \"less secure\"; I tried changing it to \"more secure\" and the option now no longer even shows up.   In fact that actually broke all my other email clients!   Argh.","Did you try IMAP Settings here: https:\/\/help.aol.com\/articles\/verizon-move-to-a...","Indeed yes I tried that.The Microsoft Mail app actually doesn't even ask for IMAP vs POP when the account is first created - it only prompts for email address, name, and password, and gives just the option to \"sign in\" or \"cancel\".   Then after clicking \"sign in\", it says \"All done! Your account was set up successfully\", but then about 5 seconds later a message pops up \"Your Verizon account settings are out-of-date\".    Then when I go to look in my still-empty Inbox, a yellow banner pops up across the top of the Mail screen \"We couldn't access this account: Verizon.  You might need to update your password or give the account permission to sync to this device\".   I'm 100% sure the password is correct.    (I can get using webmail just fine)Only then does it give me the option to change the server settings.   I guess the Mail app assumes a set of default server settings based on the email address that's input (?)Interestingly - it appears that just today the default settings have changed for verizon.net accounts.   Yesterday the default was: - pop.aol.com for incoming - smtp.aol.com for outgoingToday it is now: - imap.mail.yahoo.com for incoming - smtp.mail.yahoo.com for outgoingThough it doesn't seem to matter what server addresses I use - none of them work.Thanks for your help, by the way - it is appreciated.","Hi jagstock My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try the following settingsIncoming Mail Server: imap.aol.com(Use port 143 for standard or 993 for SSL connections).SMTP Outgoing Server Address: smtp.aol.com.Set the port to 587.Hope this helps.","OK so here's an update.I did try the settings you mention JonBland - still did not work.   (I had tried them several times before, but tried again just to make sure).    One thing that's confusing in the MS Mail app is how\/where to enter the port number.   All the other apps I've seen have an explicit port entry field for that, but not MS Mail - all it has is a server field, and it appears you're supposed to use a colon to add the port number after the server name (right?).   E.g. I'm doing this for my attempts:Still not working though.I think the problem is this - AOL apparently has some uniqueness to the way they do IMAP protocol, that has to be accounted for in the email client.   Other email clients support this, but it appears MS Mail does not.I was able to get this working on Android, and iOS.   In both of those cases when setting up an email account on the client, there is an explicit entry for AOL.Android:iOS:However MS Mail has no such entry for AOL:Instead you have to use the generic \"Other account\" account type, but that's not working.  (I did try Yahoo, since I know there's some affiliation with AOL, but that didn't work either)I'd love to be able to get this working on my Windows 10 PC, but have yet to figure out a way to do it.   FWIW I'm trying other email clients, e.g. Thunderbird, but not able to get it working there yet either.   I'd like to be able to use MS Mail if possible still.Thanks."]}]}