{"windows":[{"symptom":"Windows 10: Won't recognize me as administrator.        Hello all:  When installing or deleting some programs, I'm told I need to have administrative privileges.  However I'm the only user on my computer with a single account and I'm listed as administrator.  Can anyone tell me what the problem is and how to fix it?  Any help would be greatly appreciated.  Thank you. ","solutions":["Hi,Thank you for posting your query in Microsoft Community.I'm sorry to hear that.  I can imagine that must be frustrating.I would suggest you to try enabling the built in administrator account by following the steps below and check if the issue persists.1. Type CMD in the search bar.2. Right click on command prompt and run it as administrator\/3. Type the following command and press enter: user administrator \/active:yes4. Check if you are able to delete or install the programs.5. Once you are done, enter the command in the command prompt to disable the built in account: user administrator \/active:noLet us know the result.","This might help, it didn't for me as my computer management didn't have the Groups and Users tab, so I'm a bit stuck, but it might help you Re-enable a Windows 7 Administrator accountIf you updated from Windows 7 and created a new Microsoft account when you moved, your files may be stuck in a disabled administrator account. Reenable the account and log back in to see them.In the search box, type computer management and select the Computer management app.In the left pane, expand Local Users and Groups, then open the Users folder. If the user named Administrator has a down arrow on its icon , it’s been disabled.To enable this account, double-click the Administrator icon to open the Properties dialog box. Clear the Account is disabled tick box, then select Apply to enable the account.Now log out and log back in using the Administrator account.","Groolster,Please explain what symptoms make you say that \"Won't recognize me as administrator\".If you mean that you get a prompt to confirm admin permission to do some tasks, such as installations, then that is not necessarily faulty behaviour. If this prompt requires you to click on a Yes button then the computer recognises you as an Admin account. If this prompt requires you to enter a password then the computer does not recognise you as an Admin account. Please explain what happens in your case.","I'd like to thank everyone for the quick responses, I wasn't expecting that.  After hours of googling and not finding anything that worked, I finally found a fix on Reddit (right after posting here) that seems to have worked so far.  It involved this:Open up registry editor and go here:HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Policies\\SystemChange EnableLUA to 0Restart computer.This seems to have solved the problem, but I'm filing away your suggestions in case it happens again because I don't like messing with the registry unless it's absolutely necessary.Thanks again for all the help.  I really appreciate it.","Hi,Thank you for letting us know that you are no longer facing the issue. We appreciate your effort and for sharing the information with us. Hope this helps other community members facing a similar issue.If you have any Windows related queries in the future, let us know. We will be glad to help.","You did not need to edit the Registry directly.  The step you have taken can also be done through the user interface.By switching off \"User Account Control\" [UAC] you have allowed anybody who manages to access your computer to install whatever they like on your computer without any indication being shown to you. You ought not to connect your computer to the internet in its present condition.  If you are going to do so anyway then I would urge you not to connect to online banking or to keep any valuable information on your computer such as bank account numbers or passwords.  Everything on your computer is now vulnerable.","Thanks for the heads-up.  I undid that, and unfortunately I'm back where I started.  I get a message saying \"You don't have permission to save in this location.  Contact the administrator to obtain permission.\"  It then asks if I want to save to another location.  So I do have to press \"yes\" or \"no\", but it doesn't sound like it recognizes me as the administrator.  Nothing I've tried from any source, including this thread, has helped, though I certainly appreciate the effort.  The only thing that solved it was remedy I mentioned, but as you pointed out, that isn't a very good fix.  Thanks again.","Without knowing what location you are talking about, I cannot comment.  Windows does protect several locations on the computer but they are ones that you would not want to save to anyway. - - - - - - - - - - - - - - - - - -You started off saying that you had a dialog interrupting you when you un\/installed applications:- If you mean that you get a prompt to confirm admin permission to do some tasks, such as installations, then that is not necessarily faulty behaviour. If this prompt requires you to click on a Yes button then the computer recognises you as an Admin account. If this prompt requires you to enter a password then the computer does not recognise you as an Admin account. Please explain what happens in your case.","I am having the same issue.  I just purchased a window 10 HP and my husband set up the computer for me in his account.  He then changed me to an admin but the only way I can install or uninstall any program is to be in his account.  NOT very convenient. I get the same pop up that just states that I have do not have permission to make changes.  There is no prompt to add password or pin. I am listed as an admin in the user accounts.  I tried to change the issue using the command prompt.  I am typing (without the quotes) \"user administrator \/active:yes\" and only getting the reply 'user' is not recognized as an internal or external command, operable program or batch file.   I have tried multiple different variations.  Am I doing something wrong?  Or is this for a previous version of Windows?   Not loving my Windows 10 experience so far.","1  \"I get the same pop up that just states that I have do not have permission to make changes\" - please would you use Snipping tool to post a diagram of that popup here so the situation can be understood.2  Does your user account's entry state that you have Admin-level authority?Right-click on the Start button,Control panel,[View by - Small icons, if necessary],User accounts3  \"I tried to change the issue using the command prompt\" - the response you are getting is understood.  That response appears unless the Command prompt is run as Admin."]},{"symptom":"Error 0x80073CF1 in Forza        I can't download Forza Horizon 4 Ultimate. I see the message \"error 0x80073CF1\". What to do?[Original Title: 0x80073CF1]","solutions":["Are you facing this issue with other applications?Try restart your PC and try again.","Hello Awokadooo, I am Andrew an independent advisor. I want to try to help you with the issue you're having. This particular error can come from a missing update or an issue with the Microsoft Store.To start can you type troubleshoot in the search bar and locate the store troubleshooter. Let it run to find any issues. Once done manually search for any Windows Updates via Settings > Update and Security.Do both these and try downloading the game again. If it persists enter Settings>Apps, find the Microsoft Store, click it and choose to REPAIR the app. Reboot and should be set.If if continues after all this please come back and let us know. Take Care, Andrew"]},{"symptom":"Sticky Notes separated on Taskbar        I just installed the new May 2019 update and it seems that Sticky Notes now are separated on the taskbar if you have multiple open which I am not a fan of. Is there a way to make them all grouped back together in one tab? If not, can we make that available for a future update?","solutions":["Hi Dark, you can combine the taskbar icons right click on the taskbar and select taskbar settings under \"combine taskbar icons\" select \"always hide labels\" please let me know if you experience any issues","That will affect EVERYTHING and I don't like all my tabs to be grouped into one. However, in the case of sticky notes, it was WAY more convenient for taskbar space when they were all under one tab and would like a way to go back to that for JUST that app if possible.","i'm sorry, I don't know of a way of doing it only for sticky notes, other than only opening the notes list.you can make the suggestion to the developers using the feedback hub (winkey+F) or in sticky notes settings -> share feedback.","i'm sorry, I don't know of a way of doing it only for sticky notes, other than only opening the notes list.you can make the suggestion to the developers using the feedback hub (winkey+F) or in sticky notes settings -> share feedback. So why did it work the way we want BEFORE the recent Win 10 1903 update?Previously, I did not have apps combined on the task bar, but Sticky Notes combined automatically - they are unusable as sticky notes if they just stuff up the taskbar","I'm having the same issue. I used to have only one Sticky Notes tab in my taskbar for all notes. Now I have to click 10+ times to open each note because I need to see them all every time. It's frustrating.","Completely agree here with you it is frustrating on the one hand. An even worse side effect for me is that you cannot \"exit\" the complete Sticky Notes application. Instead you close each note and when you reopen the app again only one note would open, the last one you closed.","The update was installed here on Monday and, although all the notes were combined into one taskbar icon, the taskbar wouldn't auto-hide as long as the Sticky Note app was open.   When I hovered over the icon, I got an endless ladder of Sticky Note window titles with no direct way to get to the index.I fiddled around a bit last night, terminated the app and rebooted to find that my taskbar was auto-hiding properly without Sticky Notes there.   When I re-started the Sticky Note app this morning, my heart stopped because I only had one note displayed.  A right-click on the icon and selecting \"Notes List\" brought up the complete list with only one note (seems to be the last note used) actually on the desktop.   This isn't as convenient as being able to leave them stuck in various locations on the desktop but it's much better than what I was living with for the past week.Now if only I could get the notes stop resizing into giant pages....","An even worse side effect for me is that you cannot \"exit\" the complete Sticky Notes application.Open Start > Settings > Apps > Apps & features Scroll down to Sticky Notes Select it Click Advanced options Chose Terminate or Reset.The original Windows XP version was simple and reliable.  The Windows 10 version has been as buggy as hell from day one.","I'm having the same issue. I used to have only one Sticky Notes tab in my taskbar for all notes. Now I have to click 10+ times to open each note because I need to see them all every time. It's frustrating.Yep, it's moronic. I need to find another app now to use for my notes.","I am in the same boat here. I can't use this app now because I need all the notes on the screen at once. If anyone has a fix or an alternative app, please let me know.Unfortunately, because I am using a work computer I cant do the powershell reverse, otherwise I would.It's driving me CRAZY!Thanks in advance! :)"]},{"symptom":"Laptop keyboard disabled        New Lenovo laptop keyboard disabled after initial windows 10 update","solutions":["Hello ZbigniewDrozdowicz, I am Andrew an independent advisor. Sorry to hear of your problem, perhaps a driver issue caused the problem. Can you right click your start menu and open Device Manager.In there find the Keyboard device, right click it and uninstall the device. Once uninstalled restart your computer, it will then try to reinstall the driver when it boots again. Choose to automatically find the best driver.This should fix your issue. Take Care, Andrew"]},{"symptom":"Camera access history log        Hi, where or how can I see history or log of apps that accessed camera in win10 ?","solutions":["Hi Stefan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.There's no log but you can see which apps are being allowed to access the camera here:https:\/\/www.howtogeek.com\/424862\/how-to-see-whi...Also more about ways Microsoft provides to restrict the camera here: https:\/\/support.microsoft.com\/en-us\/help\/446823...I hope this helps. Feel free to ask back any questions and keep me posted. If you will wait to choose if I solved your problem, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Hi Stefan,Not all - but a partial list of the app having last accessed the camera is in the Privacy Settings."]},{"symptom":"Calendar        Calendar is not in the apps list.  How do I reinstate it","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.1. Launch Microsoft Store. 2. Search for \"Mail and Calendar\". 3. Click Get for it to be installed. Please let me know if I can help you further!"]},{"symptom":"Visual C++ 2015-2019 Redistributable (x86) - 14.23        pathC:IProgramDatalPackageCacheVBBF2AC74-720C-3C83-8291-5F34039232FAV14 0 24215packageslycRuntimeMinimum x86vc runtimeMinimum x86.msi cannot be found. Verify that you have access to this location and try aqain, or try to find the installation package vc runtimelinimum x86.msi' in a folder from which you can install the product Microsoft Visual C++ 2015 x86 Minimum Runtime14.0.24215.","solutions":["Hello, I am Andrew an independent advisor. I assume you are getting this error through a program that needs C++ installed. Please follow this link to download the correct version.https:\/\/support.microsoft.com\/help\/2977003\/the-...Take Care, Andrew"]},{"symptom":"Windows 10 Update        After updating Windows 10 to \"Feature Update Windows 10 Version 1909\" on my PC after logging in following update completion the screen goes off then on and I cannot do anything. I have reverted back to the previous version of Windows 10 and this all works ok. Any ideas?","solutions":["Hello StuartFildes, I am Andrew an independent advisor. When you upgraded to 1909 did you do it through Windows Update or via the media creation tool?There is far less issues if its done through the media creation tool, if you did not do it this way I recommend this method. You can quickly find the tool here, just download it, run and choose to update you systemhttps:\/\/www.microsoft.com\/en-ca\/software-downlo...Take Care, Andrew","Thanks Andrew I will try that and will let you know how it goes.Stuart","Hi Andrew, sadly I got the same problem updating through the media creation tool so had to uninstall it again. Do you have any further suggestions.ThanksStuart","Hi Stuart. Sorry to hear it still didn't work. It seems now maybe there is a compatibility issue with your system. As it's been done more than once and more than 1 way I think that's the issue. Report the issue through the feedback app. Just type FEEDBACK in to the search bar. Be sure to leave your system make and model. Somebody can then look in to the issue.Take Care Stuart, Andrew","Thanks Andrew I will give that a go. Your help is much appreciated. Stuart"]},{"symptom":"Forza horizon 4 not installing        I bought forza horizon 4 and it confirms that i bought it on the microsoft store but there is no way to install the game. I tried to install it to both the options it gave me and neither of them worked and microsoft help tells me to copy the game but there is no way to copy the game and then install it.","solutions":["Hi my name is Jay, I'm an independent advisor. I'd be happy to help with your issue.Please try to reset Microsoft Store by following the instructions from this article:https:\/\/winaero.com\/blog\/reset-windows-store-wi...I hope this helps, please feel free to ask questions and keep me on track. I will keep working on this issue until it's resolved, thank you.Regards, Jay ______________________________________________________ Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thanks for the help I have it installed now"]},{"symptom":"Snip & Sketch with transparent background        Is it possible to take an custom screenshot ho could have transparent background? I mean that white borders, if not can someone tell me an program with this feature?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.I believe the best way to do this would be to take the screenshot and then file the white background as transparent using image editing software.There is actually a free online tool to do this: https:\/\/www9.lunapic.com\/editor\/?action=transpa...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Thank you very much for the help!","With Windows Paint 3D you can have a transparent background."]},{"symptom":"<SOLVED..kinda>window 7 cannot recognize my USB PnP audio device        i have usb audio card, i use it because my pc sound card is corruptedAt first it worked very well, i can hear stuffs, (i use a head phone to plug in the usb sound card)And then i'm play a game that my pc can't handle,then it's crashesI push the reset button to restart my computer, i computer works normal but after a while, i realize there's no soundi go to device manager to see if i plugged in the sound card correctly, but the device was labeled unknown devicei tried to plug it to another port, it's still be that wayi also tried it on another computer, it's work finei also unplug the pc from it's power source to power of the mainboardbut, still, it's still labeled unknown devicecan somebody help meEDIT: i solved it, i uninstall the device and reboot the pc and it's works but sometimes it's still have same problem, i did it again and not work,it works sometimes but sometimes it don't, it's a game of luckso can anyone help me with this some times it work but sometimes dont, i really need a answer","solutions":[]},{"symptom":"Severe Instability in Windows Since Build 1903        12\/30\/2019 - I hope I'll be able to make it through this post, before another \"freeze\" or crash!HP p6724y4GB1TB HDD <30% usedMicrosoft Office, Firefox, Edge, Quicken 2019 for Home & Business, Audacity, Stamps.com (NO GAMING WHATSOEVER)Shortly after the 1903 Build update, I noted instability in the system. Some programs would take forever to load, if the did so, at all. I verified that my files were fine (sfc \/scannow) and a Defrag analysis displays a 2% fragmentation of the drive. Over the past several months, the instability has risen to the point where launching almost any app results in a freeze\/\"Not Responding.\" I have to open Task Manager and keep it open and bring to cover the frozen app. Some of the time, that does the trick andthat program loads. If I try to open another app, it happens again and again, so on and so forth.In the last two weeks, each time I attempt to open Quicken, it's a tug of war as to who \"gives in\" first - the computer (by moving ahead with the load) or me, by throwing things in my office, screaming, etc. The second reaction does nothing to help the computer. Moreover, if and when Quicken does open, the window(s) flash on\/off or large\/small, or just disappear altogether and I'm back at the desktop.It's been several months of hell and I am honestly at my breaking point. I've worked in and on computers since the Commodore 64, through DOS, early Windows, etc. I've tried other scans and ideas posted in some of the other folks who have had problems since Build 1903, but none have helped. I am at the point of looking to replace this system, not due to \"want,\" but rather, necessity. What would normally take me 20-30 minutes to pay some bills, print a few stamps, etc., now takes methree hours to accomplish the same task. I'd appreciate any advice that might mitigate these problems.Thank you!","solutions":["Hi Steve My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues, I know how frustrating it can be! I would really like to help you find a resolution.I would like to suggest you try the following. Checking issues with DISM using CheckHealth option You can use the CheckHealth option with DISM to quickly determine if there are any corruptions inside the local image. However, the option won't perform any repairs.To check for issues within the image with DISM, use these steps: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform a quick health check and press Enter: DISM \/Online \/Cleanup-Image \/CheckHealth Once you complete the steps, the command will run and verify if there is any data corruption that needs fixing.Checking issues with DISM using ScanHealth option Alternatively, you can run DISM with the ScanHealth option to perform a more advanced scan to check if the Windows 10 image has any problems.To perform an advanced scan with DISM, use these steps: Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command to perform an advanced DISM scan and press Enter: DISM \/Online \/Cleanup-Image \/ScanHealth After you complete the steps, the advanced scan will take several minutes to determine if the local image needs repairing.Repairing issues with DISM using RestoreHealth option If there are issues, then you can use DISM with the RestoreHealth option, which will run an advanced scan and repair any problems automatically.Open Start. Search for Command Prompt, right-click the top result, and select the Run as administrator option.Type the following command and press Enter: DISM \/Online \/Cleanup-Image \/RestoreHealth While the command is running is normal to see the process stuck at 20 or 40 percent, after a few minutes, the process will complete successfully.Once you complete the steps, the Deployment Image Servicing and Management tool will connect to the Windows Update servers to download and replace any damaged files in the local image for Windows 10 as necessary.Hope this helps.","Jon,Thank you for your expeditious reply. I'm finally taking a small break after three hours of effort to pay 4 bills electronically and printed several checks for charitable funds!I've forwarded  your email to the computer having the major problem and will follow your recommendations right after dinner (I hope!).I had so many problems this afternoon, that I forgot to mention that on both my HP laptop and a different HP desktop, I'm beginning to see the same \"lag\" occurring when open a new browser, an app, etc., Thus, the Task Manager is open all the time on all three units. I also use Malwarebytes and Hitman Pro to keep the malware out of these. I did run both programs on all the computers and the only problems found were some PUP's.I'll respond again after running your suggestions on the most difficult computer.Again, many thanks and best wishes to you and yours for a Happy New Year!Steve","Thanks for your reply Steve. Good luck!Happy New Year to you too.","Jon,Hope you enjoyed a pleasant New Year holiday. I ran the first to DISM programs you advised and no problems were found at all.Before I go on, I want to say that I have two, complex, 12-16 character passwords for the Residential Gateway from my broadband supplier and for the Wi-Fi signal for my personal router. I mention this, as this problem is no occurring on two additional computers in my home, where I constantly have to use the Task Manager in order to \"re-activate\" an app like Outlook or Word.I have used, a portable version of Norton on all three, as well as Malwarebytes Premium and the last build of Hitman Pro, and again, the only questionable files are the PUP's. As it happens, I have Malwarebytes Premium on all three of these computers, which constantly runs in the background, once a computer is turned on. And by the way, the other two computers, one an HP desktop and the other, an HP laptop, each operate with Intel i5 cores and 8MB of RAM.Thanks again,Steve"]},{"symptom":"Windows 1903 to 1809        I recently upgraded my pc to windows version 1903.I can' t play games anymore since i had the 1809 version.i watched some tutorials online and found out there is an optian to 'roll back' a windows update.but it doesnt appear for me since i have the update for 10 for now.i also resetted my pc recently and i dont have the 1809 version saved so i cant go back to it.Help me pelase.","solutions":["Hi kārliskazāks , I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.If there is no rollback option, you would need to reinstall Windows 10 1809. Please note that it goes out of support in less than 6 months.Microsoft servers still have Installation media of previous releases so you can download them:https:\/\/tb.rg-adguard.net\/public.phpChoose Windows Final>Version 1809. How to do a clean install https:\/\/answers.microsoft.com\/en-us\/insider\/for...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes.","which one of the versions (there are three of them.)1)the one that was released in 2018, sept.2) 2018, oct.3)2019, march","I recommend downloading 2018 September.","Here is the SS of the same:","does this mean that i will have my all files uninstalled?","Was a restore point created before you updated to 1903? If yes, then you should be able to do a System Restore and go back to 1809. How long has it been since you did the update?","it was before ~ 1monthBut i resetted my pc before 1week, and i dont ahve the recovery","and no i dont have it","You can save the files to the different drives, but the applications would need to be reinstalled.","* Merged* Original title: follow up quation for sumit. what do i do after i downloaded the file?"]},{"symptom":"Kernel error 141        Hi, every once in a while my system blanks off, following which is an error code 141 (see below):SourceWindowsSummaryHardware errorDate‎03\/‎01\/‎2020 11:31 amStatusNot reportedDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffb005ef3d4010Parameter 2: fffff8062684cc54Parameter 3: 0Parameter 4: ec0OS version: 10_0_18363Service Pack: 0_0Product: 256_1OS Version: 10.0.18363.2.0.0.256.48Locale ID: 1033This happens a couple times a day. What might be causing this?","solutions":["Hi Jason, I am Sumit, an Independent Advisor and a 3-Year Windows Insider MVP here to help.Simplifying the error - this means the computer unexpectedly turned off(lost power). It can have many reasons ranging from maybe a bad piece of hardware or overheating.To better understand the issue, Please see the article below on how to share System logs.http:\/\/www.yourwindowsguide.com\/2017\/12\/how-to-...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads."]},{"symptom":"Hyper-V VM XP Importing  from Windows 7 to windows 10 Activation Issue         Imported Windows XP Mode VM from Windows 7 toWindows 10. For windows Activation part I entered my XP windowsProduct Key (from my dead computer) and tried to activate throughsmartphone process. I got a message: \" I am sorry , we cannot complete thetransaction as our records do not recognize this as a valid product.\"Can you tell me what should I do? I spent so many hours on this. Thank Youin Advance.","solutions":["Hi, Windows 7 license agreement does not allow to use different components (including XP Mode) separately from Windows 7 itself.If you have Windows XP license and it is box version you need to use that license not Windows 7 components, sorry.Please re-read Windows XP mode license agreement.","Happy New Year. I have windows 7 machine. Also, I have virtual XP for years. I created Disk2VHD  drive before upgrading desktop from windows 7 to windows 10. IT was activated and working fine. All the steps in HYper-v  and installed DISK2VHD drive worked ok till activation window. I entered my dead XP computer's Key and did not work. I am willing to pay to activation key. I am frustrated. I tried to get answer from MS chat and did not work. I would appreciate if you can guide me in right direction. ","Unfortunately Microsoft does not sell Windows XP for ~10 years already. You may look for XP boxes on eBay or other second markets.."]},{"symptom":"Windows 10 Classic Shell        Having recently upgraded from 7 Pro to 10 - I really missed the 7 Start menu!  Downloaded the Classic Shell add-on program only 9.8mb. Suits me!","solutions":[]},{"symptom":"Windows 10 & Epson RX520 64 bit software        I recently upgraded to Windows 10 from 7 Pro. The RX520  V4 Driver did not allow select preferences e.g. draft mode printing. Epson Support kindly provided 64 bit software link:  http:\/\/download.ebz.epson.net\/dsc\/du\/02\/DriverDownloadInfo.do?LG2=EN&CN2=&DSCMI=20864&DSCCHK=a025c317f426a8f2fef7c481cbdd6f8a710846daDownloaded via Chrome and now back to normal!  In draft mode the RX520 output is much better quality than my WF3640! ","solutions":[]},{"symptom":"Will a factory reset require an Windows 7 activation key?        I have a \"legacy\" laptop running Windows 10 (POORLY) and would like to go back to Windows 7.  Windows 7 is the OS that was installed on my laptop from the manufacturer.  Unfortunately, the sticker with the activation key fell off years ago so I need to find another way.  Will a \"restore factory settings\" wipe and restart reinstall Windows 7 and will it ask me for an activation key?Thanks!- I want software not a service :) ","solutions":["A Recovery to factory settings normally does not require a product key input by you.But upgrading to 10 normally wipes that recovery partition that you use to do that.You only have a limited time to use this method:Go back to Windows 7 or Windows 8.1 - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@.As you have lost the product key sticker altogether, you can not use a Windows 7 ISO and the product key to reinstall.@@@@@@@@@@@@@@@@@@@@@@These were the manufacturer ways to reinstall 7.Here are the Key\/s to press at Boot to reinstall the operating system (new condition). Under each Manufacturer in the list below are the instructions in the respective links for you to follow on how to use their Recovery PartitionAcer – Press Left Alt + F10 Keys.http:\/\/acer.custhelp.com\/app\/answers\/detail\/a_id\/2631Advent – Tap F10 until Starting System Recovery appearshttps:\/\/answers.yahoo.com\/question\/index?qid=20081221054701AAJT8YVAsus – Press F9http:\/\/support.asus.com\/Troubleshooting\/detail.aspx?SLanguage=en&m=X53E&os=&no=1775Dell – Press F8 which will bring up Advanced Boot OptionsHow to restore a Windows 7 Factory Image on your Dell PC | Dell USDell Alienware:What is and How to use AlienRespawneMachines: Press Left Alt Key + F10http:\/\/techchannel.radioshack.com\/emachines-system-recovery-1747.htmlFujitsu – Press F8https:\/\/forum.ts.fujitsu.com\/forum\/viewtopic.php?f=64&t=39428http:\/\/support.ts.fujitsu.com\/WDB\/FAQContentstart.asp?ID=233412526&WDBStatID=&INFO=SA&quest=&Sprache=en&SprachID=&SecID=&lng=COM&Todo=FAQGateway: Press Alt + F10 Keys - As Acer owns them: press Left Alt + F10 Keys as per Acer eRecoveryhttp:\/\/www.ehow.com\/how_6960920_restore-computer-using-recovery-partitiion.htmlHP – Press F11 repeatedlyhttp:\/\/support.hp.com\/us-en\/document\/c01867418#AbT3Lenovo – Press F11http:\/\/support.lenovo.com\/en_US\/detail.page?LegacyDocID=MIGR-4M7HWZLG – Press F11https:\/\/answers.yahoo.com\/question\/index?qid=20090304161820AAiyvMnPackard Bell: Press and hold the ALT key while pressing repeatedly the F10 key. Release the keys when a message displays that Windows is loading files.http:\/\/packard-bell-scandic.custhelp.com\/app\/answers\/detail\/a_id\/3068\/session\/L2F2LzEvdGltZS8xNDA2MjgyMjczL3NpZC90Z205SDktbA%3D%3D\/~\/use-packard-bell-recovery-management-to-restore-your-system-or-create-recoverySamsung – Press F4http:\/\/www.samsung.com\/us\/support\/howtoguide\/N0000137\/6375\/93514Sony Vaio – Tap F10 until the Edit Boot Options screen is displayedhttps:\/\/ca.en.kb.sony.com\/app\/answers\/detail\/a_id\/35585\/p\/48903,49902,71663,71664\/c\/65,67\/kw\/recovery%20using%20f10Toshiba – Press 0 (zero)http:\/\/forums.toshiba.com\/t5\/System-Recovery-and-Recovery\/How-To-Perform-system-recovery-Windows-7\/ta-p\/279643The above reinstallation methods do not normally require you to supply a Product Key during the Installation Process as the Manufacturers Recovery Process uses the Factory Installation Product Key to automatically Activate during the reinstallation process.@@@@@@@@@@@@@@@@@@@@@@@@@If you can't do any of that you are out of luck for 7 and will have to stay with 10, unless you want to buy 7; which is not supported in 14 days..Cheers.","You will need to do a complete install with a Win7 install disk.  If your system is a Dell, as long as the install disk is for the same win7 edition (home, pro, etc) as the original one supplied, activation will be automatic and you do not need the original Microsoft Product Key which is on that sticker.  If it is not a Dell, you are likely out of luck."]},{"symptom":"Night Light brakes Display Settings or just doesn't work        Last week | stumbled upon a strange issue with Windows 10 1909 on a HP EliteBook 850 G6 and as it turns out also a HP EliteBook 850 G3. The Windows 10 version is Windows 10 1909 Enterprise with the latest build (10.0.18363.476) in the Dutch language with a EN-US language pack added. All seems to be working fine and I can select the Display Settings without any problem until I try to switch on the Night Light from the notification area on the laptop. The Night Light icon becomes active, but the Night Light itself does not work. When you you close the notification area and re-open it the Night Light is not active again and switching it on leads to the same behaviour. It just does not become active.  This would not be a major issue if it didn't have a strange side-effect. When you have tried switching on the Night Light, log off the current user and login as a different user you cannot select the Display Settings anymore from the desktop. It briefly opens and closes again in a few seconds without any error message on the screen. In the event viewer you can find an event which doesn't really helpFaulting application name: SystemSettings.exe, version: 10.0.18362.449, time stamp: 0x066bf1a5Faulting module name: msvcrt.dll, version: 7.0.18362.1, time stamp: 0xf5bdefd7Exception code: 0x40000015Fault offset: 0x000000000000ae72Faulting process id: 0x12b8Faulting application start time: 0x01d5a6b1d5a9de26Faulting application path: C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exeFaulting module path: C:\\WINDOWS\\System32\\msvcrt.dllReport Id: bbc1cafd-5319-4a17-960d-37a61804b485Faulting package full name: windows.immersivecontrolpanel_10.0.2.1000_neutral_neutral_cw5n1h2txyewyFaulting package-relative application ID: microsoft.windows.immersivecontrolpanel Other settings are still available like Sound or Battery but selecting Display Settings results in the Settings closing.You will also find that when logged in as the other user you cannot select the Night Light from the notification area as it is greyed out so now the Night Light is broken and the Display Settings are broken. Every user that logs on to the laptop from that moment on has problems with the display settings. It won't work again.The user logged on when you tried turning on the Night Light can still use the Display Settings and switch on the Night Light (still doesn't work). If however you delete the profile from the laptop and log back in with a fresh profile the Display Settings are also broken and the Night Light feature is unavailable. After creating a dump when the Display Settings crashed I noticed a reference to bluelightreduction which is a registry entry used for Night Light. I compared the registry from a working system with a broken system and it turned out that on the broken system the key 'HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\CloudStore\\Store\\DefaultAccount' was missing  After exporting this key from a working system and importing it on the broken system everything is working again. You can select the Display Settings from any broken account where the registry key was imported and the Night Light function is also available again (still not working). Graphics Card: Intel HD Graphics 520 or Intel HD Graphics 620Intel Driver Version: 26.20.100.7463 from november 6th 2019BIOS: R70 01.03.03 Rev.A (G6) or N75 01.44 (G3)Windows 10 1909 build 476 (november 2019)Latest driverpack for Windows 10 1903  from the HP site. I can confirm that at first with Windows 10 1903 Enterprise (10.0.18362.476) the night light functionality is working, but logging in with a different user gives the same result. The night light is broken again and if you log back in with the previous user the night light is also broken. You can select it and activate it but it doesn't work anymore. Display Settings is still working, but clicking on the Night Light settings results in the closing of the settings screen and an error in the event log. Naam van toepassing met fout: SystemSettings.exe, versie: 10.0.18362.449, tijdstempel: 0x066bf1a5Naam van module met fout: SettingsHandlers_Display.dll, versie: 10.0.18362.1, tijdstempel: 0xac1c53a8Uitzonderingscode: 0x80000003Foutmarge: 0x000000000001e0c4Id van proces met fout: 0x2490Starttijd van toepassing met fout: 0x01d5a8f38759559cPad naar toepassing met fout: C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exePad naar module met fout: C:\\Windows\\System32\\SettingsHandlers_Display.dllRapport-id: 2da54e96-c90f-4d0b-93ff-09abbaaab155Volledige pakketnaam met fout: windows.immersivecontrolpanel_10.0.2.1000_neutral_neutral_cw5n1h2txyewyRelatieve toepassings-id van pakket met fout: microsoft.windows.immersivecontrolpanelWith Windows 10 1803 Enterprise (10.0.17134.1130)  it works fine and keeps on working with every user that uses the system.  After upgrading from Windows 10 1803 to Windows 10 1909 the night light is no longer working and I cannot select the night light settings anymore. It results in the above error. If I revert the operating system back to Windows 10 1803 everything works as expected again. Night Light is fine, choosing the Night Light settings is fine. Display Settings is fine. No driver was updated during the upgrade so I am guessing this is a Windows 10 1909 bug but until anyone else can reproduce the problem on their system (HP EliteBook?) with 1909 I can't be certain.","solutions":["Hi Hotzenwalder and thanks for reaching out. My name is Joseph. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by a Windows Support, so it is safehttps:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","I ran dism.exe and sfc \/scannow and created a dump when SystemSettings crashedCBS.loghttps:\/\/1drv.ms\/u\/s!AhgSflBheSz3nQNosXFYuIn_l6iN?e=YDGhHWSFCdetails.txthttps:\/\/1drv.ms\/t\/s!AhgSflBheSz3nQJI9HyWVkYPLZR-?e=6bRY0HDump when SystemSettings crashedhttps:\/\/1drv.ms\/t\/s!AhgSflBheSz3nQQlIcCHlsG5bi92?e=Aq4vVxNight Light is still not working. Display Settings can be changed. Error in the event log when I try to change the Night Light settingsNaam van toepassing met fout: SystemSettings.exe, versie: 10.0.18362.449, tijdstempel: 0x066bf1a5Naam van module met fout: SettingsHandlers_Display.dll, versie: 10.0.18362.1, tijdstempel: 0xac1c53a8Uitzonderingscode: 0x80000003Foutmarge: 0x000000000001e0c4Id van proces met fout: 0x2490Starttijd van toepassing met fout: 0x01d5a8f38759559cPad naar toepassing met fout: C:\\Windows\\ImmersiveControlPanel\\SystemSettings.exePad naar module met fout: C:\\Windows\\System32\\SettingsHandlers_Display.dllRapport-id: 2da54e96-c90f-4d0b-93ff-09abbaaab155Volledige pakketnaam met fout: windows.immersivecontrolpanel_10.0.2.1000_neutral_neutral_cw5n1h2txyewyRelatieve toepassings-id van pakket met fout: microsoft.windows.immersivecontrolpanelit To find out where it breaks I started installing both laptops with a fresh installation of Windows 10 1909. One with the standard ISO from Microsoft and one with our custom build image. Both laptops are still fully functional after the installation. Display Settings gives no troubles and the Night Light also works and never crashes. Because of this OI suspect the problem to be in one of the drivers that is installed during our task sequence. First thing I will try is to install one of the laptops with our task sequence but without drivers and without joining it to the domain to see if everything still works as expected.","I found another solution: You must let activate the Windows service \"service broker for network connections\" with start type \"demand\".I do not know why but if this service has the start type \"disabled\" and which cannot run, the night lighting setting is broken.I have always disabled this service since the first Windows 10 version but its does not work since the 1903 version. This operating system has no logic...Sorry for my english but it's not my primary language."]},{"symptom":"keyboard        my keyboard has switched wasd out for the arrow keys and vice versa. I don't know what happened to cause this","solutions":["A Google search says many times the solution is usually:Hold down 'Fn' key, press and release 'W' keyClick for other ideasYou can reduce message cycles by telling us that make\/model of your system and if the keyboard is separate the make and model of your keyboard."]}]}