{"windows":[{"symptom":"Minecraft Bedrock Edition, and Support        First thing is that I redeemed my code for my free version of Minecraft windows 10 edition and the code needed to fully redeem it (25 character code) was never sent to my email. Secondly, Microsoft needs to better clarify or make clear that their live support is only available till 8:30 PM Eastern time, I had no idea of this and have been waiting an hour to only realize I've been waiting on nothing. I saw no clear alert that this service will only be available at this certain time on this specific day until I went on my own and looked it up. Also even once I looked it up it never said the live support timings the only clear times stated were for calling and or a vocal conversation and not the live chat, so even once I saw this problem its still unclear to me. Also I find it hard to believe that in a matter of an Hour the microsoft support team can only take 1 support case every 20 minutes seeing that I began on a waiting list of 13 people and it took me 1 hour to get to the 8th position and then another 20 to get to 7, and finally I get to 3rd almost there and It has not changed for another hour. So all I needed was this code to be sent to me in what could be a near < 5 minute process instead has taken from around 8 PM Jan 11 2020 - 1 AM Jan 12 2020. Another tip, if there is going to be no \"live support agent\" make it clear to the customer that no one will be there and the agent is off work, otherwise I wont be the last person waiting 3 hours.","solutions":[]},{"symptom":"Problems after reinstalling old hard drive        Hello,I'm a tech consultant in a major big-box retailer. A customer came in with a laptop they had purchased from another retailer and was complaining about the overall sluggish performance of the machine. Its running an AMD A6 with 4GB of RAM and a 5400rpm HDD, so its pretty low end. I recommended upgrading to a SSD to improve day-to-day performance, which he opted to do. I transferred all of his information over to the new drive using USB\/SATA cables and got his computer up and running. I didn't erase his old drive so it contains everything that was on the laptop prior to me upgrading it.Unfortunately, I didn't transfer his settings or his printer drivers over, which meant that he's been unable to connect to his printer for the past few days. He was also missing some files and was complaining about mouse lag which didn't exist before. We eventually decided that given the litany of issues he was experiencing with the SSD it was probably best to put everything back to the way it was and reinstall the old HDD.After successfully reconnecting the drive, I am now experiencing a whole host of issues:1) I am constantly getting a CTFmon.exe error dialog box. It appears at the Windows login screen, and closing it only causes it to reappear after a few seconds. The box states \"Unknown Hard Error\"2) The start menu and task bar are inaccessible. I can mouse over the elements and the GUI responds as normal, but nothing actually launches when I click on them.3) The settings and device manager are also inaccessible. I've been attempting to launch them using Win + R and CMD.exe, but I've gotten errors both times. I saw a post on another forum that suggested checking for driver updates, but I'm unable to do this without having access to these utilities.4) I've attempted to boot into safe mode, but this results in a critical stop error that forces me to boot into Windows normally.5) Windows performed an automatic disk inspection on the second boot up and found no issues. I've tried running chkdisk myself manually, but this results in the computer locking up.6) Explorer is usable, so I'm still able to navigate the file system without much issue. I should mention I did receive an Explorer.exe error stating the class was not registered, but this has thus far only happened once.7) HDD activity has tended to stay in the 15-20% range, according to task manager.As far as I know the customer is running 1909 on the HDD. Performing a reset is not an option since doing so would wipe out his printer drivers\/settings and thus put us back in the same situation we were in with the SSD.I consider myself a technically minded person, but the vast majority of my knowledge is self-taught. I've researched this online but I've yet to find anything that matches this situation. Normally I would spend several hours pouring through every online resource I can find, but I feel like I've already wasted enough of this customer's time already and thought posting here would result in the fastest possible solution.I would appreciate any feedback or insight anyone can provide on this issue.","solutions":["Sorry to say so but your cloning process (which you did not elaborate on) was both incomplete and flawed. Keeping the old disk was a good idea but you probably damaged it by booting the machine after the cloning process while both disks were connected. This would have caused serious damage to the registry.Here is a cloning method that works perfectly. I did one only yesterday.Use the free version of Macrium Reflect to create an image of the magnetic disk. Make sure to catch all partitions. Park the image on an external USB disk.Disconnect the magnetic disk, connect the SSD.Boot the machine with a Macrium Reflect Rescue Disk.Restore the image to the SSD.This method is guaranteed to copy everything and to leave the old disk undisturbed. In addition you get the image file as a safety measure.How to fix the problem disk? The only method that comes to my mind is to try System Restore (rstrui.exe). It's grasping at straws.","This will probably explain why I'm not anybody's tech consultant ...When a computer has multiple, serious problems, and you can't even begin to understand what went wrong, I would not waste any time trying to fix that computer. You are looking at virtually endless frustration and an enormous time suck. The chances for 100% success are small. Time for a properly performed clean install.A properly performed clean install takes time. It requires lots of preparation. But the end result is a computer that performs as well as it possibly can, and that's what makes it so worthwhile to you and to your customer.With that done, you make an image backup of the hard drive, which you provide to your customer along with their computer, and a recommendation for a book on learning how to use Windows.If the computer is still relatively new, and\/or almost no configuration changes have been made or software added since the computer was first acquired, you can save time by doing a factory reset rather than a clean install.","Sorry to say so but your cloning process (which you did not elaborate on) was both incomplete and flawed. Keeping the old disk was a good idea but you probably damaged it by booting the machine after the cloning process while both disks were connected. This would have caused serious damage to the registry.Here is a cloning method that works perfectly. I did one only yesterday.Use the free version of Macrium Reflect to create an image of the magnetic disk. Make sure to catch all partitions. Park the image on an external USB disk.Disconnect the magnetic disk, connect the SSD.Boot the machine with a Macrium Reflect Rescue Disk.Restore the image to the SSD.This method is guaranteed to copy everything and to leave the old disk undisturbed. In addition you get the image file as a safety measure.How to fix the problem disk? The only method that comes to my mind is to try System Restore (rstrui.exe). It's grasping at straws.Thanks for the reply, but I didn't clone it. I removed the HDD from the laptop (while it was off, of course) then installed the new SSD. I then performed a clean install of Windows 10 using a bootable USB created from the Media Creation Tool. Windows was activated using the customer's Microsoft account. The programs the customer had were mostly Office and Antivirus, which could be redownloaded by signing into the respective accounts through the web browser.Once Windows was fully setup and all updates had been downloaded and applied, I then connected the HDD via USB and moved the individual files (Documents, Music, Pictures, Videos, etc) using Windows Explorer.I essentially have two separate instances of Windows 10 installed on two different drives. The only thing they shared was the license key and the user's created content. ","This will probably explain why I'm not anybody's tech consultant ...When a computer has multiple, serious problems, and you can't even begin to understand what went wrong, I would not waste any time trying to fix that computer. You are looking at virtually endless frustration and an enormous time suck. The chances for 100% success are small. Time for a properly performed clean install.A properly performed clean install takes time. It requires lots of preparation. But the end result is a computer that performs as well as it possibly can, and that's what makes it so worthwhile to you and to your customer.With that done, you make an image backup of the hard drive, which you provide to your customer along with their computer, and a recommendation for a book on learning how to use Windows.If the computer is still relatively new, and\/or almost no configuration changes have been made or software added since the computer was first acquired, you can save time by doing a factory reset rather than a clean install.Trust me, if this was my own machine I would've cut my losses and reset it a long time ago. But the customer's printer is proving notoriously difficult to reconnect, which is why I'm trying to preserve the instance that's currently on the HDD.","Thanks for the reply, but I didn't clone it. I am looking for an explanation for the action that might have modified the magnetic HDD. Reading your reply I cannot think of one.","Thanks for the reply, but I didn't clone it. I am looking for an explanation for the action that might have modified the magnetic HDD. Reading your reply I cannot think of one.Neither can I. The HDD basically went straight from the anti-static mat into the box of the new one when it was replaced, then right from the box and into the laptop again when he brought it back.","Trust me, if this was my own machine I would've cut my losses and reset it a long time ago. But the customer's printer is proving notoriously difficult to reconnect, which is why I'm trying to preserve the instance that's currently on the HDD.I can respect that.If the manufacturer of the printer in question supports that printer on Windows 10, it should install and work properly. If it does not, you ought to take it up with the manufacturer. They (allegedly) tested that model on Windows 10.If the manufacturer doesn't support Windows 10, I don't envy you. The printer is not guaranteed to work, and if it works today, maybe not tomorrow.About the HDD: Reconnecting the same, unaltered HDD to the same motherboard SATA connector in the same computer has zero consequences. You are merely putting back what was there before. Even in the unlikely event that the HDD was exposed to harmful static electricity in the interim, the drive would fail; it would not have individual performance problems.In my opinion, your customer's computer was messed up long before you touched it. You did not do anything harmful."]},{"symptom":"touchpad issue        Hey there, I am facing this really annoying issue.My laptop automatically scrolls down on its own. I'm facing this problem since last few months but now, it occurs almost everytime. I can't figure out why it's happening. I searched all over web but found nothing.If i open a page in Chrome it automatically scrolls to the bottom of the webpage. If i open excel spreadsheet it automatically scrolls to the last row. If i'm just on idle desktop it automatically selects last icon. And when i double click to open some other app icon, it opens the last app icon. If i scroll back to top, it again scrolls down.Please help guys asap!","solutions":["Hi , I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...If none of the above helps then try fixes here: https:\/\/www.dell.com\/community\/Laptops-General-...https:\/\/www.techwalla.com\/articles\/how-to-troub...https:\/\/h30434.www3.hp.com\/t5\/Notebook-Boot-and...I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Screen tearing while playing minecraft        Whenever I play Minecraft, my computers tends to screentear a lot. Screen tearing is a visual artifact in video display where a display device shows information from multiple frames in a single screen draw. The artifact occurs when the video feed to the device is not in sync with the display's refresh rate. Yes I have tried turning v sync on and it doesnt fix the problem. I have also tried to reset my graphics card settings incase I did something and the problem did not fix. Specs: Processor: Intel Core i5-4210 CPU @ 1.70 GHz 2.40 GHzRam: 8.00 GB64 bit systemNvdia 840a Windows 10Minecraft Java edition","solutions":["Hi Imposted and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You should turn on your Vsync when you experiencing screen tearing. I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","As i said, i tried v sync and it didn’t work.","Hi Imposted, Did you both set the GPU settings and in-game settings to \"Turn on Vsync\"? Thanks.","Yes and it didn't work.","Hi Imposted, I found an existing video tutorial that will help you resolve your concerns. You can check and see if the instructions provided can help you.https:\/\/www.youtube.com\/watch?v=LKBigK5kPvEI hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","That did not help, I put the profile inspector to 60 fps and it stayed in the 40's when my pc can normally go up to 200 fps also the tearing did not stop.","Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Is it happening only when you play Minecraft?","I don't have Minecraft, but if V-sync, or using a frame limiter do not help, it's probably the game. Being the JAVA .ed may bea contributing factor as well.- I have a few games that don't respond to V-sync. A 120+ Hz monitor is a big plus with these games.- I've never bothered using Inspector for anything other than backing up Control Panel profiles, and didn't watch the whole video, but...If Minecraft can use Nvidia's DSR resolution, forcing the resolution higher with DSR may help reduce the frame ratesenough to reduce tearing as well.Using Control Panel, have you tried enabling Triple Buffering (even though it is supposed to be for Open GL) when V-sync is enabled(more a mouse lag fix than tearing though) ?- Or tried one of the other (Adaptive, etc) V-sync options in Nvidia Control Panel ?.","I don't have Minecraft, but if V-sync, or using a frame limiter do not help, it's probably the game. Being the JAVA .ed may bea contributing factor as well.- I have a few games that don't respond to V-sync. A 120+ Hz monitor is a big plus with these games.- I've never bothered using Inspector for anything other than backing up Control Panel profiles, and didn't watch the whole video, but...If Minecraft can use Nvidia's DSR resolution, forcing the resolution higher with DSR may help reduce the frame ratesenough to reduce tearing as well.Using Control Panel, have you tried enabling Triple Buffering (even though it is supposed to be for Open GL) when V-sync is enabled(more a mouse lag fix than tearing though) ?- Or tried one of the other (Adaptive, etc) V-sync options in Nvidia Control Panel ?.No, that did not fix it. Also, when I enable v sync using inspector or control panel, it looks like my game can't stay at 60 fps stable but it can stay at 200 fps when it's not on?","Some game engines just don't work well with V-sync. You can only experiment with the options and hope for the best.Game specific forums may have an rare out of the ordinary fix that applies to that game on occasions.\"can't stay at 60 fps stable but it can stay at 200 fps when it's not on?\"- V-Sync has always been an imperfect solution to screen tearing. It's effect on performance is similar to using a high Anti-aliasing setting,but it shouldn't normally cause a game that runs at 200fps to drop to 40fps. As with the tearing, there are plenty of exceptions though.I wonder if Compatibility option - Disable Fullscreen Optimisations - would help ?  There were a couple of people posting here who reckon this it the cure for all ills, and think MS should make it possible to disable universally.I've found it does help reduce blur when panning, and fps with a couple of games (Crysis being one). I don't know if it helps with tearingas the fps don't go over 120.- I reckon enabling V-sync (or any other setting that has no enhance option) in both game and Control Panel may conflict,and generally only use the Control Panel for settings not available in the game, or if an in game setting such as V-sync is not doing the job.Some people are more sensitive to tearing or stutter as well. I rarely notice stutter, but don't do a lot of on line gaming with constantrunning and quick panning side to side, which is when it most evident.I do notice tearing and it was particularly noticeable when I changed from CRT @100HZ to flat panel @60HZ. The release 120Hz monitorshas been a big help. G-sync is even better, and also helpful with stutter.I usually don't enable V-sync unless I notice tearing, and I have a few games running over 200fps that I don't notice tearing @60HZ.."]},{"symptom":"c:\\users\\  the directory name is invalid        If I try to download a pdf OR open some of my own documents I keep getting the error message the directory name is invalid","solutions":["If I try to download a pdf OR open some of my own documents I keep getting the error message the directory name is invalidNo worries.You can only download to, or open documents from, your own user profile, which is here:C:\\Users\\your user account nameFor example, you can download PDFs to C:\\Users\\your user account name\\Downloadsand you can open documents from C:\\Users\\your user account name\\Documents","Hi Dana. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See fixes here for the error: https:\/\/www.ubackup.com\/backup-restore\/the-dire...https:\/\/windowsreport.com\/invalid-directory-name\/ (avoid ad links, editorial content is fine)I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How do I upgrade from windows 7 enterprise to windows 10 enterprise?        I purchased a windows 10 enterprise activation key and having trouble upgrading from windows 7 enterprise. Any thoughts?","solutions":["Hi GP. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Enterprise is a business version that's activated by volume licensing from the organization's on-site server. It is not a consumer version. May I see a link to the Enterprise key you bought because there's a good chance it's an illegal volume license key which should not have been sold, and will expire as soon as it's due to connect to the on-site server to reactivate.You can report this to Microsoft here: https:\/\/www.microsoft.com\/en-us\/howtotell\/cfr\/r...Sometimes if you let the seller know that you intend to do this, they will make it right.It's always safest to buy Product Keys from Microsoft or a major retailer who back all sales. Microsoft's offer for Windows 10 Home version is here:https:\/\/www.microsoft.com\/en-us\/p\/windows-10-ho...You can follow the gold standard Clean Install in this link which compiles the best possible Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Make sure during the booted install to follow the illustrated steps to delete all partitions down to Unallocated Space to get it cleanest, then click Next to let it auto-create the needed partitions, format them and begin install - this makes it foolproof.I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Please remove the Product Key which should not be published for millions to see. It is likely a Volume License key which as I explained is for business only and will expire when it cannot connect to a business' on-site server.You can contact Microsoft Customer Service here: https:\/\/support.microsoft.com\/en-us\/help\/405170... to ask them to validate the key is genuine. Be sure to tell them you were sold a consumer PC with Enterprise only used by business and large organizations. They may have other suggestions."]},{"symptom":"How can I stop my PC from crashing so much?        Ever since I got and downloaded Windows 10 my PC likes to crash several times while using it. I did finally geet it to speed up. But, now I have this issue.Can someone PLEASE help me solve it?? Thanks.","solutions":["No one can guess what \"this issue\" is.Here are the three steps to a PC that never crashes:1- A clean install.2- Using only supported hardware and software.3- Not making unsupported changes to your computer.","Hello JohnBusalacchi! My name is Marco, I am an Independent Advisor. I will do my best to help you.It can depend on several things a system crash. Can you give us more details? Does this happen at any time?Or when running any software or games? Only on the internet browser? Etc .. Please provide us with more information so that we can help you. Marco","Hi, Marco, Sometimes it happens right in the middle of playing a game. But, most of the time it happens when ever it feels like. I'm not anywhere specific or doing anything specific. Could it be fixed by re-installing Windows 10?? If so, do uninstall it first?","Can you describe the bug that occurs when Windows Crash? Do you have an error code, any message?What I can advise you in the meantime is to update windows with the link I will provide.https:\/\/support.microsoft.com\/en-us\/help\/402766...Also made this manipulation which can, perhaps, settle some error. https:\/\/support.microsoft.com\/en-us\/help\/929833...Marco"]},{"symptom":"Hard Drives not being seen in W10 after re-plugging them in        Hi everyoneI’ve got a strange problem that I’m struggling with. Firstly I should say it’s on my Mrs PC and she’s currently away with the machine atm so I’m trying to troubleshoot remotely.1 SSD and 4 HDDs were removed from a perfectly working W10 computer on Friday.They were stored safely and reconnected today, but they won’t detect properly.I should note my Mrs knows what she’s doing with connecting components and has built her own computers, so I know they are in correctly. She’s also double checked connections.Drive configuration:SSD – BOOTHDD 1 – WORKHDD 2 – PHOTOHDD 3 – VIDEOHDD 4 – MUSICI should note before going into further explanation that all that happened between it working and not working was the drives were taken out and put back in...that's it!Since plugging everything back in not all the drives have been showing up and something has happened to WORK drive. The permissions seem to have changed and she’s shown these error messages:d:\\Location is not accessibleAccess is deniedShe could click on the drive properties from Windows explorerThe drive name was also appearing as PHOTO, even though it’s WORKFrom Windows Explorer, drive showed as 0 bytes used space\/free space, BUT...from Disk Management it CORRECTLY reported the drive size and free spaceDrive was still named incorrectlyClicking on PROPERTIES in DISK MANAGEMENT the error message “You must have read permissions to view the properties of this object” appears in the drive properties. Remember, this can’t be seen from Windows Explorer.Another strange thing...using Photoshop,she can access the drive that is invalid, open a saved file that is saved as a shortcut in Photoshop, but can’t directly access the files in Explorer.Using Recuva to see if the drive has completely corrupted, doesn’t show a lot of corruption and in the Recuva dialog window for selecting the drives\/folders to scan it even shows some subfolders on the drive, which can’t be seen otherwise.Having taken the WORK drive out and replugged the other drives in, now NONE of them show in Windows, except obviously the boot drive SSD.She has checked in the BIOS, all drives appear and are named as normal, it’s when it gets into Windows that the problems start.We are both really stumped with this and can't figure out what's happening or why.If it was a bizarre Windows screw up, as a last resort, we'd just take the drives out, format the SSD and reinstall Windows, but we are concerned that if permissions have been altered on the HDDs we may not be able to access them from another machine.What can we do?Thanks in advance for any advice,. I've never been actively part of the Microsoft community before, I'm hoping for the best!","solutions":["Hi,I'm not sure what to tell you about correcting your problem, but can maybe say what happened and how to avoid anymore potential damage..Windows 8, 8.1 and 10 have a feature called Fast Startup that is turned on by default.. This is a type of \"Hybrid Shutdown\" that is a combination of Hibernation and Shutdown..It normally works pretty good, but has one major drawback.. The HDDs\\SSDs are not \"Closed\" as they were in Windows 7 and earlier... As a result of this, any loss of power to the HDD\\SSD has about the same effect as a power failure while the machine is running..You need to disable this feature when unhooking a HDD\\SSD or totally removing power from a machine..To turn it off or on...Go to Control panel...Power Options, and select Choose What the Power Buttons Do on the left.Then select Change Settings That Are Currently Unavailable near the top center of screen...Lower down on the window, uncheck Fast Startup.You might try hooking the HDDs up one at a time and running CHKDSK.. Hooking them up to their original connector may be beneficial..","Hi slance310, thank you for your reply, answers are a bit thin on the ground, so I appreciate your response.That's interesting information, I didn't know that, thanks for sharing.Does that happen even after the computer has been completely shut down? The computer wasn't in sleep mode, they weren't hot swapped, it was a shut down command from in Windows and they were taken out after that.Thanks.","Hi,The Fast Startup is specifically for a Shutdown.. That is the only time it functions..You do not need to select Sleep or Hibernate.. It is a hybrid combination of hibernation and shutdown that is configured by Windows during the Shutdown process...Have you figured out any more concerning the usability of your drives ?","Ah heck...I didn't know about that 'feature', so maybe it did have something to do with it, I don't know. It seems strange that some drives can be accessed some of the time, and the real problem drive can be accessed through Photoshop and Recuva but not Windows Explorer.No, we haven't got any further with it yet. My Mrs is away with the computer at the moment. She's coming back on Thursday, so my plan is to put the HDDs into external caddies I have and connect them to my computer. The most important thing is if I can read them and get the data off, everything else is secondary. I'll reformat C if something in Windows has messed up and blank the drives if necessary (once the data is off), but I just don't know.One of my worries is that if the permissions on the drives are messed up I'll be hit with the 'you don't have permission to access' this drive' when trying to load it up on another PC.It's typical this has happened when my Mrs is away, it's making everything that much harder to troubleshoot and fix, fingers crossed for Friday though.","Hi,It is possible that somehow the drive letters got mixed up when they were unhooked and hooked back up..Especially if they were not connected to the same SATA Port as originally..There is also a possibility that the \"User Account\" somehow got messed up which could generate the \"d:\\Location is not accessible..  Access is denied\"..It should be possible to overcome any Permissions issue should that become necessary..There are a number of bootable Linux based programs that should enable you to recover any data from the drives... By this I mean to actually copy them to another drive as opposed to using something like \"Recuva\"..I have recently done this but I don't remember which program worked the best.. I tried several.. I will see if I can determine which it was..","HiThanks for your continued assistance with this, it's certainly appreciated!Yes, mixing up the cables as they were plugged back in is certainly possible (she will furiously deny it of course...but yes, definitely possible) ;)That is my main concern, the permissions thing. I've had it in the past where I've not been able to access a drive on a different machine due to permissions set on the first machine so it is a worry.Ah, I like your idea. I've only ever used Ubuntu once, years ago, I wouldn't have much of a clue how to set up a Linux machine now, hopefully it's easier now than it was then.I used a disk manager some time ago (I'd have to find the name of it), which allowed me to back up the boot drive in case the original drive failed, without having to unmount the drives, which was quite clever, I wonder, would that work? Or would it just copy the permissions over as well?Otherwise, I wonder, are there programs that can be put onto a bootable USB pen drive and back up a drive before booting into Windows?That would be handy if the contents could just be transferred to an external hard drive. I'd just reformat all the original drives then, just for ease and to erase existing permissions.","Hi,A lot of the Disk Management type programs will copy, image, or clone drives but that may not give the desired results..There are a number of Linux based programs that are available as an ISO image that can then be burned to a CD or Flash Drive.. I usually use a free tool called RUFUS to put ISO's on Flash Drives.. It is quite easy to use..The most important setting is to select \"MBR\" for the Drive Type to be created..One tool I use is called PartedMagic which was a free program but now requires a purchase to create the bootable media.. ISO's of the free versions are still available, but some of the sources are questionable..I trust this one..  https:\/\/www.majorgeeks.com\/files\/details\/parted_magic.htmlIt runs much like windows, but does have some Linux naming of stuff.. It is not to hard to figure out as the drives retain their original name along with the size.. You would use the File Explorer\\Manager available on the Desktop.. It will not display both drives at once so you need to select what you want to copy.. open the target drive, then paste..I have used easier programs but at the moment I can't find or remember them..It is also possible to use the Command Prompt in Windows Installation or Repair media.. It may or may not ignore some of the permissions stuff.. You can use the Command Prompt to open a Windows Explorer window that will allow pretty much normal copy\\paste operations from one location to another...Here is the method just in case you might want to try it..The drives letters will be different than from within Windows, but their names will be the same..Boot computer from installation media...Select \"Repair\" on the lower left of the \"INSTALL\" screen...Select Troubleshoot.... Command PromptEnter NotePad into Command Prompt and hit Enter...Click on \"FILE\" Tab and select \"OPEN\"Click on ThisPC or use the Dropdown menu to browse to the files you want to copy...Right click on desired files and select \"Copy\" as normal...Browse to the location you wish to save the files and select \"Paste\", again as normal...Ignore anything on the bottom of the window concerning \"SAVE\", \"CANCEL\", \"File Type\", and ETC...You can also practice this method from within windows to give a better idea of what you will see..","Hi thereThe computer is going to be coming back today, so I should be able to look at things from hopefully tomorrow onwards and see what we're dealing with.Really hoping I can just copy the contents to another drive which I have ready and waiting...if not, I'll have to be employing some of your methods!Fingers crossed, I'll keep this updated when I know more.Thanks again for your continued help with this! ","OK... Good luck with that..","Hi thereI've got a bit of an update...We brought the computer back home last night so I've been testing things out today.I've tested all four HDDs in an external USB 3 dock.The errors etc., are replicated exactly as on the original machine.Two read perfectly.One is renamed a different drive (PHOTOS, randomly renamed to VIDEOS), but still reads OK.The important drive, the WORK drive, gives me the same error messages as I've outlined already, access denied etc.I tested again in Recuva, and doing that it can see the three main folders on the drive, it can also see that there are thousands of files on there and can find all sorts of deleted files in various states of being overwritten, so I thought, it doesn't appear that the drive is corrupted.So for the past few hours I've been using the free version of AOMEI Backupper to take the data from this misbehaving drive and put it onto one of my backup drives. It's transferred 808GB of around 900GB so far and it seems from the few files I've checked that I CAN open them on my machine.That will be fantastic if it works! But it still leaves me with the question of what was the original problem? It could be as you said with the HDD shutdown issue, or maybe a Windows even a hardware fault.I don't know whether I should try reinstalling Windows 10 on this problem machine in case it's something to do with that. Only problem is, I can't remember whether I had a disc for W10 or if we upgraded from W7 on their free upgrade program a couple of years back.Next hurdle to overcome..."]},{"symptom":"AirPods paired but won't connect.        AirPods paired but won' connect, I tried:-Deleting the drivers and updating them.-Putting Bluetooth Support Service to Automatic and restarting-Troubleshooted everything-Tried every 'connect' button on every window I know such as:      -Sound control panel, Devices and Printers, Bluetooth settings, Action Center (Connect button)        And still doesn't connect-Scanned for hardware changesIt shows up on my Playback settings as disconnected (AirPods Stereo and AirPods Hands Free AG). Everytime I hit the connect button nothing happens.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving this issue. I understand that you are able to pair the AirPods but unable to connect them to the computer. One of the things that you can try is to remove the hidden drivers for Bluetooth and then pair the AirPods once again. Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hitEnter. Click on View and click on Show hidden devices. Go to Bluetooth and expand it. Now uninstall all the greyed out devices.Restart the PC.  Once you restart the PC, try pairing the Bluetooth device and see if you are able to get connect them. You can refer the articleConnect a Bluetooth device in Windows Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator","The results are still the same. Another thing I forgot to add in my question is that whenever I uninstall my device from Bluetooth, I can't manually add it back. The computer keeps \"reconnecting\" to my air pods for me. Also here is what my Device Manager looks like now.","Hi, Thank you for replying. I would suggest you to refer the steps mentioned below and see if that helps: Press Windows Logo key + X, and selectDevice Manager.Expand, Human Interface Devices.Look for AirPods Audio\/Video Remote Control HID andAirPods Hands-Free Call Control HID, right click on each entry and selectProperties.Go to the Power Management Tab, clear the checkbox forAllow the computer to turn off this device to save power.Also, repeat step 4 for Bluetooth Low Energy GATT compliant HID.Click on OK. Let us know how it goes. Regards,Nikhar KhareMicrosoft Community - Moderator","Unable to locate any of those properties under my Human Interface Devices.","Were you able to figure this out? I'm in the same predicament. Unable to locate those properties...","Hey thanks, this actually works!","I found that it woks if after pairing your AirPods, you open the Sound Control Panel and set the Default Device to Headphones - AirPods Pro Stereo. The AirBuds will then automatically connect when they are out of the charging case."]},{"symptom":"apps through firewall        please tell me is it safe to have all boxes checked , public and private apps that can communicate through firewalls?","solutions":["Hi Maureen. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.As long as the apps are ones you installed yourself and want, then any Firewall exceptions they created can be trusted.There is more about this here, including how to reset Firewall to defaults if you are in doubt. But you may need to reinstall some apps that set exceptions:https:\/\/www.windowscentral.com\/how-troubleshoot...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"ROKU app for Windows 10 laptop        Where can I find\/download the ROKU app for Windows 10 laptop?","solutions":["Hi, WinnieClark My name is Kathleen and I am an Independent Advisor. I would be happy to help you today.Check this link, I hope it helps. https:\/\/www.microsoft.com\/en-us\/p\/roku-streamin...Let us know if these steps help you to resolve the issue.","Hi WinnieClark Greetings! I am Vijay, an Independent Advisor. I am here to work with you on this problem.Currently Roku doesn't have its app on Microsoft Store. So, you can't download this app.","Per the Microsoft website at: Buy Roku - Microsoft Storeyet even though there appears to be a remote in the store, it says it's not available.. So what is the real truth on whether there is or not?Roku ‪Roku‬ ‪Entertainment‬382The Roku app for Windows allows Roku users to control their Roku player over their home network. Features include: - Search for movies, shows, actors, or directors and easily launch the content on your Roku player or TV. Search is available today with the Roku Streaming Stick (HDMI version), Roku 3, Roku TVs, and will be available on additional Roku players at a later date. - Browse, add, and rate Channels from more than 1,800 Roku Channels offered in the Roku Channel Store. - Quickly launch your favorite Roku Channels - Name and switch between multiple Roku players and TVs - Enjoy your laptop or tablet photos and music on your Roku player or TV (Supported on Roku 3, Roku 2, Roku LT, Roku HD (model 2500), Roku TV, and Roku Streaming Stick only) THIS APP REQUIRES A ROKU PLAYER To use this app, you must connect your Windows device to the same network as your Roku player or TV. Certain features require compatible Roku players\/Roku TVs or may require logging in to your Roku account. HAVING TROUBLE FINDING YOUR ROKU PLAYER OR ROKU TV? Note: If the app does not recognize your Roku player or TV (you see a “No Roku Devices Found” message after you sign in), try going to network setup again on your Roku player. This will wake your Roku player on your home network. Then, select “Try Again” in the Roku app. Go to support.roku.com for FAQs or to get help.TEENRoku is currently not available.See System RequirementsRokuThe Roku app for Windows allows Roku users to control their Roku player over their home network. Features include: - Search for movies, shows, actors, or directors and easily launch the content on your Roku player or TV. Search is available today with the Roku Streaming Stick (HDMI version), Roku 3, Roku TVs, and will be available on additional Roku players at a later date. - Browse, add, and rate Channels from more than 1,800 Roku Channels offered in the Roku Channel Store. - Quickly launch your favorite Roku Channels - Name and switch between multiple Roku players and TVs - Enjoy your laptop or tablet photos and music on your Roku player or TV (Supported on Roku 3, Roku 2, Roku LT, Roku HD (model 2500), Roku TV, and Roku Streaming Stick only) THIS APP REQUIRES A ROKU PLAYER To use this app, you must connect your Windows device to the same network as your Roku player or TV. Certain features require compatible Roku players\/Roku TVs or may require logging in to your Roku account. HAVING TROUBLE FINDING YOUR ROKU PLAYER OR ROKU TV? Note: If the app does not recognize your Roku player or TV (you see a “No Roku Devices Found” message after you sign in), try going to network setup again on your Roku player. This will wake your Roku player on your home network. Then, select “Try Again” in the Roku app. Go to support.roku.com for FAQs or to get help.OverviewSystem Requirements Reviews Related Available onPCMobile deviceHub DescriptionThe Roku app for Windows allows Roku users to control their Roku player over their home network. Features include: - Search for movies, shows, actors, or directors and easily launch the content on your Roku player or TV. Search is available today with the Roku Streaming Stick (HDMI version), Roku 3, Roku TVs, and will be available on additional Roku players at a later date. - Browse, add, and rate Channels from more than 1,800 Roku Channels offered in the Roku Channel Store. - Quickly launch your favorite Roku Channels - Name and switch between multiple Roku players and TVs - Enjoy your laptop or tablet photos and music on your Roku player or TV (Supported on Roku 3, Roku 2, Roku LT, Roku HD (model 2500), Roku TV, and Roku Streaming Stick only) THIS APP REQUIRES A ROKU PLAYER To use this app, you must connect your Windows device to the same network as your Roku player or TV. Certain features require compatible Roku players\/Roku TVs or may require logging in to your Roku account. HAVING TROUBLE FINDING YOUR ROKU PLAYER OR ROKU TV? Note: If the app does not recognize your Roku player or TV (you see a “No Roku Devices Found” message after you sign in), try going to network setup again on your Roku player. This will wake your Roku player on your home network. Then, select “Try Again” in the Roku app. Go to support.roku.com for FAQs or to get help. ScreenshotsPC","Here it is September 2019 and \"Roku is currently not available.\"","Your link is invalid.","NOW OCTOBER  '19 and \"Roku is currently not available.\"","I use the  Roku Remote App every day multiple times. It is an excellent App which is obviously why it is no longer allowed by this company! Let me guess..some former employee \/stock holder is doing custom solutions for $$$$ and pitched a fit about this perfectly working APP and Microsoft pressed the ole \"Invoke Late Stage Greed Monger Capitalism\" button and presto it's gone! The store once had the most perfect Google Play Music App that worked so well, even better then the Android version put out by Google, the MS version had integrated lyrics on command to any song you were listening too and the App was free! Needless to say it is no longer available in the loser Microsoft store and 40 more young people ditched their PC's for Chrome books...WAY TO GO!","because ROK U workers  are MORONS and LIARS","It's here ROKU on Microsoft Store.Not sure why it's not searchable though.","\"Currently not available\" is in the upper right corner."]},{"symptom":"How to: Troubleshoot Common Setup and Stop Errors During Windows 10 Installation        Technical Level : Intermediate SummaryWindows 10 has been available in preview since October 2014. Since then, early adopters have developed a better understanding of the new version of Windows, from how it works to some of the common issues associated with using it on a daily basis. Using Windows 10 is one thing, but getting it installed successfully is another. This article dives into some of the most common errors along with possible solutions you can try if you encounter any of them during installation.DetailsPlease be sure to follow me on Twitter @adacosta for the latest tips, tricks and updates in the world of Windows 10. -Before you install Windows 10, the following are great places to start to ensure your installation can be as smooth as possible. If you continue to experience problems beyond the solutions provided, then hopefully this article can help you work around them.UPDATE: If you recently upgraded to the Windows 10 Anniversary Update or you are having trouble getting the upgrade to install, be sure to check out the following article for Questions, Issues and Answers:Windows 10 Anniversary Update: Questions, Issues and AnswersUPDATE: Microsoft recently released updates for Windows 7 and Windows 8.1 improving the stability of the upgrade experience for Windows 10. Please ensure you have the update installed for your respective version of Windows:KB3112343 for Windows 7 andKB3112336 for Windows 8.1Troubleshooting installation:How to: Upgrade to Windows 10 if you are on a slow or metered Internet connection?How to: 10 Tips before installing Windows 10How to: 10 things to do if Windows 10 Setup fails.How to: Rollback to a previous version of Windows from Windows 10How to recover data from a non booting hard disk How to: perform a repair upgrade using the Windows 10 ISO file Common blockers that can prevent Windows 10 setup from working:• Processors (which check for these features: NX, Prefetch, LAHF\/SAHF, SSE2, and CompareExchange128) • Not compatible BIOS • HDD controllers • Availability of a NIC card • Boot from VHD • Boot from Windows to Go • User is running in Audit mode • The host build is a staged build • User is running an unstaged build Also review:Windows 10 Install and Upgrade Top SolutionsGet help with Windows 10 upgrade and installation errorsFix Screen Flicker in Windows 10Please be aware even if you do not get the Windows 10 app, you can still download Windows 10 as a .ISO file, create a bootable copy then upgrade your system.How to: upgrade from previous versions of Windows using Windows 10 ISO fileSee instructions: How to download official Windows 10 ISO files ErrorSolution80240020 8007002C8024600780070004 1. Browse to \"C:\\Windows\\SoftwareDistribution\\Download\" and delete the contents of the folder.2. Press Windows key + X > Click Command Prompt (Admin) then type \"wuauclt.exe \/updatenow\".Hit Enter3. Open Control Panel > Windows Update and Windows 10 should begin downloading..Press Windows key + XClick Command Prompt (Admin)Type in at the prompt OR Copy and Paste these one at a time : (Hit enter after each)Dism \/Online \/Cleanup-Image \/CheckHealthDism \/Online \/Cleanup-Image \/ScanHealthDism \/Online \/Cleanup-Image \/RestoreHealthMake sure you use a simple machine name for your computer, at least 8 characters:Click Start, right click ComputerClick Properties Windows 8 users, press Windows key + X > click SystemUnder, Computer name, domain, and workgroup settings, click Change settings.0x8007002C - 0x4001E The installation failed in the SECOND_BOOT phase with error during PRE_OOBE operationDo not perform a clean install, instead, use the option to Keep Personal Files, Apps and Settings. If you need to perform a clean install, do so after setup is complete.How to: Perform a clean install using Reset this PC in Windows 10 Working On ItRight click the Get Windows 10 icon in the Notification AreaClick Go to Windows Update. Click Get Started.----------------------------If it doesn't say Upgrade to Windows 10, click Show all Available Updates, and check Upgrade to Windows 10 (Home or Pro), click OK, then Get Started.----------------------------If the upgrade is not available, wait for few days and try again. Once you click Get Started, the installation will start. You will need Administrator permission to continue. The installation should take about an hour (according to FAQ). Once the installation is complete, Windows 10 should install successfully. Credit: audio.01 Windows 10 approaches 100% then stops responding - Blue screen with circulating display 100% ready with no activity for long period.Check to ensure there is disk activity (look at the hard disk LED light to confirm. If there is, keep waiting. If setup goes beyond 2 to 3 hours, try the following steps.Power down the computer. Unplug it, then wait 20 mins to 1 hour.If you are using a laptop, remove the battery if the option is available. Disconnect it from the Internet (unplug Ethernet and\/or turn off Wi-Fi).Plug it again, ensure it remains disconnected from the Internet then start computer.See if it completes setup.If setup completes and you see the desktop with the ability to click Start and launch programs, proceed to reconnect to the Internet.Update drivers: How to: Install and Update drivers in Windows 10Restarted computer now I cannot find icon to resume Windows 10 setup.Click the Show hidden icons button in the Notification area then click the Get Windows 10 app.Or press Windows key + R on your keyboard then type gwx.exe then hit EnterWindows 10 Setup says I need to uninstall a program or utility in order to continue setup. I cannot find program it ask for or it was already uninstalled.Perform a clean boot, restart then try again.Look under C:\\Program Files for folders related to the application or utility in question then uninstall them. If you are running a 64 bit version of Windows, look in the C:\\Program Files (x86) folder also.Also use the search bar to look for files relating to the program then manually delete them.Create a new user account then try starting setup from there. If the problem persist, try reinstalling the application or utility then use Revouninstaller to remove it completely:http:\/\/www.revouninstaller.com  (freeware)CPU Not Compatible To install Windows 10 on your PC, the processor (CPU) must support the following features: Physical Address Extension (PAE), NX, and SSE2. Most CPUs have support for these features, so if you receive this error, it is likely because the NX feature is not enabled on your system.If your computer does support these extensions, you could still try using ISO media. In some instances, you might have to switch from your current architecture,  64 to 32 bit since these requirements mostly affect installation of 64 bit Windows 10:How to: upgrade from previous versions of Windows using Windows 10 ISO fileSee instructions: How to download official Windows 10 ISO files CompareExchange128 errorThis likely means your computers processor (CPU or brains of your computer) lacks an important instruction called CMPXCHG16B.In order to install a 64 bit version of Windows 10, this instruction must be present.Updating your computer BIOS and Chipset drivers can sometimes resolve this issue.Your CPU is probably too old and is not supported.Your best option in this case is to downgrade to a 32 bit version of Windows 10 instead, even if you are presently running a 64 bit version of Windows. If you prefer having a 64 bit version based on factors such as the amount of installed RAM, chore associated with having to reinstall applications and hardware drivers, then its best you stick with the current version of Windows installed.multiprocessor_configuration_not_supportedTry the following:- Disable Hyper-Threading in your BIOS- Disable Virtualization  in your BIOS- Check if there are any BIOS updates for your computerKMODE_EXCEPTION_NOT_HANDLEDIf you have compatible hardware and your computer stops responding, disable any unnecessary hardware. Remove universal serial bus (USB) devices; remove or disable network adapters, sound cards, and serial cards; and then restart the installation.Incompatible Video card.Uninstall Video Card adapter.Press Windows key + RType: devmgmt.mscExpand: Display adaptersRight click listed Display AdapterClick UninstallStart setup.When setup completes successfully, install the latest driver updates for device through Windows Update or from the manufacturers website using compatibilut mode if necessary;Learn more:How to: Install and Update drivers in Windows 10 Note: Some older video cards might be incompatible with Windows. It likely means the graphics adapter has or is approaching End of Life status which limits the level of support the manufacturer can provide. The card will likely function just fine for general purposes, just don't expect it to work well for scenarios such as playing games. There might even be glitches with certain casual games not working well at all.If the Get Windows 10 app still prevents installation after uninstalling the card, try using the ISO media to upgrade:How to download official Windows 10 ISO filesHow to: upgrade from previous versions of Windows using Windows 10 ISO fileIf you installed a new video card without uninstalling the old video card, you might have reinstall the old card, then uninstall it properly through device manager.Check the manufacturers website to find out the status of the video card. Check if there are at least Windows 8.1 drivers available. If there are no drivers available or manufacturer support options, you should purchase a new video card.Couldn't Update System Reserved PartitionYou get this error if the System Reserved partition in Disk Management is too small. The system reserve partition needs to be at least 450 to 500 MBs.Press Windows key + RType: diskmgmt.mscHit EnterClick the system drive to view the size.Resolution:Createasystem repair discDownload Ease us partition manager and resize it to 300 to 450 MBs. Please ensure you create a system repair disc in advance before doing this.How To Create a Windows 8 Recovery Flash DriveWindows 7 - Create a system repair disc -windows.microsoft.comFor this example, I will be using Ease us partition manager:After installing Easeus partition manager, launch the program.Select the system partition where Windows is installed.Click Resize\/Move button on the toolbarUnder Decide size and position, use the knob and drag to theleft until a desired amount of space is allocated. Look in the Unallocated Space Before: field to see how much. Once that is done, release.You will now see an unallocated amount of disk space created. Click OKClick Apply and OK to confirm changes. Your computer will be restarted to apply the changes.After restart, log in and launch Disk Management – press Windows key + R > type:diskmgmt.msc then hit Enter on your keyboard.Select the System Reserverd partition then right click it and clickExtend VolumeSelect the Unallocated space we created earlier then click Next then click FinishYou should now have a large enough System Reserved partition to accommodate Windows 10 setup.Important note: Backup your computer:When making significant changes to your computer such as updating the operating system, you should always backup. See links to resources about backing up by clicking the link for the respective version of Windows you are running:Windows XP, Windows Vista, Windows 7, Windows 8\/8.1Also review:How to manually backup and restore your files How to: 10 Tips before installing the latest Windows 10 build How to: 10 things to do if Windows 10 Setup fails. How to: Determine if an application or hardware device is compatible with Windows 10Once you have installed these important updates and followed the prerequisite instructions, you should be ready to receive yourfree update to Windows 10 this summer.Other factors:- Disconnect external storage devices such as USB thumbdrive, external hard disk, SD card.Upgrade using the ISO file:How to: upgrade from previous versions of Windows using Windows 10 ISO fileSee instructions: How to download official Windows 10 ISO files Windows Setup in continous reboot loopDisconnect all non-essential devices that might attached to your computer, Windows setup might be trying to detect them.If you are connected to a network, disconnect this also.Download the Windows 10 ISO on a working computer then perform a startup repair:Click HERE to download official ISO media for Windows 10 from Microsoft.Boot from the Windows 10 DVDTo learn how to change your BIOS options to boot from the DVD drive, see the following tutorial:http:\/\/notebooks.com\/2011\/05\/05\/how-to-load-bios-and-change-boot-configuration\/If you are installing from a thumb drive, see the following instructions how to prepare your computer to boot from one:http:\/\/windows.microsoft.com\/en-NZ\/windows7\/Start-your-computer-from-a-Windows-7-installation-disc-or-USB-flash-drivea) At the Install Now screenb) Click Repair your computerc) Click Advanced Optionsd) Click Troubleshoote) Click Startup repairf) Follow the on screen instructionsSee if this helps 80070005How do I reset Windows Update components<s","solutions":["Unfortunately, I continue to get error \"0x8007002C - 0x4000D - The installation failed in the SECOND_BOOT phase with an error during MIGRATE_DATA operation.\" As per the recommendations, I tried the solutions identified for error 0xC1900101-0x4000D and I still get the same error. Is there any way that I could get some assistance?","i don't agree about 0xc000021abecause i need to keep my filesthen if you dont want your data lost because change the partition type , you can userufus when you installing windowsthen change Partition scheme and target system type to BIOS - MBR  when you burn windows files to CD\/DVD\/Bootable","This is the third machine i've tried with a valid code that does not install","0x8007002C 0x4001E after 100 % completion, so far seems undocumented code..","Error Code 0xC1900101 - 0x30018The installation failed in the FIRST_BOOT phase with an error during SYSPREP operationHave disabled my AV, unplugged all unnecessary USB's and have tried to update using the download file several times.Each time I am receiving the above error message after first phase of installation (Copying Files) and immediately after it starts the \"Installing apps and drivers\" stage kicks me out to \"Restoring Previous version of Windows\"The error code listing states an answer as \"Suggest using IDE to install\"I am on a modern system that no longer requires IDE to operate, and is not fitted with IDE slots, only SATA Ports"," My install failed with 0x80073B92 - 0x20009 failed in the SAFE OS phasebob Alston","WE have had three admins, trying everything we could think of and this is what we think.Will only install on Retail, we tried VOlume License 7 SP1 upgrade did not work, We tried OEM upgrade, did not work.We are copying the Entire Media to the workstation instead of DVD which has to t be an 8 GIG dvd.COuld not get it to install on a USB Key.Typical Microsoft, like IE 11, EXPLODER.UPDATE:I uploaded the Windows.msi file and the media creation tool toa window 7 SP1 and finally now its working.","i have tried six times now five times it downloads,create the media,authorizes,and then just says windows 10 setup could not start reboot your pc and try again....and one time it just said....something happend...no error codes or anything....just a big circle of ****....","error code: 0xc1900101-0x40017I have tried everything given over here. In the command prompt as suggested the steps for some other error by renaming, i tried but it failed saying access denied when trying to rename with the same code. I disabled my AV, no USB attached, all the drivers in my PC updated, still for no  use. setup exits after the second phase is complete i.e. installing features and drivers and i am told that windows did not start properly with the options restart and advanced options to repair or restore. Restart gives the same problem again and again, advanced option do no good and in the end I am reverted back to my old OS win 8.1. I tried this over 3 times. It took my whole day :(. I even tried with the ISO media, but it says something happened and then stops.Now what should I do? Any help????","Initially had the 0020 error fixed that but now my install keeps hanging whenever it has to reboot.. it just sits on the BIOS splash screen and will not advance back to continuing the install.the BIOS is not something i have ever wanted to mess with.  but am familiar with what is on there.Is there something that needs to be changed on there to stop this hanging?"]},{"symptom":"Screen Flickering problem in windows 10        I found solution of Screen Flickering Problem in Windows 10 Why this Happen","solutions":["Hello nk_986, I'm Didi, an independent advisor. For how many time have your screen been flickering ? Did it happen right after doing something special, for example updating your computer or installing an application ?Please check this answer provided by Greg Carmack, it might help you to solve your screen flickering issue (scroll down to see his answer) :https:\/\/answers.microsoft.com\/en-us\/windows\/for... Regards, Didi","updating a application","Hi nk_986, Can you please confirm that your problem happened after updating an application ?If that's the case can you tell us what is this application so we can help you better ?Also check Greg Carmack's answer that I posted before. Regards, Didi","Screen is death some how i mange to retain it."]},{"symptom":"related to microphone        Hello sir ,      Microphone is not working now and sometime touch padis not working, so give me solution.       Regards ","solutions":["Hi HS. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I'll give you all steps to fix Microphone and Touchpad, then be standing by to help as needed:MICROPHONE - I will give you all possible Microphone fixes to try in sequence. Even if you've already tried one I'd do it in this order as one step may affect the next.Please run the Recording Sound troubleshooter at Start button > Settings>Update & Security>Troubleshoot.Try these fixes next: https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/win10faq.com\/fix-microphone-settings\/https:\/\/www.howtogeek.com\/395296\/fix-my-microph...http:\/\/maxedtech.com\/fix-microphone-not-working...https:\/\/www.makeuseof.com\/tag\/fix-microphone-pr...Some report that what worked is turning off Fast Startup at Settings > System > Power & Sleep > Additional Power Settings > Choose what Power buttons do > Change Settings Currently Unavailable > uncheck the box for Fast Startup, Save Settings. Restart and then disable Hibernate file to clear it, restart PC again and enable Hibernate again:https:\/\/www.groovypost.com\/howto\/enable-hiberna... Right click the volume icon in System Tray at right end of task bar, open Recording Devices, see if the microphone is listed, set it as Default device.Type Microphone in Start Search, open Set up Microphone, scroll down to Microphone and choose Get started to set it up.Try rolling back the sound controller drivers in Device Manager reached by right clicking the Start Menu. Choose Sound controller device, then Driver tab, then Roll back if available.Update the Sound drivers from the PC's Support Downloads web page. While there make sure you also have the latest Chipset, Display, Network, USB and all other drivers, comparing with the version presently installed in Device Manager.If no newer driver then uninstall the ones presently installed in Device Manager, reached by right clicking the Start Button. Restart PC to reinstall.When did this behavior begin? If you have an idea you might be able to System Restore back to a point before it began:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t... TOUCHPAD - Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpIf this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Update History, then uninstall them from the link there, and immediately check for these again and hide with the Hide Updates tool explained here: https:\/\/www.howtogeek.com\/223864\/how-to-uninsta...You can also go into Repair Mode by whichever method works here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc... to use the new Uninstall Updates button in Advanced Troubleshoot Options:https:\/\/pureinfotech.com\/uninstall-updates-adva.... You can also use System Restore from within Windows or the above Repair Mode to get back before the problem began, then check for Updates with the Hide Update tool and hide them:https:\/\/www.windowscentral.com\/how-use-system-r...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....If that doesn't work you can also Go Back in Repair Mode as shown here: https:\/\/www.tenforums.com\/tutorials\/2294-advanc...If nothing else works then do a Repair Install, by installing Media Creation Tool, open tool and choose to Upgrade Now. This reinstalls Windows while keeping files, programs and most settings in place, and is also the most stable method to advance to the latest version. http:\/\/windows.microsoft.com\/en-us\/windows-10\/m... I hope this helps. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Surface Pro (5) touchpad not acting right        Hello-My Surface Pro touchpad is not acting right again... It lags badly, scrolls opposite of the way I'm trying to scroll, and does this a little more or less depending on the website or app I'm using (Word is bad!)The last time I had this happen I had to do a clean install of Windows 10, but this fix only works for a while, apparently. I also get a different problem, where I get no sound from my headphones for YouTube videos and I have to re-install the driver to restore sound (although weirdly, I can hear the test sounds from the diagnostic tool.... Why?) Both of these problems occurred together about a year ago, and were only resolved after a clean install of Windows 10.So, within the past two days I have updated the pc, re-installed the touchpad drivers, done a reset of Windows 10 from the Surface link in Update and Security, done another reset of Windows 10 from the MS website, and nothing has changed. It looks like I need to load 1909 on a flash drive on a different pc before these problems are fixed again, temporarily anyway.Why is this a reoccurring problem? Why do I get these two problems together? Is there anything else I should do?Thanks for any suggestions.","solutions":["Hi JH. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.See if the Surface Diagnostic toolkit finds anything: https:\/\/support.microsoft.com\/en-us\/help\/403723...Make sure you have all the latest drivers and firmware from here: https:\/\/support.microsoft.com\/en-au\/help\/402348...I'll also give you everything for touchpad and headsets which are chronic problems here and have known fixes as follows:TOUCHPAD - Update the Touchpad driver from the PC maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you also have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.If that doesn't help then enter Device Manager reached by right clicking the Start button, go to Mice > Touchpad and then Driver tab. Choose Update Driver, then Automatic to see if it gets a better driver that resolves the problem. If not try Update Driver > Browse > Let Me Pick to try all previously installed drivers. If that doesn't work then try uninstalling driver, Restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver.See the troubleshooting steps here: https:\/\/support.microsoft.com\/en-in\/help\/402786... Go to Settings > Devices > Touchpad to go over the Settings. Then choose Additional Settings which opens the Mouse properties box. The Touchpad software installs a tab onto it - usually the last one - that should have more settings to check, including a checkbox to Disable Touchpad when USB pointing device is attached. This prevents palm drag from causing the cursor to jumpHEADSET - I'll give you everything possible to try for headset problems so at least something will work. If you need help performing any steps I am standing by here to help:First try the steps here: https:\/\/www.maketecheasier.com\/fix-headphones-n...https:\/\/www.windowscentral.com\/setting-your-hea...https:\/\/www.lifewire.com\/fix-headphones-not-wor...https:\/\/www.thewindowsclub.com\/headphones-not-w...https:\/\/merabheja.com\/fix-no-speakers-or-headph...https:\/\/troubleshooter.xyz\/wiki\/fix-headphones-...Go to Settings > Devices > Autoplay to look for the device and change the default behavior in it's Dropdown Menu.Right click Volume icon in System Tray at right end of task bar, Open Sounds Settings, in dropdown menus at top make sure Headphones are selected and Connected for both Playback and Recording Default Devices.If not again right click Volume icon in System Tray to choose Troubleshoot sound problems.See how to re-enable the \"Which device did you plug in\" popup which can solve headset issues:https:\/\/windowsreport.com\/you-just-plugged-unpl... (avoid ad links)https:\/\/h30434.www3.hp.com\/t5\/Notebook-Audio\/En...https:\/\/forums.tomshardware.com\/threads\/how-do-...https:\/\/www.dell.com\/community\/Windows-10\/How-g...https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to the Device Manager reached by right clicking the Start button, choose Sound controller device, on Driver tab choose Roll back or Uninstall, restart PC using keyboard to Ctrl Alt Del, on blue screen tab to Power Icon in bottom right, press Enter, arrow down to Restart, press Enter to restart to reinstall the driver. Do the same for the headset device and\/or it's microphone. Update the Sound driver from the PC or Device maker's Support downloads web page. While there also check that the Chipset, BIOS, Display, USB, Network and all other drivers are the most current.If this was caused by Windows Update(s) then you can check which were installed at Settings>Update & Security>Windows Update under Installed Updates, then uninstall them from the link there, and hide with the Hide Updates tool downloaded from here:http:\/\/download.microsoft.com\/download\/f\/2\/2\/f2... You can also use System Restore to get before the problem began, then check for Updates with the Hide Update tool and hide them:http:\/\/home.bt.com\/tech-gadgets\/computing\/how-t...If this was caused by a Version Update then for 10 days you can roll it back in Settings>Update & Security>Recovery and then hide it until it matures using the Hide Updates Tool which is explained more here:https:\/\/www.howtogeek.com\/223864\/how-to-uninsta....To check over the integrity of your install go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files. Then continue with the other steps to go over your install most thoroughly. If nothing else helps you can run a Repair Install by installing the Media Creation Tool and choosing from it to Upgrade Now. This reinstalls Windows in about an hour while saving your files, apps and most settings, solves many problems while also bringing it up to the latest version which you need anyway and by the most stable method.http:\/\/windows.microsoft.com\/en-us\/windows-10\/m...If you want to report this to Microsoft use the Feedback Hub app in Start Menu where developers are tasked to process consumer feedback. They will not even see it here. This is a tech forums staffed mostly by volunteers trying to help others with your problems.If you want to post back a Share link from your Feedback here others who see this thread can vote it up and add to it. If you are an Insider I can also vote it up with my MVP badge and track the issue for you.I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"re-install registry log.txt (audio divice)        re-install registry log.txt (audio divice)","solutions":["Hello A pleasure to help you as an Independent Advisor. In relation to the incident, I would like to know more in details about what you want to do.Let me know to continue helping. Regards","Hello Gustavo: As your name is Latin I presume that we can try to solve my problem in Spanish  But being this the first contact I will keep it in English.Several weeks ago I was forced to do a \"restore\" of my PC for some small problems. After I get back to my system, files and programs, I noticed that my sound system was off. It was working perfectly before the \"restore\".I have tried several instructions given by various sites after my request. But every time I get: \"no audio device find\". If I am not wrong the ID of the 'audio device driver' is \"Registry log.txt.I have tried a various items with no luck.Please help me in this.Advice thanks.Walter Rodriguez*** Email address is removed for privacy ***Bartow, FL","my input and out put speakers dont work?","re-install registry log.txt (audio divice)","re-install registry log.txt (audio divice)","re-install registry log.txt (audio divice)"]},{"symptom":"cannot send emails windows 10        cannot send emails windows 10","solutions":["HI Greg. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Is this Office Outlook or outlook.com in a browser? If the latter try another browser.If it's Office then see here for when Office Outlook can't send emails: https:\/\/www.lifewire.com\/outlook-not-sending-em...https:\/\/support.office.com\/en-us\/article\/my-mes...https:\/\/www.dell.com\/support\/article\/us\/en\/04\/s...If those don't work then try repairing Office: https:\/\/support.office.com\/en-gb\/article\/repair...https:\/\/www.groovypost.com\/howto\/repair-microso...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows 10 crash cannot be repaired        My computer disk crashed. Initially the PC tried to repair but failed and prompted multiple options for recovery. However, it failed to recover from my backup image. With many trials and errors, I finally got a text mode error message titled \"Windows Boot Manager\". Please see the attached image. The PC does not recognize my USB recovered disk anymore unless I disconnect the boot hard disk.I guess I have to replace the hard disk. However, how do I re-install windows 10 since my backup image did not work? Thanks.","solutions":["Does one of the option screens look like thisIf so can you select and run Start-up Repair.","\"Start-up Repair\" did not work when it was available. It said system cannot be repaired. It was the initial screen when the booting problem just happened. After many trials and errors by trying to run system backups. Now every time I restarted the computer, it gave the \"Windows Boot Manager\" screen. The computer did not show the repair screen at all unless I disconnected the hard disk. But without hard disk, the Advance Options screen is useless.","Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You need to try and change the Boot Sequence for the computer - when the hard disc is connected the boot order is causing it to load from that and not even look at the USB drive.If you can get your USB drive to boot with everything connected you could then reinstall Windows.You'll need to try and get it in to the BIOS setting page at initial switch on - this varies by computer and can be tricky with a UEFI boot mode set. Right after switch on (before that boot error appears) does the computer give any prompts such as \"Press ESC for Boot options\" or similar? Often F2, F12, ESC, or another F Key will allow you to get either to the BIOS (to change the boot order) or just directly bring up a boot selection where you can choose you USB drive.Regards, David","By changing boot sequence, I was able to have the computer recognize the USB drive. However, recovery from the backup file still failed. I then tried to use the install USB drive prepared with media creation tool on another computer. The problematic computer rebooted through the install USB drive. It requested the product key during installation. I selected \"don't have the product key\" as I didn't rewrite down the numbers before the computer crashed. Then the process showed no update is available and stopped installation. I un-installed the hard drive and put it on a drive dock connected to another computer to check the HD. I noticed that all the contents were wiped out. Only partitions were reserved. I guess the disk was wiped out by an attempt of restoring my backup system file. Any way to reinstall Windows 10 without knowing the product key?","I'm afraid that a failed restored may be responsible for the drive appearing blank, yes. Although it could also be that there's a fault with the hard drive. As you already have the drive in a caddy on a different computer you could test the drive for faults by using Seagate's drive fitness test software - this is free and works even if the drive is not a Seagate. You want \"Seatools for Windows\" fromhttps:\/\/www.seagate.com\/gb\/en\/support\/downloads... Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. As for the Product Key - there's no need to enter it because you are reinstalling on the same hardware - just skip it as you did and once Windows has installed it should reactivate automatically. Note that you must choose the same version as you had before (Home or Pro). The fact that the install stopped after you selected you didn't have the key is a different problem - perhaps because of a possible HDD fault?","Looks like the Windows Boot Manager (the boot loader for newer versions of Windows since Windows Vista) is failing to load the BCD (Boot Configuration Data, contains essential settings for Windows booting.)The \"Status: 0xc000000f\" line and the information actually tells a lot about what is happening. That's an NTSTATUS code indicating the file couldn't be found. (STATUS_NO_SUCH_FILE in case you needed to know the specific error text.) The \\EFI\\Microsoft\\Boot\\BCD file is missing entirely, and that's critical for boot.\\EFI\\Microsoft\\Boot\\BCD isn't a directory path you're likely to see in normal operation. It's not on the C drive but rather on a special partition newer systems have called the EFI System Partition, which you guessed it, contains boot-critical files. So to fix this we will need to recreate the BCD information.You will need to have installation media on hand, because you need to be able to get to a command prompt in Windows PE, which is the environment Windows Setup normally uses. I wouldn't try to look for a recovery partition because the backup shenanigans likely removed the way to access it.Once you have install media, don't go to install now. Instead, press Shift-F10 (hold shift, press f10) to open a command prompt. Look for the drive letter that your system drive is assigned to (The one with the Windows directory, and that isn't lettered as drive X).Once you've found it, run these commandsbootrec \/fixmbrbootrec \/fixbootbcdboot [driveletter]:\\Windows","There is no Windows on the disk anymore. At least it is not displayed. The whole drive looked blank when I checked the disk on a disk dock. Anyway, I went ahead and tried bootrec \/fixmbr, it was successful. But when running \"bootrec fixmbr\", I got a message \"access is denied\". So I stopped there.I replaced the HD with another one and tried running the install USB drive. This time it went through and the windows was installed. Unfortunately, all my settings and software installed were gone. Good thing was that I had backup of data. I can move them back to the computer. Additional note: I cannot say if I can trust Dell's restore program anymore (Dell computer). The restore program started and failed, which wiped out everything on the hard disk.Thanks for all your responses and advices."]},{"symptom":"My Default Mail will not send emails.        When I prepare an email in my default MAIL, then click SEND, a message states there was an error in sending your message NOT SENT.How is this corrected.","solutions":["Don't call this number, it's spam.","Hello Jmnorth79! My name is Marco, I am an Independent Advisor. I will do my best to help you.What software do you use for your emails?","I  use:   *** Email address is removed for privacy *** DEFAULTothers I use: *** Email address is removed for privacy ***When you say software I was kind of confused. I have Windows 10Hope this answers your question.Look forward to your reply","When I ask 'Which software do you use' it is to know if you open your emails using the 'mail' program of windows, or if you go on the internet with Edge, firefox or chrome on the outlook page. Com or whatever.","I use Windows 10 mail program. The other funny thing is I can pull up Outlook on my Iphone and send emails but not on Desktop Windows 10.I will look forward to your reply. John North"]},{"symptom":"Update Windows 10 version 1909 from 1809 shuts down        My laptop is currently running Windows 10 version 1809.  When i try to update to 1909 it begins nicely and tells me that i have everything i need.  I start the update and it seems to progress easily, going through the multiple restarts it warns me about.  After a couple of restarts the computer just shuts down and i have to manually turn it back on.  When i do that it gives a message saying “undoing changes made to computer” and reverts me to 1809.  I’ve tried multiple times with the same issue.  If it makes any difference, the battery to the laptop is bad so it has to be plugged in or it will shut itself off.","solutions":["Hi Falcon. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.I can give you troubleshooting steps for the battery which may need replacing. Until then you can unplug it if possible so it doesn't interfere, and use the power adapter.See steps here for Overcoming Version Upgrade Failures: http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... if these fail you may have a problem that requires wiping the drive to get it cleanest during a Clean Install following the illustrated steps in this link which include everything that works best in Windows 10:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]}]}