{"windows":[{"symptom":"Can't see entire path in File Explorer - Windows 10        I'm new to Windows 10, but I don't see how to fix this.When I search in file explorer, I only see (3) two-line columns: File nameDate ModifiedStart of file pathFile name Start of contentFile SizeAuthorI believe I've asked for all data to show, but I can't make any of the columns wider, and I can only see part of the the file name and path name.If I'm looking for a file in a particular folder, I can't see the entire path. Is there a way to fix this?I'd like to have the path name in its own column, is that possible?Thanks for any help.","solutions":["Hi KSA.ga,No it's not you.  I've done a search myself and can see now exactly what you are describing.  I think this is just the default screen in Search.On the top toolbar, click on 'View' and you will see that 'Content' is highlighted.  Now click on 'Details' instead and now the 'Path is revealed, if you have selected it as described above, and you can alter the column widths as before.For now under 'Content' all you could do is maximise the search window and hover your cursor over the path and it will show the full path in a tooltip. Some file types don't even reveal the Path in search, such as photos.  For them you have to right click on them and choose 'Properties'.  The Path is shown at 'Location', and again you can hover your cursor over the Path and it will show in full via a tooltip.For Photos, you can best obtain the 'Path' by not using search and going to any folder or file and choosing any 'View'.  If you click in a blank section of the top 'Location' strip, it will change to show the full Path, and this can be copied if required.  This works for most folders.I hope this is helpful.Cheers."]},{"symptom":"Ion VCR PC 2 Drivers        I had wrestled with the drivers not working in windows 10 this what I did : I found a driver on the Arcsoft site, unzipped to a folder on PC, device manager, r\/click vcr to pc2 app, update driver, pointed to drivers I'd  downloaded and it worked!","solutions":[]},{"symptom":"If i create another Administrator user,how much Gb will it steal from my C: (main) drive?        I want to create another user but how much gb does it steal from main drive ","solutions":["Hello BatuhanYurtseven, Creating another user account in windows 10 uses very little space in itself. Once using the account anything you do on the account will affect its size. For example if you are on that account and download anything it will count towards the space used by that account.","So if i download anything on my new user it just take space from my Main Drive like my first user? ","Yes that is correct. It would take up space the same as using the other user on the pc."]},{"symptom":"Windows 10 - changing default user        I  giving my computer to my friend. I want to change the default user (i already created a new admin user) and make sure they cam access appstore and has microsoft edge. Then i want to remove my profile (original default profile) completely. How do i do this with windows 10?","solutions":["Hi BeaM_1124 Log out of your user account Log into your new account Click the Start Button, type netplwiz and hit Enter In the resulting dialog, select your old account and click 'Remove' That's It, the new Admin Account will replace your old account"]},{"symptom":"Icon overlayer problem or double plates remove problem        problem icon","solutions":["Hello, I’m Virginia an independent advisor with 20 years of expertise in fixing my own & friends’ PC problems.Which Windows version are you running - 1809, 1903 or 1909? Unfortunately this isn’t down to Microsoft but is up to the developer creating their icons ‘fullscreen’.You should contact them directly & request they improve their integration with Windows start menu."]},{"symptom":"can't activated windows 10 pro please help me        Split from this thread.can't activated windows 10 pro please help me","solutions":["can't activated windows 10 pro please help meHello,Please run Activation Troubleshooter:1. Open Settings app, navigate to Update & security > Activation.2. Click on Troubleshoot link to launch Activation troubleshooter.3. The troubleshooter will automatically detect the issue and fix it.Let us know if issue still persists! ","Hi,Hope you can help have tried Microsoft help,but no help.Am trying to activate windows 10pro which I downloaded from windows 7 home. My internet explorer stopped me from going straight to windows 10 just would not work so was told to upgrade to 8.1 the to 10 How I got pro version don't know,because of the roundabout way I think I have lost my free activation.Have tried all suggestions but nothing works.Firewall stopping me downloading tools to help,can you help"]},{"symptom":"Another 0xC1900101 - 0x4000D The installation failed at the SECOND_BOOT phase with an error during MIGRATE_DATA operation!        Today, I again tried to install W10 on my W7 PC via the Media Creation Tool. It seemed to be going OK, but, like for many other people, it failed and I got the message:0xC1900101 - 0x4000D The installation failed at the SECOND_BOOT phase with an error during MIGRATE_DATA operationFrom looking around the net, it appears to be a bad driver that's causing the problem. Is there any way to find out what this driver is? I really would like to have W10 running before the W7 cutoff date.","solutions":["Hi,Let us check the Installation log to find why the update failed. Please share the logs as mentioned in this article. You should use a File sharing service like Onedrive or Media Fire to upload files and share the link in the next reply.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/troubleshoot-feature-update-install-failures\/eaf4ff24-64d6-4c72-824c-3ba3df716fc3The Panther logs. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\PantherThe Rollback logs: These usually are created if Windows Update rolls back. Files named Setupact.log and Setuperr.log from the following path C:\\$Windows.~BT\\Sources\\Rollback[Only if the error code is 0xC1900101-0x30018] The Device Install Log from C:\/$Windows.~bt\\Sources\\Rollback\\setupapi\\setupapi.dev.logAs the log size might be large consider zipping before uploading.","Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive an error, ‘0xC1900101 - 0x4000D The installation failed at the SECOND_BOOT phase with an error during MIGRATE_DATA operation’ when trying to upgrade to Windows 10. I’ll certainly help you with this issue. However, please let us know: What is the make and model of the computer that you are using?Have you purchased a license for Windows 10?Do you have any third party security software installed? As you already know, an error that begins with 0xC1900101 is usually a driver error. You may want to refer the steps mentioned in the articleGet help with Windows 10 upgrade and installation errors. Note: If you disable the security software or firewall, the system might be temporarily exposed to security threats and risks. Please make sure to turn it on after performing the steps. I would also suggest you to refer the steps mentioned below:  Hardware clean boot: I suggest you to follow the steps mentioned below and disable the devices is Device Manager: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hit enter.Now, expand Display adapters, Printers, Sound, video and game controllers one by one.Right click on the devices inside the section and click onDisable device.If asked for restart click on restart later and disable all the devices.Close the device manager window. Once all the devices are disabled, you can perform clean boot. Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  After performing clean boot, proceed with the installation.  Note: Please refer the section Reset the computer to start normally after clean boot troubleshootingto boot the computer in to normal mode after troubleshooting. You may also want to look at the troubleshooting steps for the error code in the articleResolution procedures. Note: Modifying BIOS\/ complementary metal oxide semiconductor (CMOS) settings incorrectly can cause serious problems that may prevent your computer from booting properly. Microsoft cannot guarantee that any problems resulting from the configuring of BIOS\/CMOS settings can be solved. Modifications of the settings are at your own risk. Let us know the results.  Regards,Nikhar KhareMicrosoft Community - Moderator","HelloThanks for your prompt reply. I've uploaded the Setupact.log and Setuperr.log files to One Drive.https:\/\/1drv.ms\/u\/s!AqXQaJB_NSjLam2KBKXXanP6lEI?e=lrUTV4https:\/\/1drv.ms\/u\/s!AqXQaJB_NSjLa3ipj6_so-zV9RE?e=jamqgHI hope these help detect where the problem lies.","Neither of the files you posted are the complete instance.  The Setupact.log is very large and should be in the folder indicated.  The setuperr.log is small but you can combine them both in a Zip folder and provide the link.  Make sure they finish uploading to OneDrive..C:\\$Windows.~BT\\Sources\\Panther","HelloOh, that's strange. I've put a zip folder in my One Drive now that contains two folders - Panther and Rollback. Hopefully, this may work.https:\/\/1drv.ms\/u\/s!AqXQaJB_NSjLbCU5zd9rW2K58Mw?e=mi5OnRThanks for your help.","The Rollback ones were OK, the Panther files need to be replaced with good ones.","Hi Carl,The files may have been removed by Windows. Can you please try once again and let it fail and share the logs?","I tried this, again, today from a clean boot, but it still failed. I have put all the files in a zip as before. Please find it at:https:\/\/1drv.ms\/u\/s!AqXQaJB_NSjLbSyPoHJQpiYgQm0?e=HGgWtOAgain, I thank you for any help you can give me.","Something does look a little strange in your setupact.log, Carl..  The line below is one of many and the log actually ends while going through this process.  I picked a few lines at random but it is looking at the all the files.  The(1) may have some significance since the same locations are checked earlier and did not seem to have a problem.I am not sure what wbem is except possibly related to WMI and some type of management utility.  The fact the log shows it cannot find the short path, whatever that means.  Perhaps check your system or do a system file check to see if something is showing up there.  (use admin command prompt sfc \/scannow)You might also check your registry for entries regarding this and if you don't know how, just ask.  If the registry contains entries pointing to another location, it may be confusing the installer.MIG    Cannot apply recursively object: C:\\Windows\\SysWOW64\\wbem\\tmf: Win32Exception: The file exists. [0x00000050] void __cdecl Mig::CUpgradeTransportStreamProxy::CreateFolder(class UnBCL::String *,int,int *,struct ILocalProgresMIG    CPathStringDestFixer::FindDestPath, Unable to get short path for C:\\Windows\\System32\\wbem\\cimwin32(1).mof: Win32Exception: C:\\Windows\\System32\\wbem\\cimwin32 (1).mof: The system cannot find the file specified. [0x00000002]MIG    CPathStringDestFixer::FindDestPath, Unable to get short path for C:\\Windows\\System32\\wbem\\interop (1).mof: Win32Exception: C:\\Windows\\System32\\wbem\\interop (1).mof: The system cannot find the file specified.MIG    CPathStringDestFixer::FindDestPath, Unable to get short path for C:\\Windows\\System32\\wbem\\scrcons(1).mof: Win32Exception: C:\\Windows\\System32\\wbem\\scrcons (1).mof: The system cannot find the file specified.","Another question..  You appear to have two installs on your system.. Are you dual booting and if so, can you remove the other install while you upgrade the primary install?You do have two active partitions on your system, so if you remove a drive, make sure the boot files are still on the remaining drive."]},{"symptom":"Windows 7 upgrade to W10        Hi. I want to upgrade from Windows 7 to Windows 10, the thing is, that my PC doesn't have Windows 7 activated so I can't upgrade! I dont have the product key and I can't find a new one anywhere! What can I do? Or will I be stuck with Windows 7 for ever? Thanks!","solutions":["Hi. I want to upgrade from Windows 7 to Windows 10, the thing is, that my PC doesn't have Windows 7 activated so I can't upgrade! I dont have the product key and I can't find a new one anywhere! What can I do? Or will I be stuck with Windows 7 for ever? Thanks! If Windows 7 isn't activated and you were to upgrade to Windows 10, Windows 10 won't be activated either.Your choice what you buy and where from.Microsoft does not sell 7, only 10.If you are going to BUY 10, which would be cheaper than buying 7 elsewhere:@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700Cheers."]},{"symptom":"how to update browser on windows 8.1        how to update browser on 8.1","solutions":["Windows 8.1 has Internet Explorer 11 and that's it.Ant Security Updates for it come out in the regular monthly Windows UpdatesIf you wish, use a different browser: Firefox, Chrome,. etc."]},{"symptom":"How to stop the preview window from opening with Sticky Notes?        I just downloaded Sticky Notes from the Microsoft Store, as I remembered it being useful back when I used 7. It has a new feature, however; a large \"Preview\" window that I can use to make new notes and edit my settings. I don't want it to open, though; I only need the Sticky Note itself, not the Preview window as well.I tried the method discussed here, but it doesn't seem to work for me; the Preview window opens regardless, every time. I really just want a new note to open when I open Sticky Notes.Does anyone know how to disable the Preview window from opening alongside a new note?","solutions":["Hi Yuckyrat and thanks for reaching out. My name is Joseph. I'm an independent adviser. I'll be happy to help you out today.Please follow these steps: Open Sticky Notes. Click on the Menu (3-dots) button. Click on the Settings button. Turn off Enable insights. I hope this helps. Feel free to ask back any questions and let me know how it goes. I will keep working with you until it's resolved.Thank you!","Sadly, this didn't seem to work. It was already off, but I tried turning it on and then off again just in case.","Hi Yuckyrat, May you please provide screenshot? Thank you!","Sure thing! Here you go.2nd image is what comes up when I open the program. The Preview window actually overlaps the Sticky Note itself, so I had to put it in front to show it was there.","Hello Yuckyrat, Farah is here Have you tried resetting the app? - Please type in start menu Apps & Features, then search for Sticky notes. - Click advance options, you'll see down an option to uninstall or reset. - try resetting it. Please let me know if it works out for you. Cheers! Farah","Sadly, this didn't fix it; it seems \"enable insights\" is disabled on default, and enabling and disabling it does nothing. :(","\"Sadly, this didn't fix it\" do you mean resetting the app?","Yes, sorry for not specifying.","Resetting the app should've done it. Sorry that it didn't help. I hope someone else could resolve this.","Hi there, I'm from the Sticky Notes team. I believe you're referring to the \"notes list\", which is a handy hub for all your notes. You can close sticky notes and they will be in the notes list for you to reopen later, so that you don't have to make a choice between deleting a note and having it cluttering your desktop. There are sometimes bugs which cause the notes list to be quite large, which it looks like you are running into, you can resize it by using your mouse to drag the edges of the window to be the size you desire. If you don't want to see the notes list at any time, you can close it. If the notes list is closed when you close the app or restart your computer, it will stay hidden until you re-open it, which you can do by hitting the \"...\" and then \"notes list\" on any note. We do not have an explicit setting for this feature.Let me know if you have any other questions!Thanks,Allie"]},{"symptom":"Wi-Fi driver problem        I am having a problem with my new laptopsometimes when i open it there is no WiFi at allwhen I go to the settings it shows that i have a problem with the driver for the WiFi adapterhttps:\/\/imgur.com\/3pdp2bHI tried uninstalling and installing the drive and it worked but it keeps happening every couple daysis there a way to stop this ?","solutions":["Hi elyestenzakhti Have you tried to run the Network Troubleshooter? Follow the instructions below. 1. Go to settings. 2.Choose the Update & Security, 3. Then click \"Troubleshoot\", then select \"Internet Connections\", > Click \"Run the troubleshooter\"."," I tried but nothing changed ","Hi, Try to run these commands on CMD. netsh winsock reset netsh int ip reset","I did this before and it did fix the problem but it keep happening every few days  ","Hi, Can you provide the following information which may help determine any issue(s): Windows Key + R > type msinfo32 in the \"Open\" box > OK > File > Save > then save as an .nfo fileThen make the resulting .nfo file available via a public folder on OneDrive or similar site.Also, can you do the following: Windows Key + R > type eventvwr in the \"Open\" box > OK > expand \"Custom Views\" and then right-click \"Administrative Events\" > select \"Save all events in Custom View As\" and save as an .evtx fileThen make the resulting .evtx file available via a public folder on OneDrive or similar site.Here's a link on using OneDrive: https:\/\/support.office.com\/en-us\/article\/share-..."]},{"symptom":"Windows media player        when I rip my CD's into FLAC files and transfer my favorites songs  to my Sony digital Walkman. Their are no album pictures and only about half have track and artist information.When I used the simple MP3 format I had everything.","solutions":["Hello Richard, It is recommended that when ripping to flac to use an alternate program instead of windows media player. A quick google search should render some options available for you. As they are not microsoft products, i advise that you do research of your own on them and proceed with caution when using anything non Microsoft. Please proceed at your own caution when downloading anything from a non Microsoft verified site."]},{"symptom":"Restore Windows 10 Start Menu        How do I restore the start menu? I did an update and now my Start menu isn't right. Please help me restore it back to before I did the update","solutions":["Hi Creature2004_619 Please explain what you mean by your Start Menu 'isn't right', does you Start Menu open when you click it, or is it that is looks different and if so, in what way is that different . .If that is opening, please provide a screenshot of your Start Menu)","Hi Creature2004_619 Please explain what you mean by your Start Menu 'isn't right', does you Start Menu open when you click it, or is it that is looks different and if so, in what way is that different . .If that is opening, please provide a screenshot of your Start Menu) When I go to Shut Down my laptop the Start menu under Recently Added goes away and the Start menu pops out","Hi Creature2004_619 Please explain what you mean by your Start Menu 'isn't right', does you Start Menu open when you click it, or is it that is looks different and if so, in what way is that different . .If that is opening, please provide a screenshot of your Start Menu) When I go to Shut Down my laptop the Start menu under Recently Added goes away and the Start menu pops outI don't know how to do screenshot's","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please go to Start > Settings > Personalisation > Start. Then make sure you have \"Show recently added apps\" and \"Show recently opened items in Jump Lists on Start or the taskbar and in File Explorer Quick Access\" turned on.If these still do not resolve your issue, please see any of the images in this article is what you wanted:https:\/\/www.windowscentral.com\/how-disable-rece... Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.Please go to Start > Settings > Personalisation > Start. Then make sure you have \"Show recently added apps\" and \"Show recently opened items in Jump Lists on Start or the taskbar and in File Explorer Quick Access\" turned on.If these still do not resolve your issue, please see any of the images in this article is what you wanted:https:\/\/www.windowscentral.com\/how-disable-rece... Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Hi and thanks for getting back to me. No that  wasn't my problem. The Start menu pops out when I go to shut down my 2 in 1.","Do you use the touch screen or mouse\/mousepad?Do you click on Windows Start button, Power to shutdown? Were you interrupted by start menu because of that?","Is this what happened on your start menu? This 'automatic expand' is a new feature which was introduced in Windows 10 v1903.Read More: Change in start menu ...","How do I restore the start menu? I did an update and now my Start menu isn't ri","Is this what happened on your start menu? This 'automatic expand' is a new feature which was introduced in Windows 10 v1903.Read More: Change in start menu ...Yes that's what I mean. Please tell me how to change it back"]},{"symptom":"When Intel Graphics Command Center launches, it is stuck on loading        Hi, I've had a problem for the past few months with the Intel Graphics Command Center. THe title honestly says it all. Here is what it looks like when I laucnh it.","solutions":["Hi Mr Meemzo The best first option would be to uninstall that and then download and install the latest version from the the Microsoft Store . . .https:\/\/www.microsoft.com\/en-us\/p\/intel-graphic...If that does not resolve this for you, go to the support page fro your PC on the manufacturers website, then from there, download and install the Intel Graphics device driver they recommend for your PC . . .","Hi there, I have already gotten the latest and best intel graphics drivers for my pc. By the way, if you need them, here are my pc specs : OS Name Microsoft Windows 10 HomeVersion 10.0.18363 Build 18363Other OS Description Not AvailableOS Manufacturer Microsoft CorporationSystem Name LAPTOP-L1JMNK2PSystem Manufacturer RazerSystem Model BladeSystem Type x64-based PCSystem SKU RZ09-02705W75Processor Intel(R) Core(TM) i7-8750H CPU @ 2.20GHz, 2201 Mhz, 6 Core(s), 12 Logical Processor(s)BIOS Version\/Date Razer 01.01, 8\/31\/2018SMBIOS Version 3.1Embedded Controller Version 1.01BIOS Mode UEFIBaseBoard Manufacturer RazerBaseBoard Product DANA_MBBaseBoard Version Platform Role MobileSecure Boot State OnPCR7 Configuration Elevation Required to ViewWindows Directory C:\\WINDOWSSystem Directory C:\\WINDOWS\\system32Boot Device \\Device\\HarddiskVolume3Locale United StatesHardware Abstraction Layer Version = \"10.0.18362.387\"User Name LAPTOP-L1JMNK2P\\Kolya GreensteinTime Zone Mauritius Standard TimeInstalled Physical Memory (RAM) 16.0 GBTotal Physical Memory 15.9 GBAvailable Physical Memory 7.85 GBTotal Virtual Memory 18.7 GBAvailable Virtual Memory 7.67 GBPage File Space 2.75 GBPage File C:\\pagefile.sysKernel DMA Protection OffVirtualization-based security Not enabledDevice Encryption Support Elevation Required to ViewHyper-V - VM Monitor Mode Extensions YesHyper-V - Second Level Address Translation Extensions YesHyper-V - Virtualization Enabled in Firmware YesHyper-V - Data Execution Protection YesSorry if that is a little too much! It's the only way I can copy\/paste my specs!","Hi, Try the following link from Intel: https:\/\/www.intel.com\/content\/www\/us\/en\/support...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Non-system disk error        Hi, I was stuck on the windows 10 recovery blue screen like this:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/windows_10-performance\/computer-wont-boot-stuck-on-blue-recovery-screen\/084b8ddc-6ace-4581-a5d8-0491748dcb1aSo I started to follow the solution that was told at the person on the forum but when I boot with the usb drive in it saysNon-system diskPress any key to rebootand it don't work. I already tried to recreate my bootable usb key but it didn't changed ty for helping (sorry for misstakes English isn't my first language)","solutions":["Hi, Raphael My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try entering Safe Mode to repair Press and hold the power button for 5 to 10 seconds to perform a complete shutdownDo this three or more times. Windows will start in the Recovery Environment and from there you can access System Repair, Safe Mode, Command PromptGo to Troubleshoot - Advanced options - Reset this PC Then you will have 3 options: Keep my files and applications Keep my files Not save anything Select the option that suits your needs and click Reset If after executing these steps you still cannot log in, you can create a Windows USB to repair it.I recommend you look for another computer to create a USB and repair Windows https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi Jeffrey, I tried to do what you said but it won't enter Safe Mode at all. there is no windows loading screen when I try to boot from my hdd it just bring me on the recovery screen on the link I sent.The only things that I have access to are the bios, the recovery screen as I said and the black screen with the error on it. (Thanks you, I appreciate the fast response by the way)","Try to borrow a PC to create a Windows USB and repair it, check the links I sent you.","I just checked the link but for all of them I need to boot from a Windows usb but when I try instead of showing me the windows installation screen I got this. I assume it can be a problem with my hdd or my usb but I don't know. Without the Windows installation screen i can't refresh \/ reset my pc","Try entering the BIOS and reset the factory settings and then make sure that the BIOS is reading the HDD otherwise your HDD may have been damaged.","I see my HDD in the boot option priorities so it shouldn't be damaged I think","Try creating the USB to repair Windows","Bonjour Raphael Morali-Bigrasand it don't work. I already tried to recreate my bootable usb key but it didn't changed ty for helping (sorry for misstakes English isn't my first language)Ce n'était donc pas la peine de te forcer à parler l'anglais, car tu tombe bien, tu es sur le site en Français et ici, ont ne parle que le Français.Je te conseille l'excellent tutoriel, très détaillé, sur cette question, de notre ami Georges News, sur le site du MVP Aski :Tuto Création d'un support d'installation de Windows 10, version 1909Bonne continuation.","Tant mieux si c'est un site français je ne vais pas m'en priver :DPour le site que tu m'as envoyer, je n'ai et n'aurais pas accès à un pc sous Windows pendant un certain temps. J'ai seulement accès à un mac donc je ne peux pas installer rufus. Pour créer la clé d'installation de Windows que j'ai actuellement j'avais juste copié les 4 fichiers et 4 dossiers contenus dans le .iso ce qui avait marché la dernière fois que j'ai du installer Windows sur mon pc. Il ne devrait pas avoir de problème sur ce point normalement. Merci.","OK, merci de ton retour, mais attention, tu a été basculé sur le forum US.Bonne continuation."]},{"symptom":"settings        Sometimes videos I download play in black and white instead of color. How do I make this stop?","solutions":["Hi RRashidas,I am Sumit, an Independent Advisor and a 3 year Windows Insider MVP here to help.What video player do you use?Does the video play b&w in another video player too?Please see the below options:Option 1.Try Rolling back if you have an option:Go to Device Manager by typing in Devmgmt.msc in Run dialog box. Navigate to Display devices and right click ATI Radeon HD or Similar device you have. Choose Properties.On the Driver tab, hit rollback Driver to go back to the previous version. Option 2. Remove drivers completely and Install the the newest ones available from the OEM or the maker.What you need to do:1. Uninstall everything of Display driver using DDUhttp:\/\/www.guru3d.com\/files-details\/display-dri...2. Reboot.3. Make sure your device manager shows Microsoft Basic Display adapter.4. Download the driver from the OEM or the maker like AMD5.Run the Setup and you should be good to go.Disclaimer:Guru3d.com is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]},{"symptom":"Event 1020 windows 10        The required buffer size is greater than the buffer size passed to collect function of the C:\\windows\\system32\\perfts.dll extensible counterDLL for the LSM service. Is this a serious eroor happens on startup every day and I have no idea how to repair it.","solutions":["Hi, AlanReidmd My name is Smith and I am an Independent Advisor. I would be happy to help you today.I recommend you check these methods to repair any Windows problem. Press the Start key and type the word CMD, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanup-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/947821...Hope this helps. Keep us posted on the status for further assistance.","The required buffer size is greater than the buffer size passed to collect function of the C:\\windows\\system32\\perfts.dll extensible counterDLL for the LSM service. Is this a serious eroor happens on startup every day and I have no idea how to repair it.Error: Event 1020, Perflib, Win 10, 1903cmd< AdministratorC:\\Windows\\system32>C:\\Windows\\system32>Lodctr \/Rcd\\Windows\\SysWOW64C:\\Windows\\SysWOW64>Lodctr \/Rexit","Thx hunglungUen!To the point, no blah blah (turn on your computer, etc...), no **** (the usual sfc & co...).","The required buffer size is greater than the buffer size passed to collect function of the C:\\windows\\system32\\perfts.dll extensible counterDLL for the LSM service. Is this a serious eroor happens on startup every day and I have no idea how to repair it.Error: Event 1020, Perflib, Win 10, 1903cmd< AdministratorC:\\Windows\\system32>C:\\Windows\\system32>Lodctr \/Rcd\\Windows\\SysWOW64C:\\Windows\\SysWOW64>Lodctr \/RexitI'm computer illiterate. Can you please put the solution into lamens terms? I'm confused on what exactly to enter in the command prompt. Step by step please so a 2nd grader could do it? lol What exactly do I type in the command prompt after C:\\Users\\Administrator ? Thanks!","@JoannG1: you need to change the directory.To change in the upper directory, just type: cd..To change into a lower directory, type cd +directory-name.So, if you started from:C:\\Users\\Administratortype cd..Now your directory should be:C:\\Userstype cd.. againNow you shouold be in:C:\\Next steps:type:cd Windowstype:cd system32should be:C:\\Windows\\System32After executing Lodctr \/R just change into upper directory with cd.. and then into the directory SysWOW64 with typing cd SysWOW64","Could you explain more how to get to the C:\\Users\\Administrator. I dont know if this is a file or some command area. ","The required buffer size is greater than the buffer size passed to collect function of the C:\\windows\\system32\\perfts.dll extensible counterDLL for the LSM service. Is this a serious eroor happens on startup every day and I have no idea how to repair it.Error: Event 1020, Perflib, Win 10, 1903cmd< AdministratorC:\\Windows\\system32>C:\\Windows\\system32>Lodctr \/Rcd\\Windows\\SysWOW64C:\\Windows\\SysWOW64>Lodctr \/RexitI'm computer illiterate. Can you please put the solution into lamens terms? I'm confused on what exactly to enter in the command prompt. Step by step please so a 2nd grader could do it? lol What exactly do I type in the command prompt after C:\\Users\\Administrator ? Thanks!@Cubayashi Thank you so much! :)"]},{"symptom":"Windows Mixed Reality Black Screen with white point        I have a problem with my Lenovo mixed reality headset. First I had a strange graphic bug in the mixed reality home that the virtual windows of apps like settings or games etc. and also on notifications and the window that you see when you push the windows button on the controller. This bug or error let this windows moving but only in one eye or lens and in the middle is a circle where this windows disappear. So I try to find a solution after some time I reinstall windows mixed reality completely.But now I have this Error: https:\/\/bit.ly\/2NkPYsGI don't have this Updates installed on my Computer so I wondered what else could it be. I struggled a long time with this Error without a solution for it. Now I need some help.Short I have a Black Screen with backlight on and a little point in the middle with the graphic error that I described before. The only things what I can see is the point, the border, the virtual controllers with the pointer-line but with the graphic bug and also the notifications with this bug. Additionally now I can't open Windows Start in VRSome specs:Headset: Lenovo explorer | windows mixed realiyplugged in USB 3.0 and HDMI of RX GPULaptop: Lenovo y520 15ikbaOS: Windows 10 HomeCPU: Intel Core i5 7300HQ 2.50GHzIntegrated GPU: Intel HD Graphics 630Dedicated GPU: AMD Redeon RX 560Tried but no success:I have made all Updates (Driver and OS)I have tried to reinstall Mixed Reality completelyI have tried to reinstall all UpdatesI have tried to plug it in another port, only USB because I only have one HDMII have tried to run mixed reality pc check(no errors)Sorry for the quality but here are two pictures of the two sidesLeft and right lenseLeft:Right:","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform these two steps: 1. Reset USB driver: Go to Device Manager. Double tap on \"Universal Serial Bus Controller\" Right click on USB Root Hub drivers and select Uninstall. 2. Set Windows Update Service start automatically: Go to services.msc Locate Windows Update and Double tap on it. Use the drop down button and make sure the Start up option is set as \"Automatic\".If it is already set as Automatic, right click on the service and select Restart.3. Restart the PC Connect the VR and check."]},{"symptom":"Product key activation        Trying to move a product key from a broken laptop to another laptop (windows 10. It says the key cant be used. Ive used the deactivate command in old laptop. What should I do to get it working?","solutions":["Hi David Is your Windows 10 licence based on an OEM licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..Is your Windows 10 licence a retail licence or even an upgrade from a previous version of WIndows that was a retail licence?","Thanks for your reply. The licence was original windows 8 that was upgraded to 10. It came ready in the laptop.Is there a Microsoft site to check the Production keys status. ","Hi David That sounds like it is an OEM licence . . . Click your Start Button, type cmd then right click Command Prompt and choose 'Run as Administrator'Run or paste this command and hit Enter: slmgr.vbs \/dlv Please post a screenshot of the resulting dialog . . .","If Windows 8 was pre-installed by the manufacturer of the laptop then it is OEM and therefore Windows 10 will be, you cannot transfer it to a new device.","here is the screen shot, it says in Finnish the product key can not be found.This is because I deactivated it to try and install the one from the the broken laptop.If this is an OEM licence I think I will have buy a new one.Thanks for your help and have a good Sunday!"]},{"symptom":"Windows live mail wont open        I was able to receive but not sent emails . Was having a play around . Now windows livw mail wont open .Have I accidentally deleted the account?","solutions":["Hi Catherine My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Method 1: Simply end wlmail.exe and restart Windows Live Mail 1.Press Ctrl + Shift + Esc to open Task Manager. 2.Scroll down till you find wlmail.exe in the list, then the right-click on it and select End Task.3.Re-start Windows Live Mail and see if you’re able to check if you Fix Windows Live Mail won’t start problem.Method 2: Deleting Windows Live Mail .cache 1.Press Windows Key + R then type “%localappdata%” (without quotes) and hit Enter.to open local app data type %localappdata%z 3.Now inside the Local folder double click on Microsoft. 4.Next, double-click Windows Live to open it. 5.Locate the .cache folder then right-click on it and select delete. Note: Make sure to empty Recycle bin after this. Method 3: Repair Windows Essentials 1.Press Windows Key + X then select Control Panel. 2.Click Uninstall a program. 3.Find Windows Essentials then right click and select Uninstall\/Change. 4.You will find a Repair options make sure to select it. 5.Follow on-screen instructions to complete the repair process. Hope this helps."]}]}