{"windows":[{"symptom":"Getting permanent deletion permission        Of three TEMP folders that I routinely clean out, only the Windows one asks for permission. Can I set that so it does NOT query me ?","solutions":["Hi JosephPhilippa, What is the exact error message you receive? If the files are in use they won't let you delete. One thing I always suggest is deleting these files in Clean Boot:https:\/\/support.microsoft.com\/en-ca\/help\/929135...This allows you to make sure nothing is running that is in these temp files. if it is because you don't have permission, you can follow the steps below:https:\/\/www.windowscentral.com\/how-take-ownersh...DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I don't want to go to the trouble of clean-booting - I just want to ACCESS the TEMP in \\Windows\\. I'm not asking for total deletion, but to get ACCESS without being queried.I went back to apply for the permission you suggested, and this time I was NOT queried, so there is an inconsistency.","C:\\Windows\\Temp is a folder in Windows that may have usage, etc during normal Windows processes. This is why you sometimes may be finding it cannot delete. In most cases, a reboot and then a deletion will make sure none of the files are in use at that time. This is why you are probably seeing an inconsistency. I just tried clearing out that folder right now and it wouldn't let me delete a few files because they are in usage.","My question is NOT about deletion, although deletion is the purpose that brings me to the phenomenon.I'm asking is there a way I can avoid the querying pop-up to get ACCESS to \\Windows\\temp\\"]},{"symptom":"How do I get my CoolingTech_PC_Camera to work?        I installed it and it worked the first time. But now, when I try to use it, I get an error message saying \"An app is trying to use your webcam,\" and when I go to the \"Devices\" tap on the amcap window, the only device it shows is \"HP Webcam.\" Somehow, it doesn't recognize the USB camera unit plugged in, even though the unit lights up, indicating that it is drawing power. The camera user's manual is no help, because all it has are installation instructions. I tried a complete uninstall and reinstall, but it still wants to use my webcam and not the microscope. What is the solution?","solutions":["Hi Jason, Did this happened after a certain update? If yes, what I can suggest is to rollback and disable your windows update for the mean time.This actually worked for me, please follow this link for detailed guide: https:\/\/www.windowscentral.com\/how-stop-updates...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","I don't know if it was after a certain update, because several months and several updates occurred between attempts. I do know that someone on a different forum directed me to the \"IP Camera Viewer 4\" app, and that doesn't work either, because the problem is that my computer simply does not recognize that the USB has been inserted. As in, I go to the folder \"This PC,\" and under \"Devices and Drives,\" the USB microscope does not appear. I do not have this problem with my other USB devices.","Hi Jason, If you're able to use other USB devices, then definitely it's within the hardware or software related to your camera.Try to do a clean boot first, then try to update the drivers for your camera and Chipset Drivers for your Motherboard as well.That might help. Thanks and regards,"]},{"symptom":"WerFault\/lssas error        I recently got a mechanical keyboard and went to download the software. Microsoft Defender launched smart screen and norton I know not the best AV but it detected a virus. I thought ok then and continued to open it. it was not supported with my OS so I left it be. Later that night I get an error \"WerFault.exe - Application error --- An attempt was made to terminate this process, click ok to terminate. I clicked ok and my pc restarted and same error came up moments after I logged on followed by \"UpgradeTool.exe software error\" with the same message. ive tried to fix this problem as it has now made it so i cannot launch steam, norton and do sfc \/scannow. I have tried to reset my pc, no luck, uninstall the keyboard software, it did not install anything anyway. Any help with this situation would be greatly appreciated. Thank you.","solutions":["Hi Slvmmde and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.https:\/\/theitbros.com\/werfault-exe-application-...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"How to Erase\/Format a Write Protected CD-R on Windows 10        update: i ended up smashing it with a hammer as it would not snap and i don’t have a shredder. *************I have an old CD-R that I found and when I went to try to erase the contents of the disc, it said it was write protected. Is there a way to undo the write protect and erase the contents? I tried the Registry solution and that didn't work. I looked at the DiskPart solution, but my CD-R didn't appear in the list disk. Both Disk 0 and Disk 1 were too large of capacity to be the CD-R. I think 0 was the hard drive and 1 was the backup external drive. I did find the DVD-Rom drive in the list volume and it was Volume 0. So, what is the best way to get the contents of my CD-R erased? I don't care about using it again... it's going to be recycled if I can removed the contents.Thanks for any suggestions or solutions.","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.As already mentioned you cannot erase a CD-R nor can you reuse it. If you have no further use for the contents of the disc then snap it (some shreaders can also crunch up CDs), and dispose of it.Regards, David"]},{"symptom":"Windows 10 - You’re about to be signed off        Hello,My mother in law gave access to her system to scammers.Now, when we turn on the computer, we get the following popup message. “You’re about to be signed out.  You’re windows is blocked.  Contact Microsoft Professional on 213-674-1958”i have tried popup blocker and unistalling programs.  Since this is a fairly new computer, I also tried performing a reset, clearing everything a installing everything over.  After the system gets to 20%, the system resets and I cant continue.Any thoughts or help would be great!!Thanks.","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,When do you normally get the pop up? Have you tried the task manager to close the pop up? Did you perform the reset through the settings app? If so, I'd recommend performing the reset through the windows recovery environment to make that there are no third party service affecting the reset feature.To do so, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.Navigate to, Troubleshoot - Advanced Option - Reset this PC Alternatives to reinstalling windows 10. https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","Thanks!  I’ll give it a try and advise.","Fingers crossed!"]},{"symptom":"Need help reading crash dump file        https:\/\/1drv.ms\/u\/s!AqJkHvOxu9_tc3xLn8rJoAxIKDY?e=CzreSwSometimes BSOD sometimes just computer freezingRecently \"reset\" this computer with the Windows 10 feature, chose to keep personal data.Very new to this, not sure if I included all the information needed.","solutions":["Hi, there are different bugcheck codes. This usually means hardware problems. Please start with deep memory testing using Windows memory diagnostic tool.Unfortunately there is no sense to analyze dumps when hardware errors occur. Please check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.","Yes, there are kernel-power errors in the event viewer. So that would mean it's a hardware issue?How do I go about finding out what piece of hardware is causing the problem, especially if it's something essential like the CPU or motherboard.","Are they Kernel-Power 41 (63) errors? They mostly means the problem with power supply unit. Can you replace it for checking?Or carefully look at motherboard and PSU for leaked or swelled up capacitors (little barrels).","Thank you for your response.Yes, the errors are Kernel Power 41 63 in Event Viewer.I cannot replace the power supply at the moment, will have to buy a new one to do so. (my last power supply was the culprit behind many crashes, so I got rid of it)I see no swelled capacitors on the motherboard, though it is an old motherboard. (2011\/2012)I can't really examine the power supply since I have no intention of trying to open it or anything like that.That being said, my computer doesn't seem to crash when in safe mode, and oftentimes if the computer is stable for more than a couple minutes on start up, it doesn't crash at all.","Most problematic are not stable regimes but transient processes. There may be voltage peaks or falls, they may make PC operation unstable."]},{"symptom":"Hardware error : A problem with your hardware caused Windows to stop working correctly.        so when I go on chrome my pc starts to get real slow and I just got it and it says that in the reliability history and my pc is brand new SourceWindowsSummaryHardware errorDate‎1\/‎4\/‎2020 6:19 PMStatusNot reportedDescriptionA problem with your hardware caused Windows to stop working correctly.Problem signatureProblem Event Name: LiveKernelEventCode: 141Parameter 1: ffffd00949040010Parameter 2: fffff80614f4a998Parameter 3: 0Parameter 4: 1c28OS version: 10_0_18363Service Pack: 0_0Product: 256_1OS Version: 10.0.18363.2.0.0.256.48Locale ID: 1033I need help if anyone could help me it would mean the world to me","solutions":["Hi Dowwnz, I am Rob, an independent and a 14 time and dual award MVP specializing in Windows troubleshooting and Bluescreen analysis. Please remember as independents we are not responsible for the development of Windows or the computer hardware and drivers. If you will work with me I will be here to help until the issue is resolved. Note that this can be a very serious problem involving either hardware and software or both.Are you running any sort of supposed internet accelerator? I have seen quite a few cases of this error with those and Chrome as of late. If you are using one, or any3rd party antivirus program please fully uninstall them. Use only Windows Defender. Also, check with Chrome Support and Forums about any known issues. <-- be sure to do these! Could be your computer just does not have the complete specs to run your programs or games. Best to check with the program and game makers' support and forums.Especially since the computer is brand new please do yourself a big favor and contact the seller and the system maker's support. As OEM, the system maker is responsible for the proper operation of both the hardware and Windows. So regardless of the cause this is their issue to resolve. Added that even if you are some how able to resolve the issue yourself you would still want it fully documented just in case of related problems further down the road. <-- Learned this lesson the hardware myself and seem bite a whole lot of folks. ====== If you insist on troubleshooting this yourself (which I highly do NOT recommend on a new computer) :Troubleshoot blue screen errors <-- read this link http:\/\/windows.microsoft.com\/en-us\/windows-10\/t...ID41 and ID141 are virtually the same issue. ID41\/141 with no Bug_Check - The main cause of this issue as you have described is hardware related :https:\/\/support.microsoft.com\/en-us\/help\/202850...1. Over-Clocking -> best to reset ALL to the defaults especially while troubleshooting2. Memory (check thoroughly as indicated below). 3. Power Supply (see below to ensure you have enough power). 4. Over-heating - even if the overall temps are with-in specs a single component can be too sensitive to even the normal levels of heat and fault at a lower temp. Try adding a fan blowing into the case to reduce the effects of heat even more than the cooler usually does. Of course ensure all built-in fans are running. ==================================================== After checking determining the wattage of the power supply you will then need to check the requirements of the motherboard and devices. Usually the video card is one of the major power users.How do I determine how big my power supply is? http:\/\/www.computerhope.com\/issues\/ch000800.htmOther good sources of information are the device makers' sites and their forums. eXtreme Power Supply Calculator http:\/\/extreme.outervision.com\/psucalculatorlit...Power Supply Calculator https:\/\/www.newegg.com\/tools\/power-supply-calcu...Choosing the right power supply for your computer http:\/\/en.kioskea.net\/faq\/588-choosing-the-righ...How Do I Test the Power Supply in My Computer? http:\/\/pcsupport.about.com\/od\/toolsofthetrade\/f...==================================================== Memory tests do not catch all errors such as mismatched memory (possible even for sticks that appear to be identical) and when faster memory is placed in system behind slower memory. So it is best to also swap sticks in and out to check for those even if all memory tests fail to show a problem. To test RAM check here - let it run 4+ hours or so. <-- best method www.memtest.org MemTestX86 - Test RAM With http:\/\/www.tenforums.com\/tutorials\/14201-memtes...For the Windows Memory Diagnostic Tool. Type in Cortana's search box -> Windows Memory Diagnostics at top of list - click it. in Windows 8\/8.1\/10 the name is \"Windows Memory Diagnostic\". Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all.","Hi Rob, I did not buy that computer and I built it myself and as I saw it is not my pc crashing its just getting slow. I also saw on forums that b450 motherboards dont use a PCI device but uses the gpu instead, Could that change anything?Thanks for replying,Dowwnz","It can be any hardware (if it is hardware) and the PSU, GPU, and motherboard are the most suspect. All the troubleshooting steps in my previous post still apply even to home builds.Added to the original troubleshooting steps posted above : Check with the actual device makers' sites and ensure you have the latest BIOS, chipset drivers, and all major device drivers.Sometimes stress tests can help determine the cause of such problems. PC Stress Test free software for Windows 10\/8\/7 https:\/\/www.thewindowsclub.com\/pc-stress-test-f...Here to help, Rob ------ Standard Disclaimer: Those may be non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.Please let us know the results and if you need further assistance. Feedback definitely helps us help all."]},{"symptom":"How can I uninstall iCloud for Windows 10        I installed iCloud for Windows 10 but do not see it listed as such in my programs.What I see for Apple is as follows:Apple Application Support (32 bit)Apple Application Support (64 bit)iTunes","solutions":["Hi Joan, Thanks for getting back to us! iCloud can also be installed through the Microsoft Store which is where you may have installed it from.If it is listed under Start - Settings - Apps > Apps & features, you can click on the iCloud icon, and then click on the Uninstall button..Are you able to find this button? -Ashton"]},{"symptom":"Excel window covers the Windows taskbar        Greetings,I normally use my Excel windows not maximized and I drag and drop my Excel windows around, especially moving the Excel window down behind my Windows taskbar. In general use, when I drag my Excel window down, it moves behind the taskbar. So far so good.On occasion, what happens is I find that the Excel window has moved itself in front of my Windows taskbar.Here is a possible clue: If I leave my computer for a while with the Excel window behind the Windows taskbar, after a time, when I get back to my computer, it appears that the Excel window re-located itself above the Windows taskbar without my interaction. It could also be involved with the screen timing off, while the computer is still on.Are there any settings in Windows or in Excel to keep the Excel window behind the Windows taskbar? The problem seems to only occur with Excel and not other programs like Edge, Firefox, etc.Using Windows 10 Version 1909 (OS Build 18363.535).Thank you for your time and assistance.Andy Raffalski","solutions":["Hi Andy, You might want to look in the options tab and see if this checkbox is checked. Please let me know if you need further assistance. Thanks and regards,","Thank you for your suggestion.I am using Microsoft Excel for Office 365 MSO (16.0.11328.20492) 64-bit.In Excel Options, under Advanced, I looked under the \"Display\" section, as well throughout, but could not find the option for \"Show all windows in the taskbar\".The problem is, that is not the solution to the problem I am looking at. I already have all windows displayed\/listed in the taskbar.The problem is that the Excel window itself can be dragged from its top bar all the way to the bottom of my Windows screen (as far I like, but I usually am showing the top of the Excel window so I can view other windows above Excel), and will either cross (cover) the Windows taskbar, or move underneath the Windows taskbar. I am trying to keep the Excel window under the Windows taskbar - otherwise I lose visibility of all my other program icons on the Windows taskbar.Thank you."]},{"symptom":"Windows 10 stuck in loading screen during boot up.  Also unable to enter recovery environment        I have read several threads with users having similar difficulties with windows 10 getting stuck on the loading screen during startup.  i have tried the hard reset 3 times, but i do not get through to the recovery environment\/advanced options screen that seems to be the solution for others.  On the third reset my screen just remains black, but i can see the mouse arrow pointer. can anyone provide an alternative solution to how i can access my desktop?thanks in advance https:\/\/images.app.goo.gl\/Dey41xVG8BjQ4eHe6","solutions":["Hi Lee3105, My name is Riccardo and I would be happy to assist. Since you have tried to get into the advanced startup menu and auto-repair, we will have to get you to create an ISO on a bootable USB so that we can jump-start the computer.Please follow the steps here: https:\/\/www.thewindowsclub.com\/boot-or-repair-w...DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"teredo driver        Hello, i'm coming with a problem. I have seen here how can I reinstall teredo tunneling driver from device manager. I go to add legacy hardware, next next, network adapters, microsoft and in that list teredo is missing, so i'm blocked here. I tried with windows updates, with driver booster, they are all up to date. Need help, please","solutions":["Hi CerbuCristian, My name is Riccardo and I would be happy to assist: Altered Windows Registry settings are often the culprit behind the issue you are struggling with, so it’s time for you to check if that is actually your case:Bring up the Run box by pressing the Windows logo + R keyboard shortcut. Type cmd and press the Ctrl + Shift + Enter combination. When the UAC window appears, click Yes. Key in the following command: reg query HKL\\Syste\\CurrentControlSe\\Service\\iphlpsv\\TeredoCheckCheck if you see the Type EG_DWORD 0x4 line. If yes, then your adapter is disabled. To turn it on, type netsh interface Teredo set state type=defaultIf you can’t see that line, input the following: reg query HKL\\Syste\\CurrentControlSe\\Service\\TcpIp\\ParametersNow take a look at the DisabledComponents EGDWORD 0x…line. If its value is not 0x0, the adapter in question is disabled. To enable it, type reg addHKLM\\Sstem\\CurrentContrlSet\\Serices\\Tpip6\\Parameters \/v DisabledComponents \/ REGDWORD \/d 0x0 and hit Enter.If the value is 0x0, open the Run box and input devmgmt.msc. Make sure to press Enter.Click on View. Then select Show hidden devices. Finally, open Network adapters. Your Teredo adapter should be here. (the above was copied verbatim from: https:\/\/www.auslogics.com\/en\/articles\/no-micros...) DISCLAIMER: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Change owners name        How do I change the register owners name?","solutions":["Hi RuthRich, just so it is clear, this is the registered owners name and not the user or account name?this is the name that appears under \"this product is licensed to ...\" in winver please let me know if it is the account name you wish to change and ignore the rest of this post.the following involves editing the menu, take care, incorrectly editing the registry can cause damage to the windows installation.click start, type regedit right click on registry editor and select run as administrator paste the following into the address bar and press enter HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion in the right hand pane, double click on registered owner change the value data to the correct name and click OK close the registry editor click start, type winver and press enter you should now see the correct owners name.","I am using a second hand Windows 7 pc (that I bought at a pawn shop). I have installed a couple of games that when I try to play them they tell me to try the game in administrator mode. How do I do that? I am not technically minded so I definitely need help."]},{"symptom":"Forza Horizon 4 Infinite loading when ethernet cable is connected        So basically the game gets stuck on the loading after you press the enter key but once u disconnect ethernet cable and shut down the antivirus it loads (not the 100% of the time) is there any possible fix for this? because i am unable to participate in online activities of the game","solutions":[]},{"symptom":"Lost Miracast Capability when Updating from Windows version 1803 to 19091\/Big Problem        I lost my ability to Miracast to other displays after I updated from Windows version 1803  to 1909. This is not an isolated incident, as I have communicated with another user and he has lost his capability. I went through all the hoops..uninstall drivers, adapters, rollbacks, and restore without any success. I have a ticket into Microsoft because it was verified by Dell and Intel that it is definitely a Microsoft problem. MicroSoft please provide an update and solve this issue immediately. This a big problem for those who use their computers to do presentations.  Show of responses...How many others are experiencing this problem?","solutions":[]},{"symptom":"Event 1001 BugCheck        I received the following error and cannot figure out what is wrongThe computer has rebooted from a bugcheck. The bugcheck was: 0x0000001a (0x00000000000000Bf( 0x000000000013f5B5, | x00000000cf545a53, Ox000000007aeb8562). A dump was saved in: C:\\WINDOWS\\MEMORY.DMP. Report Id: 78b432af-2066- 169-a958-1 b45bcffec68.I am hoping I can get some help","solutions":["Hi SandyOutWest Please check to see if your system has generated any minidump files: Open Windows File Explorer Navigate to C:\\Windows\\Minidump Copy any minidump files onto your Desktop, then zip those up Upload the zip file to the Cloud (OneDrive, DropBox . . . etc.), then choose to share those and get a share linkThen post the link here to the zip file, so we can take a look for you . . .","https:\/\/www.dropbox.com\/s\/2ppa7npizvbz0mg\/010120-87562-01.zip?dl=0Here is the link for the file","Hi, Please re-upload the Dump file on https:\/\/onedrive.live.com The error 0x0000001a indicates that a severe memory management error occurred. Try this solution. Go to CMD and run it as Administrator. Then type this Command. dism \/online \/cleanup-image \/restorehealth","I had it reboot again 2 times once before trying the CMD solution and once after. I have uploaded both Minidump files.Here is the link https:\/\/1drv.ms\/u\/s!Ap5M0fAZILBaiBcqqS1G2mi4gVhu?e=EnLuxaI appreciate the help :)"]},{"symptom":"File sharing        When using the share feature in Explorer to share a file, certain app options appear that can be used to share the file.  I recently installed the Facebook app to my PC, but it does not show up as one of the options.  How can I add an app to those options?","solutions":["Hi Thomas My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Only installed apps that support the file type you are trying to share will be listed.Hope this helps."]},{"symptom":"no sound??        I have a new Dell 5680 for gaming and can not get any sound?? Anyone know what I might need to do to get sound??","solutions":["Hi, The first step to troubleshoot is check the output device is what you are expecting. To check this click the speaker icon in the system tray, it should be displayed as a drop down at the top of the window. From there check if there's any warning or error icons for the device's icon by right clicking the same icon and opening volume mixer. Please check this so we can troubleshoot further if you are still experiencing this issue."]},{"symptom":"DVD doesn't appear in Win10, I've done everything MS suggests. MS created the problem, why won't MS solve it?        Three different dvd's,  including a portable, don't work on any of the three different computers running Win 10.I've tried every solution MS suggests, none of which work.  The drives don't appear in File Explorer.  They do in Device Manager, uninstall\/install doesn't help on any of them.  Neither does anything else,  including adding\/changing the Registry.MS created the issue for reasons known only to MS.  MS has the ability to solve it. MS chooses not to,  and offers idiot solutions that it has to know don't solve anything.With the flood of reports all over the internet complaining,  does anyone have a hint of whether MS ever intends to try to fix the problem they've caused?","solutions":["Did you look in Disk Management with a disc in the drive?","of course, yes.  I've booted with a variety of different dvd\/cd's in the drive;  some are commercial others burned by me.  None of them are detected.  I've uninstalled\/deleted, unchecked, done everything suggested.  None of it works,  on neither of the three computers with neither of the three dvd\/cd player\/recorders.  There is always the possibility I did something that prevents the dvd from detecting discs.  The odds that I made a mistake on all three computers\/drives is slim.   For that to be the case,  everybody complaining about the issue would have had to make the identical mistake.The only commonality is all three use Win 10.  There are multiple websites that note Win upgrades are the root of the problem.  Which brings the circle back to my Q,  does MS intend to do anything about the problem it caused,  and if so,  when?","When Windows 10 was in development, Microsoft announced that it would not play DVDs. This was widely publicized at the time.Microsoft sells an accessory DVD player, but there's no need to pay to play DVDs. Most people use the popular, safe and freeVLC Media Player.","Hi Halldecker My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution. Apologies if you have already tried the solutions below.Solution 1. Does the CD\/DVD drive have a drive letter assigned in Disk Management?Ensure that the drive you're lettering isn't in use and that no files from that drive are open.Right-click on the Start button. Click Disk Management to open the Disk Management console. Right-click the volume that has the drive letter you want to change. Click Change Drive Letter And Paths. Click the Change button. Choose from a list of available drive letters. (Don't use A or B, which have historically been reserved for floppy drives and can sometime confuse older software.)Click OK. Click Yes if a popup windows appears asking if you really want to do this. Close the Disk Management console. Solution 2. Show Hidden (Unhide) CD\/DVD Devices in Windows 10 Have you attempted to show the hidden device in Windows 10? At times, Windows 10 update will do a reset, and restore some settings to an earlier state. As soon as your disc is not showing up as normal, try at first to unhide CD\/DVD device.Navigate to This PC -> Manage -> Device Manager -> View -> Show hidden devices. Solution 3. Uninstall IDE ATA\/ ATAPI Controllers If solution 1 (show hidden devices) does not solve the problem, please continue. Step 1. Locate the DVD\/CD-ROM drives and IDE ATA\/ATAPI controllers items. Right-click on each entry present under both \"DVD\/CD-ROM drives\" and \"IDE ATA\/ATAPI controllers\" sections one by one and select Uninstall.Step 2. Right-click again these items and select \"Scan for hardware change\" this time.Step 3. Reboot your computer after these changes. Solution 4. Update or reinstall CD\/DVD Driver To update the driver, search for the driver on the device manufacturer's website, and then follow the installation instructions on the website.Step 1. Press the Windows logo key + R to open the Run dialog box. Step 2. Type devmgmt.msc in the Run dialog box, then press Enter. If you are prompted for an administrator password or for a confirmation, type the password, or click Allow.Step 3. In Device Manager, expand DVD\/CD-ROM drives, right-click the CD and DVD devices, and then click \"Uninstall\".Step 4. When you are prompted to confirm that you want to remove the device, click \"OK\".Step 5. Restart the computer. Solution 5. Fix CD\/DVD Drive Missing by Command Prompt Using command prompt usually increases the chance to fix CD\/DVD disc missing in Windows 10, and it's comparatively simple to operate.Step 1. To open elevated Command Prompt in Windows 10, only type CMD in the start menu search box. Right-click on the Command Prompt desktop app and choose Run as administrator.Step 2. Copy(Ctrl+C) and paste(Ctrl+V) the following command in the Command Prompt and press Enter.reg.exe add “HKLM\\System\\CurrentControlSet\\Services\\atapi\\Controller0” \/f \/v EnumDevice1 \/t REG_DWORD \/d 0x00000001Step 3. A message \"The operation completed successfully\" then appears. Close the Command Prompt window and go back to check if the CD\/DVD icon is back.Solution 6. Fix Corrupted Registry Entries Warnings: Registry entry needs to be taken very carefully, as any improper modifying of it can result in severe consequences. So, use the best free backup software to backup Windows 10 registry before fixing corrupted registry entries to make CD\/DVD show up again. Step 1. Press Windows+R keys simultaneously to launch a Run command. Type regedit and press Enter.Step 2. Follow the path HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Class\\ {4D36E965-E325-11CE-BFC1-08002BE10318}Step 3. Look for UpperFilters and LowerFilters strings on the right side panel. Step 4. Right-click them and choose \"Delete\". Solution 6. Create a Registry Subkey Warnings: Again, Registry entry needs to be taken very carefully, as any improper modifying of it can result in severe consequences. So, use the best free backup software to backup Windows 10 before fixing corrupted registry entries to make CD\/DVD show up again.Step 1. Open Registry, as solution 4 step 1 taught. Step 2. Follow the path HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\atapi\\ Step 3. Right-click on the blank space on the right panel, when the New option pops up, choose Key.Step 4. Create a new Controller0 key under atapi key. Step 5. Select the new Controller0 key. On the right side of the pane, right click on the blank space and choose DWORD(32-bit) Value.Step 6. Set the name as EnumDevice1 and press Enter. Then double-click it to set the Value data as 1. Press OK to save the setting.Step 7. Exit Registry Editor. Step 8. Restart your computer. Hope this helps.","Neither VLC nor PotPlayer detects a disc in the drive  When I click MEDIA in VLC and direct it to play the disc the response is NO DISC IN PLAYER.","I did precisely everything you suggest,  which was also the info on a MS post in December '19.None of it worked, which is why I'm here.","thanks!,  all,  for the prompt replies.  I apologize if some of my responses were terse,  I spent another couple hours this afternoon trying everything again,  with absolutely no results. I'm hoping somebody has written a 'magic fix' that undoes whatever MS did to Win10 in one of the updates.  Again, my point is it worked with Win10,  suddenly it didn't, and it appears from other reports of the same problems it began just after a MS update. Has anybody reported that any of the suggested 'fixes' actually solved their issues? Restating:  I have data on dozens of DVD I thought were safe,  the data is now inaccessible from three dvd drives on three computers,  all running Win10.  The dvd's won't recognize or play ANY dvd's. Is my only remedy buying a new computer and hoping it'll play them?  Is there an add-on, e.g.,  new BIOS chip,  that'll solve the issue? Has anybody tried running an alternate OS?  Are dvd's burned with Win working with conversion software on Apple, Linux,  etc?And, my prime Q,  has anybody heard Word One about MS admitting there's a problem and promising to try to fix it?Thanks,  all,  for your patience.  I've been in computers since the TRS Model 1,  maybe the industry should have stuck with TRSDOS. <g>  Those of us who used the \"keyboard de-bounce routine\" are fading fast ...","I believe what you say, but I have to tell you that I have never found a commercially made DVD that Windows 10 did not recognize. Home made DVDs are a different story.","I pulled an ancient commercially made dvd from the mid 80's, it locates drive D:\\,  the dvd player, and shows the start screen.So, what we're down to, Win 10 DOES NOT recognize any dvd's that are not commercial?Is there any fix or remedy for that?Did MS intentionally do that in Win 10?Does MS intend to do anything to correct that?Did MS WARN that Win10 would do that?Am I screwed trying to get the data from all the dvd's I backup on?Thanks.","hi all, i have this same problem, yes i have updated bios and firmware all on devices, the thing i dont get is my data back up discs 25gb blu-rays all burnt and verified on this drive from its windows 8.1 days can read all discs apart from the back ups i created and have used many times before.i have the drive installed to a drive path letter and works fine in every other aspect, burns cds and dvds, but cannot read blu-ray data back ups.i have years of data backed up that took years to create, i cannot retrieve this data without years of work, this isnt acceptable from MS.what ever your thoughts are in removing this simple thing is, may i suggest you fix what you have broken, or i for one will be moving to another platform that helps its customers not hinders them."]},{"symptom":"USB C Port        I have a USB C port on the back of my desktop and I need to be able to transfer data through it, but it only seems to charge. Is this a windows 10 error or will I just have to buy an adapter to plug my cable into the front?","solutions":["Hi Jumpy, You might want to check this option on your Phone as well, https:\/\/www.mobikin.com\/android-backup\/enable-u...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","Hi Jumpy, You might want to check this option on your Phone as well, https:\/\/www.mobikin.com\/android-backup\/enable-u...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards, I am not trying to connect my phone, but when i do try it on my phone, it just acts like its plugged into the wall","A USB port is just that - a port. It doesn't transfer anything by itself. You, or your chosen software application, do the transferring.","Hi Jumpy, Yes, that's why you need to check also your Phone's end as if it's like just charging.Some settings are into Developer's mode to activate file transfer for Windows. Please check it again. Thanks and regards,","A USB port is just that - a port. It doesn't transfer anything by itself. You, or your chosen software application, do the transferring.This confuses me. I am more specifically trying to plug in a vr headset and it needs to be able to transfer data from my computer to the headset, but whenever i plug it in, windows doesn't recognize it, or anything that is plugged into that port, for that matter","Like I wrote, just because you plug a VR headset into a USB port, that doesn't mean you're ready to start VR-ing. The headset might need a driver, and you might need software to watch in VR.","alright that makes sense, but ive got all of the software necessary and it just doesnt work. Even when i plug in my phone to that specific port, it just acts like it is plugged into the wall and i have no option to make it transfer files","There might be settings on your headset (or your phone) that need to be set. If so, you'll find them in the owner's manual.For example, a phone I had long ago needed a special setting to make it look to my computer as if it was a hard drive."]},{"symptom":"Windows 10 upgrade failed - FIRST_BOOT: ERROR 0xC1900101 - 0x30017        SOLUTION:My Killer devices (ethernet and Wifi) were causing the issue and i disabled them both.ALSO, I am unsure if it was necessary but I also disabled my Nvidia graphics drivers as well because I had seen that it was causing issues as well in other threads.After that, I ran the upgrade normally and it worked first try, no errors. Thanks to everyone who helped, MVPS: Saltgrass and SumitEND SOLUTIONHello Everyone,I am currently trying to upgrade to Windows 10 Pro from Windows 7 Pro but unfortunately, the upgrade, using the Windows 10 installation media, keeps failing after the first restart, right after theinstall gets to around 27-31% completed.Windows 10 installation media I am using: https:\/\/www.microsoft.com\/en-us\/software-download\/windows10The error that pops up when it does fail after the first restart is: SYSTEM_THREAD_EXCEPTION_NOT_HANDLEDWith error code: 0xC1900101 - 0x30017After some digging about the error code, it appears that it is related to therebeing a bad driver somewhere but it doesn't tell me which one.Found here: https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/resolution-procedures#0xc1900101After that, it boot loops twice and reverts the hard drive to just before starting the upgrade.Here is everything I have tried to fix it:Updated every single driver on my computer to its most recent version, yes all of them.I have made sure that I have absolutely every windows update for windows 7 to date, running windows update now only returns Windows is up to date.Initiated the upgrade will all external hardware unplugged, so literally just my laptop with an ethernet cable plugged inDeactivated Anti-virusAttempted the upgrade from a clean boot (Following this guide for Windows 7: https:\/\/support.microsoft.com\/en-us\/help\/929135\/how-to-perform-a-clean-boot-in-windows)I have run sfc \/scannow and chkdsk \/r several times over at this point, both show no errorsI have also cloned my hard drive to a spare SSD I had and booted of that to see if maybe my hard drive was failing and retried all of the above again but it still failed.I have also followed the following steps to try and repair windows update but that doesn't appear to be an issue:net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver RestartI am stuck here, I am not sure what else I can to do to get this upgrade to work. My searching throughout the web has led me to this point trying the above.The only other more extreme solution I found was someone stating that once the upgrade performs its first restart, is to hard shutdown the machine yourself (hold down the power button) and then start it back up. I am not so sure about this as I think this is very likely to cause some sort of drive corruption for sure.Found here: https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/error-0xc1900101-0x30017\/16817841-15d1-4487-a646-13cd9b116961?page=1Any and all help is greatly appreciated, thank you.","solutions":["Yes, you should try to disable it first and attempt the upgrade. If the update is successful, install the new drivers in 10."]}]}