{"windows":[{"symptom":"How to restore removed apps on Windows 10?        Split from this thread.how do you restore removed apps on windows 10?. my apps are in a folder in control panel.","solutions":["Not sure I understand that last sentence, please explain.","sorry. when I did a reset of windows 10 it removed a lot of apps? (that's what the file is named) it's in the file explorer. now I want to restore those apps so how do I do it","hello did my reply get through?","Hello Glen, It has been a while since the thread that you've created became inactive. How's the issue so far? Do you still need assistance with regards to this?Feel free to get back to us if needed.Best regards.","Install them as you did before... If you did not install them, but they came pre-installed on the system per your OEM (reseller) - contact them for support on getting the applications they installed pre-sales back onto the system they sold you (restore it to factory defaults.)","why does window10 remove programs and apps when it updates","Please stop sending me so much mail.  I cannot unsubscribe to this site.   I do not want any more replies.susan Spear","You are not 'subscribed to the site' as much as to particular conversations.  For each conversation you are receiving emails from (and wish to stop doing so for), visit it on the web page directly, click on the three dots under the original (first) post in the conversation and choose \"unsubscribe\".FYI - this is information found in the FAQs for the forums.","In my experience, it doesn't normally do this.  It MAY do this when upgrading from a prior OS, maybe even when going to the next major build (although I have not witnessed the latter) - but in those cases it tells you what applications will be removed because they are incompatible and it can\/does save that list to the desktop of the upgrading user account.So, what exactly did you initiate (from what to what) and what did you see happen and specifically what was removed?","how to restore apps to 10"]},{"symptom":"Monitor flickering issues        Scoured the internet and could not find a solution and I am at the final straw.Every time I play something full screen like a Youtube video, a game like Minecraft, or some random Steam game, or anything that goes full screen, my monitor flickers black. It usually happens when a quick motion happens on the screen; never when it's still. I highly doubt it's a internal problem in my monitor because when I had Linux this issue never occurred. Sometimes it just straight-up stays black until I exit out whatever I'm in (I've had to Alt+F4 a lot of things). It happens every other day as well, like say today it was working normal, tomorrow it wouldn't be working, but then the next day after that it would, and then repeat. And yes, I've checked (6 times at this point) that yes, my graphic drivers are in fact updated. My friend who built my computer in the first place doesn't know what's happening or he does, but he's just too lazy to fix it and tells me to just not use full screen which ticks me off.If any of this information helps, here it is:GPU: Radeon RX 580Monitor: Acer SB220QMonitor originally came with a VGA cable to plug in, so I had to get an HDMI cable for it.Yes, I've checked connection with the cableYes, I've checked for driver updates","solutions":["Hi there, Can you try booting in clean mode and seeing if the issue still appears.... https:\/\/support.microsoft.com\/en-ca\/help\/929135...Also, are you using the Windows drivers (as in you updated from Device Manager) or the actual drivers from the manufacturer?Let me know."]},{"symptom":"Download games and blu ray        Hi Team,I've recently bought a new HP computer with Windows 10. While it's fine with most applications (Microsoft Office, Steam etc) on certain games it allows me to save the setup file on the computer, even install them on my computer but then won't open the file. It looks as if it's beginning to but then the loading window vanishes.I thought it might be a problem with an old games (it doesn't happen to them all) but I just bought a Macgos Blu Ray program to play films of an external drive and though it has been downloaded it won't open with the same vanishing box.Any help you can give me would be most appreciated.Many thanksK","solutions":["Hi Keithedwards1920 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Hi Joseph,Many thanks for replying to my email.I have  run the Window Support programmes and while it has said it has fixed some problems I still cannot load my programs \/ or get them to work.Is there anything else I can try.Many thanksKeith","Hi Keithedwards1920, May you please provide a screenshot of the application properties? Thanks!","Hi Keithedwards1920, May you please provide a screenshot of the application properties? Thanks! Hi Joseph,Please see attached for a doc with screenshots of the properties of the app and what happens when I try and download. It flashes on the screen and nothing happens next. The same thing happens with certain games I've downloaded online. It's frustrating! Thanks for your continued help though.Keith","Hi Keithedwards1920, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hi Keithedwards1920 I'll try to help you out. Can you specify what kind of files you're trying to open ? I can't really check you screenshot, the text is blurry.But if I guess right, you're opening a .img with internet explorer by default ? I'll wait for your news Regards","Hi Jay,In this case it's down as a \".dmg file\" and I'm trying to load the program using internet explorer. As I have explained above it opens a window as if it's going to run but the box is empty and then very quickly closes with nothing happening.K","Well, looks like DMG files are MacOS files. More information on it here : https:\/\/www.howtogeek.com\/204628\/how-to-open-a-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Just to be sure, are you trying to run MacOS softwares on a Windows machine ?"]},{"symptom":"Sync Center        I went to Start>Control Panel>Sync Center, I'm trying to connect two different computers. I have went into Settings>Accounts>Sync Your Settings, and turned on all Sync options, on both computers. Yet when I go back to Control Panel, and Set UP New Sync Partnerships, both computers say You have no Partnerships Available. However, both computers are set up under one user name, one email, so as far as I can see, the two computers would be the definition of a sync partnership. So what am I doing wrong? What do I need to do to make the connection? ","solutions":["Hi wt.pm That Sync Center is a legacy process left over from previous versions of Windows What exactly are you trying to sync between your PC's? If you have turned on all sync settings in the Settings App (Accounts - Sync your Settings) then your devices are synced, the only other thing to sync is your files and nowadays OneDrive, which is a component of Windows 10 can be used to sync your files . . ."]},{"symptom":"How can  make the Windows fonts roam with the user?        &nbsp;Regards to&nbsp;the main windows font from Display Settings\\Change size of text and other items.&nbsp; How can I make Windows fonts within win10 environment&nbsp; roam with the user?&nbsp; After font changes are made, say from recommended 100% to 125%, the user logs in and out of primary workstation the settings those settings stay the same and is persistent.&nbsp; If the user, after making those same changes, logs out of his\/her primary workstation&nbsp;and logs back into another across the room on the same domain, the font settings does not roam with user's profile and reverts back to recommended 100%.&nbsp; Any ideas?* Original title: win10","solutions":[]},{"symptom":"Why is Microsoft Edge not letting me login to my AOL Email account?        Microsoft Edge won't let me login to my AOL Email account! WHY?","solutions":["Hi CarleneFriar what happens when you try accessing edge? any error message? please tell us the exact message which browser are you using? have you tried more than one browser?"]},{"symptom":"Games are switching resolution when entering fullscreen mode        Hi I have a problem where When I open a game like apex legends or fortnite, My monitor resolution jumps up to 3840 by 2160 witch is only supported as 30 htz. But I want my games to run at 1920 by 1080 at 144htz because that is my monitors refresh rate. Does anyone know how to fix this because this is really annoying. P.S I don't know if the reason why this is happening is because I have a monitor connected to my laptop, and am using the laptop as a second display. My specs are a core I7-8750H (2.20 GHz) and a 1050 TI, I also have windows 10 and 16 gigs of ram. PLs Help me.Thank you.","solutions":["Hi, there are video settings in game itself so please run the game, open video settings and select required resolution.","when I that it changes the resolution but it dosent change the refresh rate that it is at so even if I change the resolution to 1920 by 1080, it still keeps running at 30 htz","Please check these settings in video control panel. Exact steps are different and depend of video driver.","But do u know of any way that I can lock the resolution to that monitor so it dosent change.","Unfortunately game can change display resolution and refresh rate. The only way to keep resolution and refresh rate is to run game in window mode.","I’m very sorry I could not help you and you’ve marked my messages as non-helpful. Sorry again, I will impede you to search for a solution no more.But I want to note I do not give the answers which one will like, my motto it to give a correct answers. Sorry once more.","Hi GHostWO, You may want to directly go and change your refresh rate on your display adapter:https:\/\/www.windowscentral.com\/how-change-monit...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Daughter's PC Lost Internet During Online Lesson-Cannot Reconnect        Computer is a Dell purchased at Costco last year, with Windows 10 Home.My daughter got cut off near the end of her Japanese lesson on Preply. Her computer can no longer connect to the internet all of a sudden. We tried rebooting it, and it still won't connect.We tried connecting to a different wireless hotspot, but it says \"No internet, secured\".Other devices can connect to the hotspot and have internet.Baffled. This is a year old Dell computer from Costco.If I try to connect to our regular Wi-fi, it spends over a minute \"Checking network requirements\" then a few minutes later: \"Can't connect to this network\".Did the hardware fail during her online video tutoring session?","solutions":["Hi M, If you are still finding wireless networks - it doesn't sound like your hardware has failed. Your driver may have had an issue though...What I suggest is to do this: Go to Start > type in Device Manager > click the Device Manager icon Expand Network Adapters go to your wireless adapter (Intel or what ever the name of it is) Right-click that wireless adapter Choose Uninstall Restart your computer and allow it to install Does this fix the issue? Let me know.","What ultimately fixed the issue was a hard power down\/power up. Apparently the hardware got itself into some state where a simple restart didn't clear the error. Apparently the Dell machine doesn't initialize the PCI bus when it restarts. This recalls back to a similar incident I had in 1992 with a Contaq 486 motherboard not resetting the graphics card (Diamond SpeedStar) at reboot, causing me to reinstall Windows for Workgroups to no avail. A power cycle cleared up the matter there too. Go figure!","When in doubt, restart! I wish that rhymed! Glad it worked my friend, have a great day and Happy New Year!","That was the first thing I did, but it did not reset the hardware, only Windows.Best wishes in 2020!","Best wishes to you too!"]},{"symptom":"How to install Internet Explorer into Windows 10 so that I can use Quickbooks        Purchased Quickbooks and for some reason that program needs Internet Explorer to be used.  I tried installing Internet Explorer into Windows 10 but it will not work.Tried installing it a dozen times with reboots and driver updates and nothing works.","solutions":["Hi WalterProchorenko if IE is not already available in the start menu (or click start and type ie) then it can be turned on in windows features.click start, type turn windows features on or off, and press enter tick internet explorer 11 and click Ok it will then be in the start menu under windows accessories"]},{"symptom":"Error code: 0x800701B1        I was switching from windows 10 home to windows 10 pro so while installing i came across an error which stated \"windows cannot install required files. Make sure all files required for installation are available, and then restart the installation.\" I have never had any kind of issues while installing windows before.","solutions":["Never mind, I fixed the error my self.","Please, I'm facing the same problem, could you tell me how you solved this problem?","I was switching from windows 10 home to windows 10 pro so while installing i came across an error which stated \"windows cannot install required files. Make sure all files required for installation are available, and then restart the installation.\" I have never had any kind of issues while installing windows before.I have the same problem... someone resolved it????? Thanks!"]},{"symptom":"what is Intel Extension update        What is Intel Extension update?","solutions":["Hi CaptZador That could be Intel Software Guard Extension update, can you please provide a bit more detail, where are you seeing this and if possible a screenshot would help us to understand better . . .","It just is showing up to download in windows update.","Just want to know what I am downloading. It is probably safe.","Hi CaptZador Rest assured if that is being downloaded from the Windows Update process, you can be sure that is safe . . .From the Windows Update catalog, the only reference to Intel Extension(s) are to that Intel Software Guard or to Intel UHD Graphicshttps:\/\/www.catalog.update.microsoft.com\/Search...","Intel - Extension - 1\/21\/2019 12:00:00 AM - 1904.12.0.1208","Intel - Extension - 1\/21\/2019 12:00:00 AM - 1904.12.0.1208","Hi CaptZador Rest assured, that is an official update from Intel for the Intel(R) Management Engine Interface on your PC . . .","As stated by others, the downloads from Windows update are safe. If you run into compatibility issues, the update can be reversed. The update in question is motherboard chipset driver (an extension for the Intel Management Engine) for the hardware in your computer. It is best to allow it to update."]},{"symptom":"Sharing root directory on Windows 10        I am having issue with sharing a root directory so we can run programs on one system. I have turn on File Sharing  Network discovery Turn off password protected added a share for the root directory I can see the share but I cannot access it.  the error is You Do not have permission to access\\\\****\\c. ","solutions":["You must do these things on the target machine:Create an account that agrees in name & password with your account on the remote machine.Set the share permissions to \"Full access for everyone\".Set the NTFS access rights for C:\\ to either \"Read\" or \"Read\/Write\".","Is that the same as creating Microsoft accounts because that's all it allows me to do on Windows 10. I can just add userid\/password ","I was able to create an account using the account from the system on the system that I am trying to connect to ","Where do you set NTFS access rights ","Does it matter if the Windows 10 is pro or home to create shares","Does it matter if the Windows 10 is pro or home to create shares All flavours and versions of Windows, since Windows NT and Windows 2000, use the same approach for sharing folders.","Hi Garry, You may want to check this article for suggested steps: https:\/\/quehow.com\/how-to-share-an-entire-drive...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","how do you set NTFS access rights. ","how do you set NTFS access rights.  Very simple: Use the right-click method to expose the properties menu."]},{"symptom":"Windows 10 start menu does not work - Error message ' Start menu not working. Logout to fix the problem'.        Windows 10 start menu does not work - Error message ' Start menu not working. Logout to fix the problem'. This is only for one user, the other users on the same computer don't seem to have this problem.","solutions":["Hi Enigma, There's a lot of things to consider with your current issue. However, you may want to check these suggested steps in fixing this kind of concern:https:\/\/windowsreport.com\/critical-error-start-...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"When I print my computer shuts down and has to be rebooted        When I print, my computer shuts down","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Does any error or blue screen appear when this happens? The first thing I would recommend to do is uninstall the printer drivers. Restart then install the newest drivers for the printer from the manufacturers' website then try printing again. Does it still shut down your computer?"]},{"symptom":"PC is stuck in initializing and is location dependent        I have installed the most recent Windows update and now my computer is stuck initializing. I took it to the shop and they reinstalled a clean Windows version and it worked fine. I returned home with the PC, the same issue continued. Returned it to the shop and I am able to work with it fine, just not at my home. Why????????","solutions":["Hi Don, this may be related with power quality in your electric grid or with defect in electric outlet. Can you try computer on another room?","Hi Don, this may be related with power quality in your electric grid or with defect in electric outlet. Can you try computer on another room?Hi Igor:It happened suddenly after the update. I use a UPS and have tried it direct into the wall outlet. I tried using the UPS of a PC I know to be working. I tried replacing the power cord. I'm at a lose for what to try next other than physically moving the device.","Do you have internet connection and what is a type of connection? What other wires are connected to PC?Please check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.","Do you have internet connection and what is a type of connection? What other wires are connected to PC?Please check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.Hi:I am currently using my laptop and have internet on it. The PC is frozen on initializing and unresponsive to all attempts to get into the system.","Do you have internet connection and what is a type of connection? What other wires are connected to PC?Please check system journal (Event Viewer) for possible errors at these moments, especially Kernel-Power errors. DistributedCOM errors should be ignored.Hi:I am currently using my laptop and have internet on it. The PC is frozen on initializing and unresponsive to all attempts to get into the system.Again, when I took the PC into the shop it worked just fine. It seems to not operate in my home office where it has done so without incident for years.","What additional wires are connected to computer at home in comparison with shop? Internet cable, additional mouse, something else?Can you have any device to check voltage in outlets? There are different types of UPS, some operates continuously but mostly - only when outlet voltage disappears. Which one do you have?","What additional wires are connected to computer at home in comparison with shop? Internet cable, additional mouse, something else?Can you have any device to check voltage in outlets? There are different types of UPS, some operates continuously but mostly - only when outlet voltage disappears. Which one do you have?Attached to the PC is a USB-hub, monitor, web cam, wireless Keyboard & mouse.I have a multimeter to check voltage however, recall that I plugged the machine into the UPS of a second PC that I know to be fully functional and the original PC behaved the same way.The UPS is on but only functioning when the power goes off.","If this is back-UPS, turning on only on power failure it have no effect while power is in outlet.Please disconnect hub, web-cam, connect to UPS, turn UPS on, disconnect UPS form outlet and then turn PC on. What happens?BTW do you have Internet connection? Wired?","If this is back-UPS, turning on only on power failure it have no effect while power is in outlet.Please disconnect hub, web-cam, connect to UPS, turn UPS on, disconnect UPS form outlet and then turn PC on. What happens?BTW do you have Internet connection? Wired? Igor:I powered off, disconnected the hub and then restarted. It is now working. Thank you.How do I get the other devices back online if I can't use the hub?","Seems hub is faulty so you may replace it with another one."]},{"symptom":"Windows causing unwanted reset        My Windows 10 has been reset to Microsoft Edge twice now because \"an app caused a problem with default app setting for ms-xbl-3d8b930f files.\" Is there a solution for avoiding this problem? The reset wipes out all my files.","solutions":["Thanks for clarifying, Myles. I think you're referring to the known issue of \"an App Default was Reset\" although the error you report is slightly different.See if this is the problem and solution: https:\/\/www.tenforums.com\/tutorials\/45792-fix-a...https:\/\/www.winhelponline.com\/blog\/windows-10-r...https:\/\/answers.microsoft.com\/en-us\/windows\/for..."]},{"symptom":"Deleted Microsoft email, cant log in to computer         I deleted an old Microsoft ID\/Email address without making sure I changed my gaming computers log in information. I can not recover the old identity\/Email address because Microsoft says it is \"in use\".  Can not get passed desktop security (log in) to get to desk top so I can load new information. Can someone help me? Is there a universal log in or a jail break for desktop security that I can use to get logged in, changes my settings and load the new Microsoft ID?","solutions":["Hi Wayne! I'm Steve, an Independent Advisor and a Microsoft user like you. I'm happy to help with your query.Did you delete your old account within the last 60 days? If so then there's a grace period in which you can enable it again. There's more details here:https:\/\/support.microsoft.com\/en-us\/help\/452071... Please let me know if I can be of any further assistance!","Unfortunately I deleted the account aroun 8-10 months ago. Any thoughts other than reloading Windows? I do not have a back-up disc, never got around to making one....","No problem, in that case you can try starting your computer in Safe Mode (without networking) and signing in with your current credentials. If successful you can then change your account type to a local account which will allow you to restart and sign in normally, you can then change back to a valid Microsoft account if you wish. There are details here on how to start Windows in Safe Mode: https:\/\/support.microsoft.com\/en-us\/help\/12376\/... Also details here on how to switch to a local account: https:\/\/support.microsoft.com\/en-us\/help\/402706...","Ok...so I mean the starting of Windows in safe mode worked great, all the way up to the point where I was able to press f4 or f5 to start in safe mode to change settings. But at that point, it again asks for the password to the old user account, and again we get caught in that loop. I need to BYPASS ALL Windows login security to get to the settings, so I can change over to my new Microsoft account information. My old account had been previously hacked and I thought I got it all changed out but forgot about my ASUS gaming computer....","Hi Wayne, Based on the information above, you may wan to try this instead: https:\/\/support.microsoft.com\/en-my\/help\/17875\/...Please let me know if this article helped you out. Thanks and regards,"]},{"symptom":"Getting BSOD often.        i am getting BSOD very frequently than I used to, as never! Running Win10 (uptodate), Sony FZ21Z Vaio. DuoCore, 3Gb, 300gb hd. I have no idea why this is happening all of a sudden so frequently now! Please see pic. Thanks.","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Can you upload the dump files from the bluescreen then I may be able to look further into the root cause potentially.The dmp files should be located here: C:\\windows\\Minidump Zip any files and upload them to onedrive and link the download here. From there I can look at it further.","Hi ThagstromI managed to upload the Win10 Minidump folder on the oOneDrive, check link below:https:\/\/1drv.ms\/u\/s!AsxoUmLVCvPogTXW0owL0iUSwrB4?e=mv6r5QHope this helps. Thanks.","Hi smehta Most of your Minidump files indicate your system crashes are caused by your Intel Wireless Network card device driver, an older version of that driver may be more compatible with your system . . .Open Device Manager (accessible by right clicking your Start Button) Expand the Network Adapters Section Right click your Intel WiFi device and choose Properties On the Driver Tab, choose 'Roll back Driver' Restart your PC once done . . . If that option is grayed out or does not resolve the issue, go to the support page for your device on the manufacturers website, then download and install the Intel WiFi driver they recommend, it may well be an older version to the one you are currently running"]},{"symptom":"Remove local login option on Windows 10 account        Hi,I have a computer which was originally setup with a local account and now it uses a Microsoft business account.However, upon login, I still see the local credentials login option (which appears by default). This is not another user account, just another login option. How do I delete that so that only the Microsoft account login remains?Thanks,Florian","solutions":["Hello Florian, my name is Farah and I'm an Independent Adviser. I can help you regarding this problemYou can delete the local account from Control panel\/ User accounts - Type in start menu Add-edit or remove other users. - Once you open User account, click on Manage other account. - Enter the password for the account if prompted. - Click on Delete the account. - Click on Delete the files. if you want to. Feel free to ask back any questions and let us know how it goes. I will keep working with you until it's resolvedCheers! Farah"]},{"symptom":"Corel PaintShop Pro X6        Corel PaintShop Pro X6 came free with my computer so I don't have a installation disk or a link from a email. You just entered the codes and it installed as far as I can remember.Up until yesterday it worked find and was perfect for my needs.This morning a screen popped up that stated either my files was corrupted or it was an illegal install.Is there anyway to fix this corrupted file or find out if it is. I doubt it was illegal after all this time and it came from Corel.Thank you for any help.*wasn't sure what category to put this in*","solutions":["Hi IBleed4Thee This is a known issue with Corel PaintShop Pro (all versions) can you please go over to the Corel forum and post this question there, because this seems to be caused by a problem with your Corel Account . . .https:\/\/forum.corel.com\/EN\/viewtopic.php?t=6457...________________________________________________________ Standard Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it..","DaveThank you for the quick reply.I went over to the forum and read the that link and there does seem to be a great deal of this same issue. Though it was posted by several Corel employees that it was address and only affected a few dozen people over the last few years.Well it's not fixed and I am going to contact Corel directly with this issue after I attempted to log into my account if I made one and see if my information is in there.Have a great day,Sandra"]}]}