{"windows":[{"symptom":"Nothing Happens When Search is Clicked in Windows 10        I have four different computers exhibiting this same behavior.All have exhibited this problem since upgrading from Windows 7 Pro to Windows 10 Pro.The one I am currently using is Windows 10 Pro Version 1903 Build 18362.418.When I click the Search icon (magnifying glass) in the Taskbar, nothing happens.  No search window appears.If I open the Start menu and begin typing (which on other machines would invoke Search), nothing happens.If I right-click the Start icon and select Search, nothing happens.Well, ALMOST nothing happens.In the Process list in Task Manager, Cortana is listed as running, but \"Suspended\".  When I click the Search icon, the \"Suspended\" status goes away for a few moments (possibly until I start working in another application).Edit: The following paragraph used to be true, but now that I'm on 1909 and Windows Search is integrated into the File Explorer Search box, this no longer works either:If I open Windows Explorer and use the \"Search This PC\" box in the upper-right, it WILL search the drive and return results.  However, it doesn't quickly find apps and settings like Windows Search does.  (E.g.: Start Search, begin typing \"Notepad\" or \"Background\" and quickly see a result for the Notepad app for the Desktop Background Personalization settings.)Tablet Mode is Off.Indexing reports that it is complete.I have tried the Indexer Troubleshooter without success.I have Rebuilt the Index under Advanced Indexing Options.I have verified that the Windows Search service is running and set to Automatic start.I have attempted the \"Reinstall Windows Apps through Powershell\" solution without success. (Get-AppXPackage-AllUsers, etc)Since one solution that is occasionally mentioned is to create a new user account (which I'd prefer not to do if I can avoid it), I figure I'll mention this:  In the Account settings, if I try to set a profile picture I receive an error message: \"Setting the account picture failed, please try again\".","solutions":["Hello DrMcLane, thank you for providing this question. I am a seasoned Windows expert with almost a decade in usage and support experience and hope to resolve your problems quickly.Please just for troubleshooting and testing purposes try to create a new account and see if the problem persists.In the meantime open a cmd as Administrator and type in these commands: sfc \/scannow Dism \/Online \/Cleanup-Image \/ScanHealth Dism \/Online \/Cleanup-Image \/CheckHealth Dism \/Online \/Cleanup-Image \/RestoreHealth Each of those will take a while. If a command prompts you an error please include it in your answer.If you consider your problem solved it would be very good if you marked the answer which helped you so others can find and use this thread.If this didn't solve your problem or you need further assistance please answer in this thread and i would be happy to help.kind regards F. Grobusch","Thanks for replying so quickly!I'll come back to the \"new user account\" option in a moment.As for the commands:- No integrity violations- No component store corruption detected (for Scan and Check)- \"Restore operation completed successfully\"Search still doesn't do anything.  (I also unhid the Cortana button, and confirmed that it ALSO does nothing.)I also recently tried running a \"Reset Windows Search\" PowerShell script from the official Microsoft Downloads site. (Download #100295)It did not fix the issue.My main reason for hesitating on the \"create new user account\" option is that I'm not entirely clear on the consequences and end result of that option.That is, if my ultimate goal is to basically have everything the way it is now (but with Search working), what will it take to get there from \"new user\"?  Will I have to reinstall anything?  Will some of my programs forget their settings and history?  Will my customization and personalization settings be lost?","First of all it is for troubleshooting. After you created it you can delete it with another click but we get to see if the problem persists (so is with your system) or not (so is with your user).","After you ran those command administering a reboot isn't unwise.","After you ran those command administering a reboot isn't unwise. Yep!  I restarted.  No change.I created a new user account.  (Using net user username password \/add ) Search does not work for the new user, either.One slight difference:  The new user defaulted to large icons on the taskbar, so there was a search bar present with \"Type here to search\".When clicking in it to search, it would simply disappear (and nothing would happen if I typed), until I clicked something else when the \"Type here to search\" prompt would reappear.Also tried setting HKLM\\Software\\Microsoft\\Windows Search\\SetupCompletedSuccessfully to 0 and restarting.  That also did not work.","Was any kind of antivirus software active prior and during the upgrade? Those are known to break a proper upgrade from 7 to 10.You can try to use the software Everything in the meantime. Also try to do an in place upgrade using the media creation tool found here: https:\/\/www.microsoft.com\/en-us\/software-downlo...","Interestingly, most of our machines had AVG running when I performed their upgrades (and yes, a couple of them do exhibit this Search malfunction, though most don't), but this one in particular was upgraded by my IT contractors and I'm almost certain they DID disable AVG during the process.To confirm I understand correctly, you're suggesting just running the in-place upgrade again to \"repair\" the installation?  (I originally used the Media Creation Tool to upgrade from Win7 to Win10 v1903.)","You can try it. If the system repair commands do not fix usually this is the next step down the escalation ladder towards Format C: and do a clean install","Well, I gave it a shot.  I disabled AVG and ran the Media Creation Tool for an in-place \"upgrade\" (I'm on 1909, now).Search still fails to open.I'm not sure the feature is worth a wipe and fresh OS install at this point.  There are times I'm slightly inconvenienced by its absence, but I can get by without it.","A good replacement is the software Everything. It searches by indexing aswell and its lightning fast after building the initial index.Also my advise would be to uninstall all third party antivirus. It is in my humble opinion mostly snakeoil with a dash of backup solutions (which are if build reliable and performant ,what most of this garbage isnt, a great benefit for data security).It will make your system feel sluggish and in best cases cause weird behavior in worst cases serious bugs."]},{"symptom":"Windows 10 veraion 1909 doesn't install on my system.        I just download the windows update assistant from microsoft official site and started to install. All the requirements were good(disk space, cpu, and ram). All was working fine after a window said that i need to restart my computer for the update to take effect. I clicked on restart now and it was saying working on updates this would take a while don't turn off the pc. I waited till 30% and then it automatically turned off my pc, saying undoing the changes and my pc turned on without the latest update on. Can you help me??","solutions":["Hi epurescudavid With these major upgrades, the most successful method is to upgrade from the Windows 10 ISO - you download the ISO and then perform an Offline UpgradePlease Note, follow the steps, this is then just an update and your files and applications will remain untouched . . .Click this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), then choose ISO, not USBWhen the ISO file completes downloading Disconnect from the Internet Temporarily disable any 3rd party Anti-virus you may have installed Then, in Windows File Explorer, double click the ISO and then run Setup.exe to begin the upgrade . . .","I will contact you later, thanks for the response!!! ","Hi epurescudavid, glad to Help, please let me know how you get on . . .","I have the same issue, gets to 30% then does something that his does. Im on 1809 now and under updates it states that there are no more updates. I have been trying to get 1909 to install for weeks now. I have tried literally everything except a clean install. Please let me know if you find a solution. I've tried the media creation tool. But I've updated drivers, I've uninstalled anti virus, turned off firewall and VPN. I've ran CC cleaner, ive restarted the update service, unplugged non essential peripherals. I've ran DISM, AND SVC scans. I've ran troubleshooting, I've used the update assistant. I've uninstalled any apps that are old and not used to make sure there is no compatibility issues. That's all I can think of off the top of my head but I have tried everything I can think of and everything I've read and seen online. I just really dont want to do a clean install but its looking like that's what I'm going to have to do. I'm downloading the ISO now. Hopefully someone can help me out before I have to do clean install. I'm going to attempt updating from ISO before but have a feeling it wont work considering nothing so far has. This is crazy that Microsoft cant just make this happen like its supposed to. ","Also forgot to mention the error code I found when using the media creation tool. Its saying 0x8007042B - 0x2000D. Also says \"the installation failed in the SAFE_OS phase with an error during MIGRATE_DATA operationAnd wanted to say good luck to epurescudavid. This has been a pain for me. Might want to just skip to clean install and to avoid all this. But if you figure something out please let me know. Thanks","i have a brand new HP OMEN plugged it in a few windows updates where ready to install so i went ahead and clicked update now all good except for KB4530684  it keeps saying as the customer above points out gets to 30% and says cannot complete then uninstalls the 30% and back to square one. i have tried this 10 times? i should not have to try and sort this on a new £3000 computer.HP have apologized and said Microsoft will send out a fix to resolve it.I would say it is not right to say to customers with no advanced computer skills click this run this sequence of events do this then try that? why can,t Microsoft sort it they sold windows 10? they know customers are having problems they must have the expertise to sort it out....","I fixed it finally. I tried the firat method with the media creation tool and it did not deleted any apps it just install the latest update 1909.Thank you very much for the help! Let me know if you fixed it too,BENQAV!","I fixed it finally. I tried the firat method with the media creation tool and it did not deleted any apps it just install the latest update 1909.Thank you very much for the help! Let me know if you fixed it too,BENQAV!I had a level 2 helpful windows guy spend hours on the phone finding out windows was not installed correctly at HP he reinstalled a new windows suite and it is now resolved  for installing updates ect.my omen computer direct from hp £3000?......3 weeks old"]},{"symptom":"On screen keyboard changed from black to white        My On screen keyboard has changed from black to white following  an update this week.I hate it!How do I get my old keyboard back please.I have a Microsoft surface pro, bought February 2018.","solutions":["Hi Ann Most likely you have received the version 1903 Feature Update, what color is your Taskbar at the bottom of your Desktop?Please try this: Open the Settings App (gear icon on your Start Menu) Go to Personalization - Colors Set the top option - Set 'Choose your Color' to either Dark or Custom Set default Mode to Dark You can also set App Mode to light or dark separately form Windows Mode and there is a new feature in 1903, where form each Apps settings, you can individually set an app to either dark or light mode . ..If this is not the cause of the problem, please let me know . . .","Thanks.  I've got the Black keyboard back, but also got a Black favourites bar, which I can't change.Why, why, why do they have to change things?","Which version do I need to go back to, to go back to what I had before, that I liked?","But how do we can change app mode of on screen keyboard?","I have an alienware 17 r4 laptop, my touch screen keyboard ( activated from task near the clock, \"WAS ALWAYS BLACK\" after the last update is white \/gray\/light blue... Why???if I use the options explained here, I end up having some software like Chrome with a black interface, witch I don't like... I want my black touch screen keyboard back ( without changing any other software window\/interface color)so just ad a color option in the keyboard setting...and please stop doing changes on things nobody request.","Here hereI don't think anyone is listening.  I went back a couple of versions to get my keyboard back, but that means I may have lost out on more useful\/necessary upgrades.  So frustrating.","I agree with the suggestion to allow us to change ONLY the keyboard color.","Hello Microsoft.Are you listening to us?My laptop keeps wanting to update, and I don't want to if it's going to change my keyboard colour again.I had to go back a couple of versions\/steps to get back to what I liked.Why can't you leave colours alone?","I can't even follow these directions. My keyboard changed from white to black after update and it isn't 1903. can't find any help that matches my screens. Trying to fix it has now turned my start screen gray and it won't go back to black. So annoying.","Do not have change color to dark or custom and no default setting."]},{"symptom":"Remix 3D Sunset        Hello,   On January 10, 2020, Microsoft support agents will no longer reply to posts on theRemix 3D topic in Apps on Windows 10.  While we will moderate the topic, we won’t be monitoring or answering questions.  You are welcome and encouraged to continue to use the forum to ask questions and interact with each other.    Check this page for more information about the Remix 3D retirement. ","solutions":[]},{"symptom":"Laptop restarting for 14 hours        Hi theremy laptop was due an update so last night I clicked on Update and Restart and it was stuck on the blue restarting screen all night. I then went to bed and woke up this morning and it is still “restarting”. I even forced shut down with the button and then waited and turned it on again and the blue restarting screen cane up again?!Please let me know if you are familiar and can fix this issue.Many thanks","solutions":["Hi Pippa, Are you connected Wirelessly? Can you try to directly connect to your Router using Ethernet Cable and restart again your Laptop.Most likely, there's an issue or corruption on the updates that's why you're experiencing this kind of issue.We just need to isolate the issue and make sure it's not on your network's end. Thanks and regards,"]},{"symptom":"Laptop Restart Automatically        Hello there, from the last 2 weeks my laptop is restarting by itself. I have noticed when my DVD\/CD Rewritable Drive starts showing a green light my laptop machine runs by itself by restarting the laptop on its own. Please help does its software problem or hardware problem to be solved.   ","solutions":["Hi Panka, Just to make sure and isolate the issue. Please try to do clean boot on your end. Kindly check this article: https:\/\/www.windowscentral.com\/how-clean-boot-w...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Error Code x0800701B1 A device which does not exist was specified.        As can be seen by the two windows at the lower right-hand corner of the screen, the \"1 Interrupted Action\" window states that a device which does not exist was specified; however, as can also be seen, the computer does recognize two external hard drives.  It's like a barking dog with a wagging tale.  When copying and pasting files, jpegs in this instance, I can clearly see the images.  When I begin the transfer, the software counts the number of files (over 20,000 images) and estimates the download time at 50 minutes.  Then it suddenly displays an error code window.  Oh, and when I try to eject the device, I get a window that says it's still in use, etc.Step by step, how does one fix a laptop with a multiple personality?  Does my computer need the Geek Squad or psychoactive medication?","solutions":["Hi, We understand your concern as you are facing issue with file transfer on the external drive.In order to get clarity and to assist you accordingly, please reply with the answers to the questions below. Does this error specific to only one drive or all USB storage devices?Do you get this error when the same external drive is connected to any other devices?What is the make and model of the PC?What is the Windows 10 version and Build installed? (Typewinver in Windows search\/Run command) We await your response. Aditya RoyMicrosoft Community – Moderator"]},{"symptom":"Remote Desktop        The Remote Desktop facility was working on my laptop until the end of December, but it is not working any more.  Has there been a Windows upgrade or something that is preventing it?  Any help would be much appreciated!","solutions":["Hi Donna! I'm Steve, an Independent Advisor and a Windows user like you. I'm happy to help with your query.What happens when you attempt a Remote Desktop connection from your laptop and it doesn't work? If you're receiving an error please share the details here."]},{"symptom":"File Explorer Preview        How do I turn off preview in Excel file explorer?","solutions":[]},{"symptom":"After installing 1909 content update, sound stopped working completely with Realtek driver        Hello,After installing the 1909 content update, sound stopped working completely. As the system gets initialized, I hear several quiet thuds in the speakers, then the speakers are silent.I use the MSI GL75 9SE laptop. It came with Realtek HD Audio driver installed.Steps I tried until now:1. Checked if the speakers aren't muted – they aren't.2. Checked if the device driver works normally – it appears to be working (except no sound).3. Tried to test the speakers – \"Failed to play sound test tone\".4. Tried to check the driver – it is shown as working fine (except no sound).5. Tried to run the troubleshooting tool – it wants me to restart, but this does nothing.6. Tried to update the driver automatically – it did, but the latest version of the driver doesn't work too.7. Tried to install the driver from the MSI website (https:\/\/www.msi.com\/Laptop\/support\/GL75-9SE#down-driver&Win10%2064) – had to uninstall the driver before Windows let me do that. Doesn't work.8. Switched to the generic Windows drivers (High Definition Audio Device) – this kinda worked, as in – the sound returned. It sounds worse, though, and updating the driver automatically brings back the broken version.Given that the speakers work with the default drivers and it happened just after the update, this doesn't seem like a hardware issue.","solutions":["Hello MATEUSZ, I am Andrew an independent advisor. It looks like you did a whole lot of troubleshooting. Have you rolled back the 1909 update to see if that fixes the issue?Do that, you can go to Settings> Update and Security to roll back the update.Let me know if that fixes the issue.Andrew"]},{"symptom":"I've been getting this error a lot recently and I tried the suggested tips        I've been getting this error:Windows Script HostScript: C:\\windows\\system32\\Maintenance.vbsLine: 10Char: 2Error: Type mismatch 'CInt'Source: Microsoft VBScript runtime errorand I read This thread about the same error but it didn't help.I have recently uninstalled Bittorrent because It's annoying and makes my laptop lag on startup.now for the questions asked there to save you some time-Was there a major change or an update on your system, prior to which you weren't facing this issue?No, I haven't updated windows since September because my internet is already very slow, I know that it's risky but I don't want to make my internet even slower.-What is the Windows 10 version and Build installed? (Type winver in Windows search\/Run command) I'm running Windows 10 Version 1903 (OS Build 18362.30).-Does MSI afterburner Bittorrent still showing up in Task Manager under startup tab?No.I did a clean boot but it didn't help (MalwareBytes service wont turn off so maybe its that(?)).Thamks in advance.","solutions":["Hi Kai\" 1 Open Windows File Explorer Navigate to: C:\\WINDOWS\\system32\\ Scroll down to find Maintenance.vbs Right click that file and choose Edit That should open in Notepad Replace the contents of that file with this one line and save that file: Wscript.Quit That's will remove that error for you . . . 2 If Maintenance.vbs does not exist on your PC Right click your Desktop and choose New - Text Document Put this text in that file: Wscript.Quit Then click File - Save As At the bottom of the save as dialog, set save as type to *.* Save the files as Maintenance.vbs Note you must enter the vbs file extension yourself Open Windows File Explorer Navigate to: C:\\WINDOWS\\system32\\ Copy that file from your Desktop into that folder Restart your PC","That would make the problem disappearbut that just makes it close itself. making it useless, so id rather keep the error than practically delete the file"]},{"symptom":"Error 0x80070020-0x90018 when upgrading from Windows 7 to 10        * Locked* The other thread: Upgrade from Windows 7 to Windows 10? While upgrading Windows 7 to Windows 10, I received error code: 0x80070020-0x90018. How do I fix this this?***Modified title from: windows 7***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive an error while upgrading from Windows 7 to 10. I’ll certainly help you with the issue. However, please let us know the details requested below: How are you trying to upgrade to Windows 10?What is the make and model of the computer?Have you purchased a license for Windows 10?Do you have a security software installed on the computer? To upgrade to Windows 10, we need a valid license and Windows 7 Service Pack 1. For more information, seeWindows 10 system requirements. You may want to try using the Media Creation tool to upgrade to Windows 10. You can go to the websitehttps:\/\/www.microsoft.com\/en-in\/software-download\/windows10 and click on Download tool now. Once the tool is downloaded, refer the steps mentioned in the articleHow to perform an In-place Upgrade with Windows 10 Step-by-Step Guide byPaulSey… If you still receive an error, refer the steps mentioned below: Hardware clean boot: I suggest you to follow the steps mentioned below and disable the devices is Device Manager: Press Windows key + R. This will openRun. Alternatively, you can go to Start and search for Run.In Run dialog box, type devmgmt.msc and hit enter.Now, expand Display adapters, Printers, Sound, video and game controllers one by one.Right click on the devices inside the section and click onDisable device.If asked for restart click on restart later and disable all the devices.Close the device manager window. Once all the devices are disabled, you can perform clean boot. Performing a clean boot will start the computer with minimal set of drivers and programs, to determine whether a background program is causing the issue. Some of the Startup programs will not load after performing a clean boot on the computer. However, that functionality will return when you reset the computer to start normally after finishing the troubleshooting. To perform a clean boot on the computer refer to the article How to perform a clean boot in Windows.  After performing clean boot, proceed with the installation.  Note: Please refer the section Reset the computer to start normally after clean boot troubleshootingto boot the computer in to normal mode after troubleshooting. If you have any third party security software installed on the computer, disable it temporarily. Note: If you disable the security software or firewall, the system might be temporarily exposed to security threats and risks. Please make sure to turn it on after performing the steps. You can also refer the steps mentioned in the article Get help with Windows 10 upgrade and installation errors. Let us know the results. Regards,Nikhar KhareMicrosoft Community - Moderator","Amiruddin Abdul Azizevidently does not need help anymore. See:Upgrade from Windows 7 to Windows 10? (Amiruddin Abdul Aziz Replied on January 6, 2020)"]},{"symptom":"Microsoft Family - Child can remove themselves from the family        I have setup Microsoft Family with my children added as child accounts.My children can login to their accounts at family.microsoft.com and simply click the link \"Leave family group\" and they are removed from the group and from any screen time limits etc.This seems like a serious issue as it negates the point of setting any restrictions if it is this easy to circumvent them.Please advise if there are additional settings required to prevent children from removing themselves from the family group.I've checked the DOB for each child and that is correct.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you are facing issues with Microsoft Family group. Usually, when you add a Child account to Family group, the child account will not be able to remove themselves from the Family. Only the Adult account can remove the Child account from the family. One of the possibilities that I can think of is that the Child account was added as an Adult account by mistake and that could be the reason your Child was able to remove him\/her from the Family. I would suggest you to try adding the Child account once again to the Family Group and see if the Child has an option to quit the Family group. Refer the articleAdd members to your family group Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Hi Prakhar,Thank you for your response. I've tried removing and re-adding the child account and it is still possible for them to leave the family group.They are definitely added as a child as they are unable to set screentime, although they are able to opt-out of activity monitoring.Thanks,Chris"]},{"symptom":"KB4516065 Installation Fails with Error 80092004        This is the only patch that is getting an error at installation. I've tried update troubleshooter, standalone install and clearing Software Distribution folder without success. Are others having this issue? ","solutions":["Had the same problem. What fixed it was to download these two KBnnnnnn patches from the Windows Update Catalog.KB4490628  (make sure this one gets installed successfully first)KB4516065","Thanks lintekPC.  After 2 days trying allsorts to install KB4516065. this solved the problem.I used Internet Explorer to download the files even though Chrome is my default browser. I read somewhere that this makes a difference.","Thank you, Lintek! This helped me as well. I was finally able to install KB4516065 on Windows 7 x64 once KB4490628 was installed.","Unfortunately, even after installing KB4490628, the installation of KB4516065 failed with a new error, 8007312.  I am running Windows 7 x64 Pro. ","Also worked for me on Windows 7 Professional Service Pack 1 after trying many fixes on the internet","Cheers bud, thats just solved a few problems I was having updating some old 2008 servers!","Thank you LintekPC.Your recommendation worked for me. Windows server 2008 R2lintekPCHad the same problem. What fixed it was to download these two KBnnnnnn patches from the Windows Update Catalog.KB4490628  (make sure this one gets installed successfully first)KB4516065","Hi,I don't see the update for KB4490628  in my options, both Optional and Important. Does anyone have any other solutions?Thanks !","Al,Download KB4490628 from <here>. Select the correct bitness (x64 or x86) for your computer.","That did the trick! Thanks so much"]},{"symptom":"Microsoft edge        aol yahoo mail will not open also facebook games. Get redirect to guce. Any fix? Computer is new","solutions":["Hi Kenneth Please see Ron Baker's answer on this thread: https:\/\/answers.microsoft.com\/en-us\/edge\/forum\/...","Do you mean AOL mail won't open the initial webpage to sign-in or when you sign-in then your mail doesn't load.What URL are you using for AOL mail."]},{"symptom":"Unexpected Kernel Mode Trap (amdppm.sys)        I've been getting irregular BSOD lately with the error Unexpected_Kernel_Mode_Trap mentioning amdppm.sys service. Any ideas?dmp file","solutions":["Hi Stik, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.It seems like a processor issue as amdppm.sys was named. It looks like a read\/write issue seeing the bucket id.Please run a Processor test and let us know the results. https:\/\/www.tenforums.com\/tutorials\/16474-prime...Content on the above blog is written by a Microsoft MVP so it is safe. However, do watch out for the ads.Technical Information: 0x7f_8_amdppm!ReadIoMemRaw","Hello there, I've run Prime 95 three times, for over an hour, with no issues on two of the runs, the system hanged once but no BSOD or error msg, no Windows logs about it were created.I've also run memory and ssd\/hdd diagnostics which also found no issues","Tried repairing windows with the installation stick but it didn't work. Problem fixed by moving to Ubuntu, 2 weeks no crashes"]},{"symptom":"Can't Activate My Windows 10 Error Code: 0xC004F025        I'm trying to activate my Windows 10 Pro but I keep getting this Error Code: 0xC004F025 after like 15min loading, when I click on, activate button and I think due to this problem my windows defender is not working too. Can anyone resolve my issue here.","solutions":["Hi Waezz. I'm Greg, an installation specialist and 10 year Windows MVP here to help you.For Defender not working see fixes here: https:\/\/answers.microsoft.com\/en-us\/protect\/for...http:\/\/www.thewindowsclub.com\/unable-to-turn-on...How was Windows 10 originally Activated on the PC? Did it come preinstalled from Factory, was it Upgraded with free or paid Upgrade, or was it a retail copy and license?For Upgrade, when you first upgraded and it activated it assigned a permanent Digital License to the PC in Microsoft Activation Servers so you can reinstall any time and in any way you want as long as you reinstall the licensed version. It should reactivate soon after going online. More about Digital LIcenses vs. Product Keys here: https:\/\/support.microsoft.com\/en-us\/help\/12440\/...You can move the Digital License to new hardware following this procedure: https:\/\/support.microsoft.com\/en-us\/help\/20530\/... Factory installed WIndows 10 has the Product Key embedded in BIOS or UEFI firmware and should activate itself, but you can check for the key by installing ProducKey:http:\/\/www.nirsoft.net\/utils\/produkey-x64.zip to copy and paste the OEM-BIOS key into Settings > Update & Security > Activation > Change Product Key.Retail keys must be reinserted for reinstalls during install or in Settings. What is the Status and Edition shown at the top of the page at Settings > Update & Security > Activation?Run the Activation Troubleshooter at Settings > Update & Security > Activation. If it says you have a Digital License then no matter what method above only the Generic Version Key can be inserted to reactivate:http:\/\/winaero.com\/blog\/generic-key-to-install-... If this fails you can contact Microsoft Support: https:\/\/partner.support.services.microsoft.com\/... I hope this helps. Feel free to ask back any questions and keep me posted. If you'll wait to rate whether my post helped you, I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","Any 3rd party anti virus, security, cleanup programs ever installed on the computer?","No, nothing just adobe cloud, google chrome and Inkscape is installed. My windows was activated suddenly this problem.","Hi Waeez I am Vijay, an Independent Advisor. I am here to work with you on this problem. 1. Get help with Windows activation errors (includes Windows 10 activation troubleshooter) -https:\/\/support.microsoft.com\/en-us\/help\/20527\/... 2. If above doesn't work, To analyze the cause, I need the screenshot of following outputWindows Key+X > Click on either Powershell (Admin) or Command Prompt (Admin) Copy below and paste into Powershell \/ Cmd windows and Enter slmgr.vbs \/dlv Do let me know if you require any further help on this. Will be glad to help you.","Hi Waeez My name is Andre Da Costa; an Independent Consultant, Windows Insider MVP and Windows & Devices for IT MVP. I'm here to help you with your problem.Open Start, type: CMD Right click CMD Click Run as administrator At the prompt, type: slmgr.vbs \/dlv Hit Enter Take a screenshot of the resulting dialog then post in a reply here. Learn how: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...If you have your Windows 10 Pro key and its genuine, try chatting or telephoning support and they can assist with reactivating.https:\/\/partner.support.services.microsoft.com\/...You can also call support: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","Why do you need a screenshot, There is my product ID and other sensitive information.","Why do you need a screenshot, There is my product ID and other sensitive information","I'm trying to activate my Windows 10 Pro but I keep getting this Error Code: 0xC004F025 after like 15min loading, when I click on, activate button and I think due to this problem my windows defender is not working too. Can anyone resolve my issue here. Please provide the relevant information requested by the Independent Advisor to analyze your Activation Station. Several them asked for this and you have ignored their request.Click Start, type: CMD Right click CMD Click Run as administrator At the prompt, type: slmgr.vbs \/dlv Hit Enter Take a screenshot of the resulting dialog then post in a reply here. Learn how: https:\/\/answers.microsoft.com\/en-us\/windows\/wiki\/windows_other-windows_programs\/how-to-include-a-screenshot-in-your-post\/2594b08e-32a3-476a-85a6-b021181be7e4","We need this information to determine if maybe its software glitch or your Windows installation might need to be updated. This is information we always ask for when diagnosing activation problems.","There is also no sensitive information stored in it."]},{"symptom":"Uninstall \/ disable Microsoft Raw Codec Support        Hi!I find the MS  Raw codec files support to slow down folder browsing in folders with many raw camera files and want to know how I disable or uninstall Microsoft Camera Codec pack for Windows 10. I have googled for hours but can't find anything about this apart from suggestions altering the Registry. I think Microsoft should release an uninstall option for this.Kind regardsSteen","solutions":["Hi and thanks for reaching out! I'm an Independent Advisor and a Microsoft user like you. Please allow me to assist with your issue.There was never a Microsoft Camera Codec Pack for Windows 10 released. I suspect you might have Raw Image Extension installed. You can uninstall it from Settings > Apps > Apps & Features, search for \"Raw Image Extension\" and click Uninstall.https:\/\/www.dpreview.com\/news\/2812846720\/micros...Please let me know if I can help you further! Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi and thanks for your swift answer.I can see in the Registry that it's called Microsoft Raw Image decoder, which must be the Raw Image extension. I remember installing it about a month ago, to be able to see raw image thumbs in explorer.There is nothing to uninstall in App's and Features unfortunately and that puzzles me also. Never the less I still see raw image thumbs in explorer.Kind regardsSteen","Would you be comfortable disabling thumbnails completely, even for non-RAW files?https:\/\/www.tenforums.com\/tutorials\/18834-enabl...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hi again.No, that would not be a realistic option because thumbnails come in very handy apart from those of raw files. I wouldcertainly expect MS to offer a solution to this problem. I just can't believe that MS offers a product or plugin to the OS that can't be disabled or uninstalled.Do you know of any way to forward this issue to the developers at MS?Kind regardsSteen","Ok, it's not possible to disable thumbnails just for a certain file extension. The best way is to send a feedback via Feedback Hub.https:\/\/support.microsoft.com\/help\/4021566I have another suggestion to workaround the issue. Set the folder optimization to \"General Items\" or \"Documents\" for your folder of raw images. You can reach this by right-clicking the particular folder, select Properties and navigate to Customize tab. This setting will be saved in a file \"desktop.ini\" within the folder, so don't delete it.Please let me know if I can help you further!","Ok, I will do that. Thanks again for your kind help :-)B.r. Steen","You're welcome!"]},{"symptom":"windows10        Dividir desde esta conversación.I can’t dowlawed windows10***Moved from: ES-ES***","solutions":["Hello EvaOceguera4,Thank you for writing to Microsoft Community Forums.I understand that you are not able to download Windows 10 on the PC.It would be great if you can answer these questions to assist you in a better way.When you say “I can’t download windows10” are you attempting to download the Windows 10 ISO or are you trying to install Windows 10?Do you get any error message or code?Which build version of Windows 10 are you using currently?Refer the article Which version of Windows operating system am I running?If you are trying to download Windows 10, you can click on the link to Download Windows 10Hope it helps.Regards,Zaki"]},{"symptom":"Windows 10 activation issue error code: 0x800070520        Hello,I got a completely new computer, and I'm having activation issues.Everyday I run the activation troubleshooter, only to give me this error code.Thanks in advance.***Original title: Error code 0x80070520***","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK .To check if your computer is activated;Right click Start, click Command Prompt(Admin)Click Yes to \"Do you want to allow this app to make changes to your device\"enter slmgr \/xpr  Then hit the Enter keyIt will tell you when it expires. ","Hi, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Get help with Windows 10 Activation errors: https:\/\/support.microsoft.com\/en-in\/help\/10738\/...https:\/\/support.microsoft.com\/en-in\/help\/12440\/...To better diagnose the issue, Please send us the results of both steps. 1. Right click Start>Command Prompt-Admin and type in the following command: slmgr.vbs \/dlv You will get a window, take a screenshot using snipping tool and paste it it next reply.2. Run the activation troubleshooter and send us the snip too. Using the Activation troubleshooter-Windows 10 https:\/\/support.microsoft.com\/en-in\/help\/20527\/...How to get a screenshot and post back: https:\/\/answers.microsoft.com\/en-us\/windows\/wik...Please let us know if you need any assistance in posting.","Here are the snips","Hi, Thank you for writing to Microsoft Community Forums. I understand your query related to activating Windows 10 on your PC.  Usually, if you purchase a PC from an OEM with pre-installed Windows then the license is provided by OEM and the PC should be activated automatically with a genuine license. If you have purchased the PC from OEM and facing activation issues, then please get in touch with the OEM for license of Windows 10. However, based on the screenshot you have provided it seems that the Windows was installed using a Default Product Key, and Default Product Keys can only be used to install Windows but not to activate the copy. In case, you have purchased the PC with a retailer then you need to get in touch with the retailer for the license of Windows 10 to activate the copy of Windows installed on the PC. If the copy of Windows was purchased from Microsoft then you may need to get in touch withMicrosoft technical support team to get further assistance. Regards,Prakhar KhareMicrosoft Community – Moderator"]}]}