{"windows":[{"symptom":"second monitor icons        recently I have set up a second monitor on my windows desktop. everything is working fine however I would like to know if there is a way to mirror my desktop icons without mirroring the hole screen","solutions":["Hi gabrielferwerda, unfortunately, if the desktop is extended across the two monitors it is effectively the same space and cannot have duplicates.a couple of thoughts, both a little laborious. 1) make copies of all the shortcuts, they will have to have slightly different names such as shortcut and shortcut-copy or shortcut(2) then drag the copies to the second monitor.you can use ctrl+C (copy) and Ctrl+V (paste) to do this.2) where possible, pin them to start. if the shortcut is to an app or program, right click and select pin to start.the start menu is the same on all monitors. 3) use the feedback hub (winkey+F) to make the suggestion to the development team, perhaps it is something they could add in a future feature release"]},{"symptom":"Black Screen HDR After Adjusting Volume 1803, 1903, 1909, 19013        I've tested past, current versions of Windows and scoured various forums for a fix. This is happening to many many people yet still not fixed... The Windows 10 Volume OSD turns HDR off or appears to have some sort of affect whilst adjusting the volume. When the Windows volume overlay appears on screen while HDR is enabled in fullscreen apps or games, the monitor goes dark. Once the overlay is off screen it turns back on. This is very annoying as I would like to use HDR without my screen turning off in the middle of competitive gaming. Also for what ever reason Nvidia Shadow play or recording doesnt work while HDR is enabled in Windows. Can someone make note of this and please fix it... I know this has been reported before but even on the insider additions of Windows the issues still resides.. :( ","solutions":["Bump, Microsoft please acknowledge this bug... ","+1 to the black screen issue.I am really tired of bumping a volume button or skipping a song and having my screen go black for ~5 seconds. How is this even an issue?!","Microsoft please fix and acknowledge the issue. Bump.","This bug is so annoying, every time I get an achievement in Halo the screen goes black. Very annoying.","Bump, MS PLS","There is no need to keep bumping this, I am quite positive they are fully aware that their HDR implementation is ..bad. Just a question of when enough people are using HDR that it becomes worth allocating resources to fix it. The new wave of displays and televisions should add a little more pressure as will the continuing support of HDR on larger platforms. ","Bump, same issue.. ","The issue still exists even in fullscreen windowed modes for example running WoW Classic in Windowed Fullscreen changing the volume in windows ar alt tabbing black screens the game for a few seconds, it is insanely annoying.","Bump, super annoying and cant enjoy my nice HDR monitor... PLEASE FIX!","The same problem here.."]},{"symptom":"Can't make the screen smaller?        When I plugged in my pc to use it, everything was big. I checked settings, and the size is set to 125% and is also greyed out. What can I do to change it back to 100%?","solutions":["Hi Roshi. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Are you using an Administrator Account? Is there any kind of error or reason stated why the setting is greyed out?What Antivirus are you using. I'd uninstall it and use built-in Defender which always offers best Windows performance with least issues, and is from Microsoft who knows how to protect their OS best.Update the Display driver from the PC or Display adapter maker's Support Downloads web page for your exact model number, HP Serial Number or Dell Service Tag - from the sticker on the PC.While there check also for newer chipset, BIOS\/UEFI firmware (very important), network, sound, USB3 and other drivers, comparing to the ones presently installed in Device Manager reached by right clicking the Start Menu.If this doesn't give you the latest or ideal driver for what you need, compare it to the driver offered by the Intel driver update Utility here:http:\/\/www.intel.com\/content\/www\/us\/en\/support\/... or the Nvidia Update utility here: http:\/\/www.nvidia.com\/Download\/Scan.aspx?lang=e... or the AMD autodect utility here: http:\/\/support.amd.com\/us\/gpudownload\/windows\/P... For Display issues one fix that is working is to Roll back or Uninstall the Driver on the Display Device > Driver tab, restart PC to reinstall driver.You can also try older drivers in Device Manager > Display device > Driver tab > Update Driver > Browse > Let Me Pick.Then you will know you've tried everything in addition to Windows Update drivers.Adjust the screen resolution until it fits and looks best at Settings > System > Display.If the Settings is still greyed out and needs adjusting, try enabling the built-in hidden Administrator used only for emergencies like this:https:\/\/www.tenforums.com\/tutorials\/2969-enable...Sign in to see if the setting will now change. If so create a new Local Admin account in Settings > Accounts > Family & Other People > Other, as shown here:http:\/\/www.howtogeek.com\/226540\/how-to-create-a... Sign into the new account, test if the problem persists, if not then move your files over, test that all programs work or else reinstall them, then when ready delete the old account in the same place.You can then change it to your Microsoft account if desired: https:\/\/www.tenforums.com\/tutorials\/5375-switch...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Ark Survival Crashing on Startup        I have installed Ark: Survival Evolved on my PC through the windows 10 store. Upon starting the game, it instantly crashes, not even making it past the splash screen. ","solutions":["Hi, RyanCarter5 My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"Can not open Apps in Settings        Hi all,I got a new laptop with Windows 10 installed. Everything is working fine except for I can not open the Apps feature in Settings. Every time I click on it, nothing happens and the Apps window just disappears right away. Have anyone got this issue before and how did you solve it?Thank you!","solutions":["Hi TienLe93 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps on how to repair missing or corrupted system files. Check this article for detailed instructions. It is written by a Windows Support, so it is safehttps:\/\/support.microsoft.com\/en-ph\/help\/929833...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","Have you checked for update and installed all updates for Windows?Are you facing the same issue with other settings and apps?Try restart your PC.","Hi Joseph,Thanks for your response. I followed instructions in the article and run System File Checker. The result was\"Windows Resource Protection did not find any integrity violations.\"Nothing changed after the scan. The Apps continues to crash :(","Hi,Thanks for your suggestion. Everything is updated. I restarted my PC also. Only Apps is crashed, everything else in Windows Setting working fine.","Hi TienLe93, - Enter Windows RE [Recovery Environment] - Press and hold the power button for 5 to 10 seconds to perform a complete shutdown[Do this three or more times.] - Windows will start in the Recovery Environment and from there you can access System Repair. - Go to Troubleshoot > Advanced options > Reset this PC - Then you will have 3 options: 1. Keep my files and applications. 2. Keep my files. 3. Not save anything. - Select the option that suits your needs and click Reset. Let me know how it goes. Thanks!","Hi,I reset my PC and still nothing changes.","Hi TienLe93, I will release the question for other experts come to give his opinion, I am sorry not to find the problem.Thanks!","Hi TienLe93My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try running Apps and Features from a search rather than in Settings.Press Windows key and type Apps and Features and click on the search result and see if it opens directly.Hope this helps."]},{"symptom":"proxy serversvrs VPN vrs?? new to networking and learning basics.        give me the 411?* Moved from Community Participation Center","solutions":["give me the 411?* Moved from Community Participation Center-I don't think that anyone here will be willing to teach you everything you want to know about this topic.Your favorite search engine should find a lot of information, many, many articles you can read.Don"]},{"symptom":"Downloads        Having trouble with downloading pdf  documents.  They won't finish so I can open them: they keep cycling through a download multiple times at a fast pace.  I haven't found a fix for it.  Does anyone have a suggestions on what to do? ","solutions":[]},{"symptom":"Windows 10 Cant access shared folders on same local network        OMG I am LOATHING this new windows 10 system. Windows 7 I had all my home pcs networked together for the files and folder I needed. I have spent countless hours trying to get my updated windows 10 desktops to be able to access the SAME folders that have been shared before.Before anyone recites the generic solutions. I am a certified network technician so I have a bit of knowledge of setting up servers and networks. This should NOT be this difficult to share some folders on a home network.Heres what Ive done so far. I've done the services stuff. Changed all needed services to automatic and made sure they are running.Ive gone into windows features and turned on SMBIve added the other desktops to each PCs host fileIve shared folders to EVERYONE(even though I know I shouldnt) to see if that helpedI have made sure in Folder Options View section that network wizard is checkedI have pinged each pc by name and by IP address which they do see each other.I even completely shut down the firewall on all desktops and still no goI even seen a post to add the other desktop IP and user name to the windows credentials sectionThis should NOT be such a pain in the A&& for an experienced IT person let alone regular end users.Can someone please help me setup my LOCAL network windows 10 desktops so I can share data between them. This is ridiculousI rarely ever have to post a question because I do very good at research and googling for other peoples solutions. Yet here I am needing help with what should be a basic function on windowsWhen  try to access a desktop on the network tab in file explorer I can see the other PC but when I try to access it I get the usual do not have permissions to access this folder.","solutions":["Hi Andre My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Is Network Discovery switched on? To configure Network discovery on Windows 10, follow the simple steps below: Open the Settings app. Select Network and Internet. In the left panel, click either Wi-Fi or Ethernet (depending on your connection type).network and internet windows 10 unable to access shared folderUnder the Related Settings menu, click on Change advanced sharing options.change advanced sharing options windows 10 unable to access shared folderUnder Advanced options, check if the Make this PC discoverable option is enabled ( On). If it is not enabled (Off), simply enable it by toggling the button to On.turn on network discovery can't access shared folderThen click on Save changes Run the Shared Folder Troubleshooter You can do that by following these steps: Go to Settings. Locate and click on Update & Security.update & security windows 10 unable to access shared folderSelect Troubleshoot > Shared Folders Follow the on-screen instructions to finish up the process Exit program and restart PC. Hope this helps.","Hello Jon and thank you for reply. As i mentioned i have followed numerous posts and forums for the usual tactics of setting up shared folders. Everything in my advanced sharing settings have been enabled and turned on for file sharing and password protection turned off.","Just some more ideas and things to check:1. Make sure the Function Discovery Resource Publication and Function Discovery Provider Host services are started (running) and their startup type is set to automatic.2. Turn off password protected sharing (to test) under Network and Sharing Center > Advanced sharing settingsWhen password protected sharing is turned on, only people who have a user account and password on your computer can access shared files, printers attached to your computer, and the Public folders.If you want to give access to shared files to other people without requiring them having an account and password on your computer, then turn off password protected sharing.","Sorry forget 2. as I misread your reply, apologies."]},{"symptom":"user names and passwords        When I boot I get the opening scree and three names in lower left corner. Two say administrator and one shows my name. How can I get rid of them?","solutions":["Hi Bob Click your Start Button, then just type netplwiz and hit Enter Is there more than one user profile listed on the resulting window? If so, before you do anything else, select your account and make sure that is a member of the Administrators groupThen select any other user profile and click Remove If there is only your own account, please let me know and we can work from there . . .","First let me thank you for the reply. I still have two admin in lower left corner. I fear my wife tried to log in and may have disrupted the settings. We are both in our 70s. First one to appear pops up that password is incorrect, I click OK and then click on the  second one and then it allows me to just sign in. Problem is when downloading updates and the pc has to restart it goes to the first sign in which has a wrong password and the screen goes black."," I still have two admin in lower left corner. I fear my wife tried to log in and may have disrupted the settings. We are both in our 70s. First one to appear pops up that password is incorrect, I click OK and then click on the  second one and then it allows me to just sign in. Problem is when downloading updates and the pc has to restart it goes to the first sign in which has a wrong password and the screen goes black."]},{"symptom":"Windows 10 Error code: 0xc0000024        I cannot boot my computer since I disabled all my startup programs last night. It even cannot access to windows interface and I cannot boot in safe mode too.It just said: ‘Your  pc needs to be repaired.The boot configuration data file is missing some required information.file:\\BCD error code: 0XC0000024’What should I do? Will all my files be lost? Please help me!!!!!!!","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Try the steps in this article first to troubleshoot the issue and let us know how you get on:https:\/\/www.kapilarya.com\/fix-the-boot-configur...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I checked that page. Is it the same with ‘error code: 0xc0000034’? In my case, the error code is0xc0000024. I found most cases with 0xc0000034 not 0xc0000024.Thank you again.","HI, I understand but the troubleshooting steps are still valid for this code. Regards, Ross","I see. And i still wonder if all my files be lost? How to back up?","If you want to try backup your files first from the recovery screen, please see this thread which gives a great guide on how to do this:https:\/\/answers.microsoft.com\/en-us\/windows\/for...Regards,Ross","Did you meet the same problem? Just google how to fix 0xc0000098, and follow some instructions in youtube, good luck."]},{"symptom":"Random Black Death Screen *Repost with update*        Okay, so I've had this Acer laptop for a good few years, always worked fine, but a few months ago, it's started doing something strange. During start up, the computer acts completely fine, but the moment I log in and reach the desktop, it starts randomly going black for unspecified amounts of time with only the cursor on screen, and then coming back a few moments later. It's also begun freezing much more often. I've tried completely reseting everything, but the issue is still occuring. I dont have the slightest clue what the issue is, so any feedback would be greatly appricated!UPDATE : A full reset of the computer has proven unsuccessful.Safe mode temporarily eliminates the issue, but network isn't available.A clean boot does not solve the issue, not even temporarilyUninstalling or updating the graphics driver does not solve this issue.","solutions":["Hi there My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Try disabling the App Readiness service in safe mode Step-1: Boot into safe mode Step-2: Press Win+S hotkey and let the Taskbar search appears on the screen. Step-3: Type ‘services’ and select the same from the top of the list. Step-4: Once a Window opens, locate App Readiness in the Name column and double-click on it.Step-5: When App Readiness Properties window appears, click on the drop-down against Startup type.Step-6: Select Disabled. Step-7: Now, hit the Apply and then OK button. Step-8: Restart Hope this helps.","I followed the steps as instructed, but the black blinking still occured after restarting, along with almost immediately freezing after loading up :(","Try re-installing or updating your graphics driver You may have to do this in Safe Mode Step 1: Right-click on the Start button on the taskbar and then click Device Manager to open the same.Step 2: In Device Manager, expand Display adapters to see your graphics, video or display card entry. If you have multiple video cards, all of them will appear here.Step 3: In Device Manager, right-click on the graphics card entry and then click Uninstall device option. Again, if you have multiple video cards, right-click on the one whose driver you want to reinstall.Step 4: Click Uninstall button. Step 5: Restart","Once again, same result as before.. unsuccessful. All I'm sure of is that whatever causes the problem is deactivated while the PC is in safe mode. :\/(Just to clarify, there were no available updates, and uninstalling was ineffective)","1. Once you have logged in and see the black screen try the Ctrl + Shift + Esc keyboard shortcut to open Task Manager.Click the More details button (if you're using the compact mode).Click the Processes tab.Right-click the Windows Explorer service, and select the Restart option.2. Alternatively, if the above steps didn't work, you can terminate and start the process again using these steps:Use the Ctrl + Alt + Delete keyboard shortcut to open Task Manager.Click the More details button (if using the compact mode).Right-click the Windows Explorer service, and select the End task option (if available).Click the File menu.Select the Run new task option.Type the following command and click the OK button.explorer.exe3. Open Start.Search for Control Panel and click the top result to open the experience.Click on System and Security.Click on Power options.Select the Choose what the power button does link on the left pane.Click the Change settings that are currently unavailable link.Clear the Turn on fast startup (recommended) option.Quick note: This feature isn't available on every installation, because it'll depend on your hardware configuration.Click the Save changes button.Restart your computer."]},{"symptom":"Unlock windows 10 device after remote lock        I had lost a windows 10 pro computer (surface book 2) , and used the capabilities on the microsoft website to lock the device.  Later, I was able to get the computer back.When I go to the computer, it's giving me the message I'd set on the MS web site.  All good.When I attempt to log in via windows hello, I get the message \"an administrator had restricted sign in.  To sign in, make sure your device is connected to the internet, and have your administrator sign in first..\"The only two options presented to me on sign in are face, and pin.  No other account presented on the lock screen.  No option to change users, or log in with my MS account username password.Any way out of this short of a reinstall?","solutions":["Hi Kevin My name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Have you unlocked the device under devices in your Microsoft account? Hope this helps.","There is no UI I can find to do so online on the microsoft sight - selecting the device shows me where the device is, and that it's locked, and a message that any of the local administrators can unlock it.","Try creating USB bootable media with Win10 (https:\/\/support.microsoft.com\/de-ch\/help\/402819...)On the first window, select your preferred language, time and currency format, and keyboard layout and click Next.On the next window, click Repair your computer from the lower-left corner. From the Choose an option window, click Troubleshoot. Click Advanced options from the Troubleshoot window. When the Advanced options window opens, click Command Prompt. Enter the following command followed by enter wmic useraccount This will list all users on the pc Ensure your Microsoft username is active by entering the following command followed by enternet user username \/ACTIVE:YES Assign admin rights by entering the following command net localgroup username Administrators \/ADD Restart and try logging on with that user account.","wmic useraccount returns no instances found.  net user lists default, Administrator - but doesn't show my windows login.Boot to safe mode wants my PIN - which doesn't satisfy the lock.Is there a registry key or other setting I can tweak from the boot to command prompt to get the login to show me an administrator login, or enter the password from my microsoft account account?I have the needed PINS, and know the passwords - just can't get windows to give me a UI that can accept them.","Boot from USB media again following the steps above and try resetting the administrator password or creating a new administrator account as below to be able to log into the pc.Enter the command in Command Prompt window to reset local admin password.net user <username> <password>Or create new admin account with the command below.net user <username> \/addnet localgroup administrators <username> \/add"]},{"symptom":"Windows 10 update from 1809 to 1903 stuck in 48%        I got a notification in my laptop to update my windows 10 1809 to 1903. Then I proceed to update my windows and after several minutes it ask me to restart the laptop to complete the update. But unfortunately, after 4 hours it stuck in 48% and there is no sign that update process is running. what should I do? i don’t want get any nightmare anymore like when i update my windows from 1803 to 1809 (at that time it caused BSOD and I need to reinstall windows)my laptop spesification:brand: samsung NP370R4Vprocessor: Intel I5 3210Mmemory: 8GBgraphic card: Radeon 8570 & Intel HD 4000storage: SSD 512GB","solutions":["Hi M.Irfan I am Vijay, an Independent Advisor. I am here to work with you on this problem. Restart your computer and you should upgrade to 1903 through Media creation tool. Execute the below steps to go to 19031. Windows Key+X > Windows Powershell (Admin) Type following (or copy and paste following) one by one and Enter net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver 2. Type following in Windows Start Search box (Cortana) and hit Enter %systemroot%\\Logs\\CBS > Rename CBS.Log to something else.If it doesn't allow you to rename - Type services in Windows Start Search box > Click Services > Scroll down to find the Windows Modules Installer service and double-click on it > Set its startup type to Manual > Reboot your computerGo to C:\\Windows\\Logs\\CBS > Rename CBS.Log > Reboot your computer > Then go back into the Services App and set Windows Modules Installer Service back to Automatic Startup (Note CBS log files contain information about windows update, SFC etc)(Source - https:\/\/partnersupport.microsoft.com\/en-us\/par_...) 3. A. Take a backup of your computer before you proceed. B. Disable any third party Antivirus (After update is successful, you can enable it again)C. You can go to https:\/\/www.microsoft.com\/en-us\/software-downlo... You can download the latest Windows 10 package from this link (media creation tool) and follow the instructions there to upgrade. Use the very simple instructions given under Using this tool to upgrade this PC to Windows 10Do let me know if you have any more question or require further help.","Not working. Still stuck at 48%. this wasting my time.","Hi M.Irfan I am Vijay, an Independent Advisor. I am here to work with you on this problem. Restart your computer and you should upgrade to 1903 through Media creation tool. Execute the below steps to go to 19031. Windows Key+X > Windows Powershell (Admin) Type following (or copy and paste following) one by one and Enter net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver 2. Type following in Windows Start Search box (Cortana) and hit Enter %systemroot%\\Logs\\CBS > Rename CBS.Log to something else.If it doesn't allow you to rename - Type services in Windows Start Search box > Click Services > Scroll down to find the Windows Modules Installer service and double-click on it > Set its startup type to Manual > Reboot your computerGo to C:\\Windows\\Logs\\CBS > Rename CBS.Log > Reboot your computer > Then go back into the Services App and set Windows Modules Installer Service back to Automatic Startup (Note CBS log files contain information about windows update, SFC etc)(Source - https:\/\/partnersupport.microsoft.com\/en-us\/par_...) 3. A. Take a backup of your computer before you proceed. B. Disable any third party Antivirus (After update is successful, you can enable it again)C. You can go to https:\/\/www.microsoft.com\/en-us\/software-downlo... You can download the latest Windows 10 package from this link (media creation tool) and follow the instructions there to upgrade. Use the very simple instructions given under Using this tool to upgrade this PC to Windows 10Do let me know if you have any more question or require further help. Hi Vijay, can you please suggest any other solution?The media creator tool results the same. I have tried on 3 laptops all of them from different bands and specifications.Almost wasted 3 days in try to upgrade but on every machine it stops at 48%RegardsDJ MHA","Hi M.Irfan I am Vijay, an Independent Advisor. I am here to work with you on this problem. Restart your computer and you should upgrade to 1903 through Media creation tool. Execute the below steps to go to 19031. Windows Key+X > Windows Powershell (Admin) Type following (or copy and paste following) one by one and Enter net stop wuauserv net stop cryptSvc net stop bits net stop msiserver Ren C:\\Windows\\SoftwareDistribution SoftwareDistribution.old Ren C:\\Windows\\System32\\catroot2 Catroot2.old net start wuauserv net start cryptSvc net start bits net start msiserver 2. Type following in Windows Start Search box (Cortana) and hit Enter %systemroot%\\Logs\\CBS > Rename CBS.Log to something else.If it doesn't allow you to rename - Type services in Windows Start Search box > Click Services > Scroll down to find the Windows Modules Installer service and double-click on it > Set its startup type to Manual > Reboot your computerGo to C:\\Windows\\Logs\\CBS > Rename CBS.Log > Reboot your computer > Then go back into the Services App and set Windows Modules Installer Service back to Automatic Startup (Note CBS log files contain information about windows update, SFC etc)(Source - https:\/\/partnersupport.microsoft.com\/en-us\/par_...) 3. A. Take a backup of your computer before you proceed. B. Disable any third party Antivirus (After update is successful, you can enable it again)C. You can go to https:\/\/www.microsoft.com\/en-us\/software-downlo... You can download the latest Windows 10 package from this link (media creation tool) and follow the instructions there to upgrade. Use the very simple instructions given under Using this tool to upgrade this PC to Windows 10Do let me know if you have any more question or require further help. Hi Vijay, can you please suggest any other solution?The media creator tool results the same. I have tried on 3 laptops all of them from different bands and specifications.Almost wasted 3 days in try to upgrade but on every machine it stops at 48%RegardsDJ MHAThe same case... always stops 48%.","Yesterday was the 6th time that I tried to update windows 10 1809 to 1903. I did all the above-mentioned points accurately. But is stacked again on 48% from evening to early in the morning. I request the Microsoft Company to quickly solve this problem .................. No one can solve this problem in the world????","I think it is a problem for people who live in Iran............. is there anybody outside of Iran with this problem?","I live in Taiwan and have the same problem as you. Always stuck in 48%.","I'm from Switzerland and have the same issue. I tried it 5 times. Troubleshooter is also not helping (worked for former updates). Pelease provide us with a solution asap. Thank you!","Clean install 1903 may update is the best way as everything is enabled by default, In any other way using update assistant, media creation tool or via Windows update all creates installation problems even if you have a supported device.Clean install Windows never creates any problems with any version of Windows.","I have the same problem (in the UK), also with a Samsung laptop with an AMD GPU.I have had similar problems in the past, for which I have had to resort to taking out the hard disk \/ SSD, putting it in another computer, completing the update and putting it back in the original.I'd rather not have to bother with that again, so if there were a software solution, such as upgrading in \"safe mode\" somehow, I'd prefer to be able to do that.I'm fairly certain that the culprit is the AMD Radeon mobile graphics drivers."]},{"symptom":"Your Phone for Windows        I have downloaded the Microsoft Your Phone app and can not connect my phone. During set up where I link and verify my phone the app crashed and when I open it back up I don't get any options to do anything. I am not allowed to uninstall it in settings and resting or repairing the app doesn't do anything. I am trying to get back to the screen where I finish setting up my phone. I have attached a picture of what the app looks like when it opens.I am trying to connect an iPhone 8 on iOS 13.3.","solutions":["Hi wrhenry I'll try to help you out. Have you already tried to uninstall the \"my phone\" app ? I think it's a good start. Also, you'll find more information about the \"my phone\" app here : https:\/\/support.microsoft.com\/en-us\/help\/453129...I'll wait for your news Regards"]},{"symptom":"Problems with upgrade to 10        Split from this thread.I need some help. I have a dell inspiron one 2320.   Win 7 with a dr886 graphics. I was able to down load the free w10 but when it finished all I got was a flashing screen of red blue green and yellow.  when I  try to update the intel graphics adapter  wddm 1.1 I continue to get the rainbow flashing screens.  If I upgrade my 3d graphics card will I be able to install the windows 10?  Is that the problem?","solutions":["You start your own thread here.These are not chat rooms.I will split if off.But I can tell you this:Dell supports and supplies Drivers for XP, Windows 8 and Windows 7 only on that Model Number:https:\/\/www.dell.com\/support\/home\/au\/en\/aubsd1\/product-support\/product\/inspiron-one-2320\/drivers@@@@@@@@@@@@@@@@@@@@@@You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Dell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10"]},{"symptom":"upgrade from windows 7 to 10        I have a genuine windows 7 , can I upgrade to 10 free?","solutions":["I have a genuine windows 7 , can I upgrade to 10 free? You may or may not still get 10 for free, but you first have to see if 10 is compatible with your device.The free upgrade to Windows 10 offer from Microsoft expired on the 29th July, 2016.You will have to contact MS support and they may be able to assist you with a free upgrade to 10..Also read this information:All the Ways You Can Still Upgrade to Windows 10 for FreeHere's how you can still get a free Windows 10 upgrade | ZDNet@@@@@@@@@@@@@@@@@@@@@@Upgrade to Windows 10: FAQ - Windows Help - Microsoft Support@@@@@@@@@@@@@@@@@@@@@@Windows 10 supported upgrade paths:✔ = Full upgrade is supported including personal data, settings, and applications.D = Edition downgrade; personal data is maintained, applications and settings are removed.https:\/\/docs.microsoft.com\/en-us\/windows\/deployment\/upgrade\/windows-10-upgrade-paths@@@@@@@@@@@@@@@@@@@@@@First thing to do is to make sure that you have the correct system requirements and that your Computer Manufacturer supplies the correct Drivers for 10 for your Model Number.\"Windows 10 System Requirements\"https:\/\/www.thurrott.com\/windows\/windows-10\/3884\/windows-10-system-requirementshttps:\/\/www.microsoft.com\/en-US\/windows\/windows-10-specifications#sysreqsIf you read those Microsoft's system requirements for 10, you will find that if you only go on them you will be sadly disappointed in performance.You should at least double what they say.@@@@@@@@@@@@@@@@@@@@@@Detailed information on Minimum hardware requirements:https:\/\/docs.microsoft.com\/en-us\/windows-hardware\/design\/minimum\/minimum-hardware-requirements-overview@@@@@@@@@@@@@@@@@@@@@@Some Manufacturers have listed Model Numberss tested with 10 at their website:ASUS - Windows 10 - Which model supports upgrade to Windows 10?Acer - Windows 10 Creators UpdateDell computers tested for Windows 10 November 2019 Update and previous versions of Windows 10 The following Gateway laptops, desktops and tablets have been tested as being suitable to install Windows 10 Creators UpdateHP Products Tested with Windows 10Lenovo devices tested for Windows 10 version 1809 (October 2018Samsung - Find out if your system runs Windows 10.Sony - What do I need to install Windows 10 on my PC?Toshiba - Models tested@@@@@@@@@@@@@@@@@@@@@@If you do have to buy Windows 10:How to buy Windows 10:http:\/\/www.microsoftstore.com\/store\/msusa\/en_US\/cat\/Windows\/categoryID.70036700"]},{"symptom":"Output audio to multiple devices in Windows 10        Earlier with the help of stereo mix option it was possible to output the audio to different devices. However the stereo mix option is removed now.Is there any other way to send audio output to 2 different devices in windows 10?Or possibly get stereo mix option again","solutions":["Hi,Try the below steps and check if they helps.Press Start, type Sound into the search space and select same from the list.Select Speakers as the default playback device.Go to the \"Recording\" tab, right-click and enable \"Show Disabled Devices\" A recording device called \"Wave Out Mix\", \"Mono Mix\" or \"Stereo Mix\" should appear.Right click on the new device and click \"Enable\" Right click on the new device and click \"Set as Default Device\"Double click on the new device to open the Properties window Go to the \"Listen\" tab Click on the \"Listen to this device\" checkbox Select your HDMI device from the \"Playback through this device\" list Now check if you're able to use the both device at same time.Let us know the status of the of issue in this regards. Your reply is important to assist you further.Regards,Guru Kiran"]},{"symptom":"Username and Password required when mapping share drivers from another subnet mask        For some explicable reason, windows has decided to no longer accept access to it's shared folder from other subnets, and no one appears to know why. I have asked high and low and no one has the foggiest idea what's going on.Similar issue here, unresolved: social.technet.microsoft.com\/Forums\/how-can-i-fix-file-shares-across-subnets-in-windows-10-creator-updateAnd here, also unresolved: social.technet.microsoft.com\/Forums\/map-network-drive-across-subnet1. Short version: If i map \"\\\\x.x.x.x\\files\" from the same subnet, explorer will map it, no questions asked and everything works. If i do the same from another subnet i am asked to provide user\/pass, which i can't because there isn't any. This only happens when mapping from another subnet and never happens when mapping from same subnet.2. Setup. Windows 10 pro 1909.1909 or possible earlier version broke network sharing and required clients to edit gpedit and activate \"allow insecure guest logon\". Mentioned here:https:\/\/tech.nicolonsky.ch\/windows-10-1709-cannot-access-smb2-share-guest-access\/Folder is shared, permissions are \"everyone\" and have been given \"full control\".settings\/network\/network and sharing center\/edit advanced sharing settingsPrivate profile: All machines are using this profile.Network registration = onactivate automatic config for devices with network access = onFile and printer sharing = onAll networksUse 128-bit encryption = onpassword protected file sharing = offFirewall, this i am unsure what effects have as it was a suggestion made from another thread i found.The default settings for these, properties\/scope\/external IP are all set to \"local subnet\" by default.smb-innb-datagram-innb-name-innb-session-inFor all of them i have added 10.x.x.x\/24 to the list, this has made no difference. Local IP is set to \"all ip's\". I am unsure about what defines local and external. To me local is lan ip's and external are wan or possibly external subnet ip's. This is apparently not the case as \"local subnet\" is default under external ip.Logbook\/logfile for programs and services\/microsoft\/windows\/smbserver\/security creates two entries when trying to connect from other subnetEvent ID 551Permission error in smb-sessionUsername: NT AUTHORITY\\ANONYMOUS LOGONStatus: access deniedEvent ID 1009server denied anonymous access to clientI can ping the host machine, which is clear evidences that both host and client machines are seeing and responding to each other, but for some reason the client machine is being asked for user\/pass when mapping share, this even tho every setting on the host machine that should allow the connection without asking for user\/pass is set that way.Also, the secondary subnet is also the subnet vpn users connect to, which happens over udp. Since smb-in is tcp, i also tried reconfiguring the vpn for tcp connections, and bridging the two so vpn users would get an ip from the same 192 subnet the network share is located on, none of that worked. Still being asked for user\/pass.Any ideas?***Modified title from: W10p asks for user\/pass only when mapping share from other subnet.***","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand your query regarding mapping shared drives using other subnet mask. Let me point you in the right direction, where you will find appropriate support for this issue. I would suggest you to post your query inTechNet forums, where we have support professionals with expertise on mapping shared drives to assist you with the proper insights. However, since you are group policy to make changes, you may want to have a look at the article onNetwork access: Let Everyone permissions apply to anonymous users. I hope your query gets resolved at the earliest.  Regards,Nikhar KhareMicrosoft Community - Moderator","I did not know about that setting, and when i saw it i was hoping that flipping that switch was all there was to it. But it didn't work, still being asked for user\/pass. So that's a bummer.It makes no sense why doing something so simple is so hard."]},{"symptom":"Computer blue screen\/ crash        I'm having a problem with my laptop I just bought about 2 weeks ago that I find very strange. Originally for the first week it worked great and everything ran perfectly as it should. Then I downloaded the origin installer and downloaded Apex legends to play with a few friends. But every time I would play the game it would crash about half way through or after the first few minutes (about 5-8). Originally it only effected Apex, but then the next day I went to play Call of Duty Modern Warfare and then that started crashing, but again all of my other games worked fine, those include Dead by Daylight, Warframe, Terraria and a few others. So I tried deleting and reinstalling both games and that didn't work after trying it twice, then I went as far as even doing a full fresh install of windows 10. Now it has progressed and Warframe no longer works and every time I try to play any of those games listed that previously crashed for more then about 10- 20 minutes the computer fully crashes and has to reboot showing a system error Unexpected Store Exception. I'm currently running Windows 10 with the 1909 update and have a laptop with 32 gb of RAM a 2080 Max-Q and a i7-9750H so hardware not being able to handle the games or system is not the problem.Any help is appreciated, Thanks!!","solutions":["Hi SK. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Keep in mind you have a one year support, repair and replacement warranty that comes with the PC so if problems persist you can call on them to fix or replace it, making sure it gets done soon enough so you can ensure the repairs or replacement work in time for the warranty expiration, or extend it. You might also still be under Store return policy.If any steps cannot be performed normally then try them in 1) Safe Mode with Networking (so you have internet) or 2) Safe Mode accessed by one of the illustrated steps in this guide:https:\/\/www.digitalcitizen.life\/4-ways-boot-saf.... You will need to use your password to get into Safe Mode as a PIN is not accepted.1) Update your drivers and BIOS\/UEFI firmware from PC or motherboard maker's Support Downloads web page, using the full model number, Serial Number or Dell Service Tag on sticker. Compare the latest drivers available for download with the ones presently installed in Device Manager reached by right clicking the Start Menu. Make sure you have the latest BIOS or UEFI firmware, Chipset, Display (Video), Sound, USB3, Bluetooth, Network and all other drivers, or else download and install the latest now.Updating drivers from the Device Manager or Windows Update is rarely enough. The most basic thing we need to learn to maintain a PC is keep the latest manufacturer's drivers installed from their Support Downloads web page.2) Go over this checklist to make sure the install is set up correctly, optimized for best performance, and any needed repairs get done:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... Start with Step 4 to turn off Startup freeloaders which can conflict and cause issues, then Step 7 to check for infection the most thorough way, then step 10 to check for damaged System Files, and also Step 16 to test a new Local Admin account. Then continue with the other steps to go over your install most thoroughly. 3) Compare the install you did with this gold standard Clean Install of Windows which will stay that way as long as you stick with the tools and methods given, has zero reported problems, and is better than any amount of money could buy:http:\/\/answers.microsoft.com\/en-us\/windows\/wiki... The reason I ask you to do this is because no one of millions who have followed the install in that link has ever come back to report problems that I have seen. It is also a great learning experience that will make you permanently the master of your PC because you will learn what works best and have applied it with your own hands. 4) Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... 5) Test the hard drive or SSD with diagnostics: https:\/\/www.lifewire.com\/free-hard-drive-testin...https:\/\/mashtips.com\/ssd-health-test-and-perfor...HP and Dell have hardware diagnostics triggered by tapping the ESC or F12 keys respectively as you power on.Best is to use the HDD\/SSD manufacturer's own if there is one, otherwise use Seatools bootable long test:http:\/\/blog.nowherelan.com\/2013\/04\/04\/boot-seat... Follow this up with a full Disk Check from the Command Prompt in Repair Mode or from bootable media:https:\/\/www.groovypost.com\/howto\/check-hard-dri... if necessary from the Command Prompt at boot:https:\/\/www.tenforums.com\/tutorials\/2294-advanc... 6) You can run a bootable Linux diagnostics distro with the hard drive unplugged to stress and help narrow the faulting hardware, and rule out Windows or the hard drive\/SSD:https:\/\/www.pcsuggest.com\/best-linux-live-distro\/I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"I cant switch out of S mode        I was already switched out of it because I had to when I first got the laptop but then it switched me back to it and it wont let me switch out everytime I try a message appears \" try again later something happened on our end\" and ive been trying for hours and its yet to switch","solutions":["Hi Kribb, I am Sumit, an Independent Advisor and a 2-Year Windows Insider MVP here to help.Seeing the results from the last week, it looks like it is indeed a backend issue for some users. I recommend waiting for a day or two in which the issue will be hopefully resolved.https:\/\/www.google.com\/search?q=site:answers.mi...Disclaimer: This is a non-Microsoft website which would provide accurate and safe information. Watch out for ads on the site which are frequently classified as a PUP (Potentially Unwanted Products). There is no need to buy paid products to fix your computers as they do more harm than good sometimes."]}]}