{"windows":[{"symptom":"Windows Mixed Reality flickering in 60 hertz mode.        I fly a lot of flight simulators and I like to run those at 60 Hertz due to my rig not being able to achieve 90 fps in those games.  The problem I have is that white and other bright colors flicker.  Its quite annoying and doesn't occur in 90 hertz mode.  The flickering occurs in all applications including the cliff house. Any way to fix this?Hardware:Ryzen 5 2600 oc to 3.9Vega 6416 gb of ddr 4 duel channel ramAsus B450 primeLenovo explorer","solutions":[]},{"symptom":"projection to TV disconnects after few seconds        I could not even connect to the tv before the clean installation of windows but after I installed another copy of windows and tried to connect it, it just disconnected after a few seconds. Plus, the cursor responded after a few seconds of delay which is the only thing I could check considering the short time of the amount of time of connectivity available after disconnection.I tried updating the miracast and the tv's drivers but it did not change anything.Mine and others mobile phones connect to the same TV without any issue.","solutions":["Hello Muhammad, I am Andrew in independent advisor. Are you using an adapter on your TV for miracast, or is it built in to the TV?","It is an external device (anycast). plus, Mine and other mobile phones connect to the same TV without any issue.","Thank you, a common issue with Anycast is the resolution being displayed. A fix is to open the screen size setting on your computer and lower the resolution. Search SCREEN RESOLUTION and click Display Settings. It's possible you're using too high a resolution your network or receiver cannot handle.","help lenovo laptop winr 10 got a hdmi port it wont put screen on my tv plese help why would u take this feature away for stream cast devices like crome cast i have tht too how do i mirror screen cASt then i can only do vid services to cast disney plus youtube ect how do i get my steam game americas army proving grounds on my tv screen please help"]},{"symptom":"Blluetooth audio does not work        I cannot get my Plantonics Bluetooth heaphone to work on my Windows 10 computer.I see the device showing paired but no option arises to allow useage.  I cannot select it as a speaker device (it doesn't appear as a choice)Have uninstalled and reinstalled and connected device to my computer without success.Help?","solutions":["Hi, CA_Denny My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to run the troubleshooter for Bluetooth. Go to Settings - Updates & Security - Troubleshoot. Click on Bluetooth under Find and fix other problems. Follow the on-screen instructions.https:\/\/support.microsoft.com\/en-ca\/help\/402622...https:\/\/support.microsoft.com\/en-ca\/help\/15290\/...Try to update the Bluetooth drivers https:\/\/support.microsoft.com\/en-us\/help\/402844...","Neither worked.The pc just won't recognize the paired Bluetooth device as a sound device.","What version of Windows do you have, you should have the latest version 1909","Windows 10 Ver. 1809","You should upgrade to version 1909, that may be the problem https:\/\/support.microsoft.com\/en-us\/help\/402766..."]},{"symptom":"Microsoft family, screen locked but not sound        Hi,When the screen is locked for bedtime (windows10, microsoft family, screentime) programs are still running and the sound is on, just the screen is locked. Is it possible to lock also the sound?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Unfortunately this isn’t a feature at the moment but I would suggest relaying this via the feedback hub:https:\/\/support.microsoft.com\/en-gb\/help\/402156...Regards, Ross"]},{"symptom":"How do I reset the keyboard on my Surface Pro?        I am running Windows 10 on a Microsoft Surface Pro.  It came with a detachable keyboard that I use explicitly.Just recently the functions of my keyboard changed and I don't know how.  For example, pressing a key and holding it down used to repeat the key.  Now is only types the letter\/symbol once and stops.  Another example:  I used to be able to press the 'home' key to take me to the start of a line or the 'end' key to take me to the end of the line.  Now it does nothing.How do I reset the keyboard functions to their original state from the manufacturer?","solutions":["Hi! 1EPIBAF I'm Marvin an Independent Advisor, and I will help you with your issue. If you want your default settings for your keyboard, Follow these steps. 1. Go to the Windows start menu 2. Type in device manager, If your keyboard won't let you type correctly, scroll down to the Windows System folder and click it, click Control Panel, click the \"View by\" option and then select Large Icons if you're in Category view, and find Device Manager.3. Click on Device Manager at the top. 4. Expand the keyboards section 5. Select the keyboard that you want to reset. 6. Click the \"Uninstall\" icon. 7. Click OK 8. Click the \"Search for updates\" button 9. Select the keyboard again. 10. Click the \"Update drivers\" button. 11. Click Search automatically for updated driver software. 12. Allow the newest drivers to install 13. Restart your PC If you still having problems with this, I will be around to help you. Regards.","Hi,I am not that computer savvy so please idiot proof your instructions.  When try to type the @ sign (upper case 2) I get the quotes \".  When I try to type the \" sign....I get the @I am sure I did something without realizing it.  How do I correct this on my Surface Pro laptop?thank you!"]},{"symptom":"Windows 10 keeps PERSISTENTLY changing my keyboard to UK layout, and it's not deletable from keyboard settings. Microsoft please fix this!        At random intervals, the keyboard layout will keep PERSISTENTLY changing to UK, prompting me to manually change it back to US.As you can see on the image above, there's an option to change to the UK keyboard, while I never made that choice (I have already changed it back to US on the above picture, just showing that the UK version is there for illustrative purposes).  Manually changing to US fixes it till the next restart.Going back to the original settings page:You can see I have only two languages selected. English (US) and Greek.Lastly, here are my location settings:There is literally NO REASON for it to change back to UK, as it's not even an option that is available to me (since I never selected it in the first place).Microsoft, please fix this! It's really irritating to keep having to change back to US when \" appears as @ multiple times in the day.I have tried sending an email to microsoft support but there is no possible way for me to do so, as it keeps referring me to an automated agent.If any microsoft staff sees this, please forward this to your bug supervisor, as it happens on both of my computers at random intervals, both windows 10 64bit, home edition. All latest updates fully installed.","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please refer to the following page and delete the UK layout using the registry fix.https:\/\/answers.microsoft.com\/en-us\/windows\/for...Go to above page and scroll down to the steps written by \"DikkeryDok\"","Hello Ahmed, thanks for trying to help. I tried to do what DikkeryDok said, but found a new issue.These are the available layouts on my registry:I used this page to try and figure out the first two, but the third stumped me.I tried deleting it, restarting the computer and it's still there.So is the UK keyboard on the taskbar. ","You became a member 16 minutes ago, and your weird numbers make this look a bit scammy, LOL!Man you have some nerve trying to do this on official forums :)","You have to keep at least one keyboard layout.Please add the keyboard layout you want at first.Then, go to that registry key and delete the UK layout and other layouts apart from the one you want."]},{"symptom":"file share        is it possible to share files from windows 7 desktop to windows 10 laptop? I also would like to use the files for backup?","solutions":["Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Yes it’s certainly possible, I linked to an article which give a walkthrough of how to set this up:https:\/\/www.pugetsystems.com\/labs\/support-softw...Regards, Ross Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it."]},{"symptom":"How to block an IPv6 address in windows firewall        I have noticed some suspicious activity on my computer. My Gmail password might even have been changed (I’ve not change the back), so I am very concerned.The activity seems to be coming from an iPv6 address (2600:1010:b02b:a303:9831:Unfortunately, I am not at all familiar with IPv6. From the little I’ve learned, I think the beginning part of the address identifies the network\/router and the end of the address identifies the specific computer.  Apparently, that can hide the actual unique address ( MAC) of the computer for privacy reasons.So, if I’m right about that (and I have no idea if I am), I assume I need to block a range of addresses.I don’t know how to block any IPv6 address, or a range of IPv6 addresses.Can anyone help me?I am using a Microsoft surface pro 4 (which may not matter) running Windows 10 Pro","solutions":["Hello, my name is Arif Ahmed, Windows Advisor. I would be happy to help you. Please perform the following steps to Disable IPv6. Open Run Type ncpa.cpl Double tap on the Active Network. A new tab will open. Click Properties Uncheck IPv6 Apply > OK","My Gmail password might even have been changed ...I don't understand. How could you not know if your password was changed? After all, it'syour password that you chose. Moreover, Google confirms all changed passwords by sending you an email, to make sure that it's you who changed your password. Did you get a changed password email from Google?The activity seems to be coming from an iPv6 address (2600:1010:b02b:a303:9831:My friend, you must never take drastic action on a hunch. Trust me, I tried that. Did not work out well. You need to be certain that this unspecified suspicious activity came from that IP address before you block it. That could turn out to be an important address that should not be blocked. Or you could make a mistake while messing around in something with which you are admittedly not familiar (been there - done that) and cause harm to your computer. Particularly since an IPv6 address haseight groups of hexadecimal numbers, and the address you're showing us only has five.","I don’t blame you for implying that I’m an idiot because I didn’t give you enough detail.I’ll explain why I’m not sure my password was changed. I always leave myself logged into Gmail on all my devices, so I don’t need to login every time I use Gmail. However, for reasons that I won’t bother to go into now, I wanted to temporarily turn off two step verification. For that, I DID need to enter my password. However, when I tried to, it said it was incorrect password. I know it was the correct one, because I have my correct password written down (in code) and I had Gmail display the password I was typing in. This happened twice. Obviously, this is extremely suspicious. The weird thing is though that I never got a password change notification from Gmail. So, how did my password change without my being notified? The only explanations I could figure out were:Some glitch by Google., The probability of this happening twice seems extremely remote. However, I am having other funky things going on with Google: trying to reenter changed PW on my iOS devices, i keep getting message “something went wrong”.Whatever Computer\/automated process had broken into my Gmail intercepted the change notification and permanently deleted it.Frankly, neither of those seems super likely to me, but what do I know?When I checked the Devices that had accessed my Gmail, I saw the one that I said I’m trying to block. Since this IP address has actually gone into my Gmail, unless it’s one of my devices, I should think I’m OK to completely block it.I checked all my other devices, and the suspicious IP address doesn’t look like any of the IP addresses on those devices. However, because I’m very unfamiliar with IPv6 I wanted to double check that the beginning part of the IPv6 address identifies the network. If that’s so, then this address I want to block is definitely NOT one of my devices.","Forgive me, but if you're having a problem with GMail, why not contact Google? I don't think you're an idiot; I just think you're going about this in the wrong way.To block a single IP address or a range of IP addresses, enter your router's administration utility. Each brand of router has a different setup for its administration utility, but you will eventually find the screen where you can block connections from specified IP addresses.","You’re absolutely right that I should contact Google, and that is the first thing that I did.I haven’t heard back from them, and I doubt that I will. Based on a previous bad experience I had with Gmail, I discovered that Google does not give a damn about its users, and is perfectly willing to let them hang out to dry when they have a serious problem.I will try to figure out on my router how to block an IP address. However, I will be traveling, so the only way I can keep my PC secure then is by blocking the IP address in windows firewall.I’m not sure what to put in as the address to Block. For IP4, it’s no problem, I know what to do. But I don’t know what to do for IPv6. As I said, from my very limited understanding of iPv6, there are parts of the address that are variable, even when using the same device, and there are parts of the address that are fixed, indicating the specific access point. That’s why I need to know exactly how to enter the IPv6 address so that the firewall will block any attempted access from that device.","Sorry if I wasn’t clear, but I do not want to disable IPv6, which is what this will do.I simply want the block a suspicious IP address from accessing my computer. I know how to block an IPV4 address, but I don’t know how to block IPv6 address, because I do not fully understand the protocol. E.G. what parts of the full 8 group hexadecimal address needs to be specified to identify the device and how to specify a range of IPv6 addresses. I want to know how to enter the iPv6 address in windows firewall to block it.","Got it. We can do this by creating a Firewall rule. Please perform the following: Open Windows Firewall Click On Advanced Settings (Left) Click on Inbound Rule (Left) Click on \"New Rule\" (Right) Select Custom Select Protocols and Ports Click on the drop down button under Protocol Type Select IPv6 > Next Select \"These IP addresses\" Click on Add Enter the IPv6 address Apply > OK","Thanks for your reply, but I already knew how to use windows firewall to block an IP address, but only for IPv4. I apologize that I apparently have not been clear enough.My question is what do I need to enter as the IPv6 address to block. Let me be specific. This is the address that appears to have accessed my Gmailaccount and that I want to block: 2600:1010:b02b:a303:9831:2c02:b20b:ce45I have added that exact address to the addresses to be blocked. However, my limited understanding of IPv6 – which could easily be wrong – is that the same computer could try to access my account with a slightly different IPv6 address. For example, I have noticed that some of the IPv6 addresses for my iPhone vary from day today.That’s why I want to know if I need to enter a range of IPv6 addresses to block, and if so exactly how I need to enter the range.","Harold, you need to add the exact IPv6 address to be blocked. Just like public IPv4 address IPv6 is also unique."]},{"symptom":"Windows desktop freezes when put to sleep        Windows 10 Pro Version 1909 Build 18363.535Occurs on both Gigabyte Aorus Z390 Ultra and Master motherboards both with latest BIOS and boot with optimized defaultsIntel i9-9900K CPUGSkill 16GB memory: F4-3600C16D-16GTRS or F4-3400C16D-16GTZOptane 280GB 900P SSDTypical scenario:  Power on system, put in sleep mode successful, wake successful, put into sleep mode (system freezes with black screen-motherboard RGB lights on and all fans running), recover by pressing Reset switch or power off power supply.Gigabyte Support: no solution-motherboard may be defective.  Microsoft Support: Do In-place upgrade Windows 10.My trouble shooting:  (1) In preparation for fresh install I clone the Optane SSD to a WD hard drive.  On verify clone, I discover cloned drive can be put through multiple sleep\/wake cycles successfully.   (2)  I set msconfig of Windows on Optane drive to \"Diagnostic startup\".  On arrival at windows desktop, I discover that I can put system through multiple sleep\/wake cycles successfully.It seems to be Windows 10 problem, but where do I go from here?","solutions":["The Windows Management Instrumentation Service was disabled in the diagnostic startup so the .nfo file was blank.Can you try a \"clean boot\" and see if it makes a difference to the freezing issue:https:\/\/support.microsoft.com\/en-us\/kb\/929135If a clean boot does resolve the issue there is a section in the article \"How to determine what is causing the problem by performing a clean boot\".Reset the computer to start normally afterward. As a general precaution create a System Restore Point prior to initiating a clean boot."]},{"symptom":"Windows 10 Media Creation Tool 1909 sticks at 80% downloading.        I realized that the disk I have is a pretty old version of windows 10. I downloaded the current Media Creation Tool. My steps downloaded tool from https:\/\/www.microsoft.com\/en-us\/software-download\/windows10 opened the download accepted the terms of useSelected \"Create installation media\"Selected , English, Windows 10, 64-bitSelected USB flash driveSelected formatted 16gb flash drive Sticks at \"Progress 80%\" and does not proceed, I have tried 2 times and have waited overnight one of the two attempts. Any guidance would be appreciated. ","solutions":["Hi Ryan. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.Try another PC is easiest. If not then try wiping the flash stick first with Clean Command to remove all boot sector code that might be interfering:https:\/\/www.tenforums.com\/tutorials\/85819-erase...Then do not format the stick, let the tool do it. There are alternative downloads from MS TechBench here: https:\/\/tb.rg-adguard.net\/public.phpBurn to DVD using WIndows Image Burner or create bootable flash using one of the options here:https:\/\/www.tenforums.com\/tutorials\/2376-create... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Cant switch out of S mode         i posted this \"I was already switched out of it because I had to when I first got the laptop but then it switched me back to it and it wont let me switch out everytime I try a message appears \" try again later something happened on our end\" and ive been trying for hours and its yet to switch \" Decemeber 29th and you guys said itll work after a few days and its yet to work and i cant download anything and im pissed","solutions":["Hi kribblekirb, How to Turn Off Windows 10 S Mode If you want to turn S Mode off, follow the guide below: https:\/\/www.hellotech.com\/blog\/what-is-windows-...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it. Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,","when ever I press get it just says \" Try again Later something happened on our end\""]},{"symptom":"How do you open a CD\/DVD drawer on a Dell Inspron 2014        How do you open a CD\/DVD drawer on dell inspron 2014?","solutions":["Hi Martha,Do you have Windows 10?  Other versions of Windows will be a little different, but you can probably get it to work.Click Start.Open (or search for) File Explorer.Click Navigation pane, and click \"Show all folders\" (if not already selected)Right click DVD Drive or CD Drive (depending on what's installed)In the popup, click \"Eject\"Most music playing apps can be set to open the CD tray automatically when you start the app.Enjoy!IImaginethat","One way would be to right-click the drive in File Explorer and choose Eject. Another way would be to press the button on the front of the drive's door. I've never seen an optical drive without an open button.","If those do not work look for a small hole in the drive next to the open button and use an opened paperclip and push in the hole."]},{"symptom":"Lost all files after latest Windows 10 Update (Last August 2019) !        Hello there !I'm hoping someone can help me with this very particular problem.So last August (2019), I updated my PC to the latest version of Windows 10, but then was met with a strange occurance.I loaded up my desktop and it was empty, yet my background was still there. I realized shortly after that my files were kept under User>\"MyName\". So logically I just moved everything back into a NEW order. I then left my computer for a few days, and then I was shocked to find this when I returned:-My OLD desktop order of files was back !-My background was just black ?!-And every single file (decades of photos, important files, game saves, etc.) that I had moved previously back into their respective places (after I thought the update actually happened) were GONE !!!I have tried contacting Support but they were of no help. Either they didn't understand my problem, or they told me nothing could be done..I have since tried countless methods (checking bin, etc.). Most notably going into my \"Local Disk (C:)\" to try and find the old files, but I was met with 4 TEMP files (labeled: TEMP MyPC 000.000.001, and so on) that contained a bunch of stuff (which I have no idea what they are or what they are for) but not my files. Also tried restoring older versions of my current files,but no older file versions are possible.And even PC altogether but the system doesn't seem to think that I owned a previous version of Windows on this PC aside from 7 (not even 8 ?). Only the version since after this incident seems to be available. I also found a \"Window.old(1)\" file but it dated of 2017...so of no help.So I have attempted numerous times to restore\/recover my old files to no avail. And now I find myself in a dire situation where I am in need of an old important file for something that was relevant to my work earlier this year that now has come back into actuality (family member medical report).If somebody, anybody, has an idea, suggestion or advise as to what I can do please reply to this message as soon as possible ! Thank you ahead of time for your response and have a nice day !!","solutions":["What OS build are you on?  Hit the Windows key, type winver, hit Enter.Or Windows key+r, winver, OK","It sounds like you may be getting logged in with a temporary profile. See if this article helps:https:\/\/social.technet.microsoft.com\/Forums\/win...","It sounds like you may be getting logged in with a temporary profile. See if this article helps:https:\/\/social.technet.microsoft.com\/Forums\/win... Thank you for the suggestion. It seems though that I am very much on my profile and not a temp one. It’s clear now that when i moved my files back onto my desktop and folders etc., i was actually on a temp file, though i cannot find whatever i moved into it. Thank you for answering !","Hi Tagster, Based on your concern, there's a lot of people experiencing this kind of issue as well.What I can suggest is to rollback the updates: https:\/\/lifehacker.com\/how-to-undo-and-prevent-...And disable your windows update for the mean time, please follow this link for detailed guide:https:\/\/www.cleverfiles.com\/howto\/disable-updat...Disclaimer: This is a non-Microsoft website. The page appears to be providing accurate, safe information that might solve your current issue.Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products).Thoroughly research any product advertised on the site before you decide to download and install it.Let us know if this helped you out. Your feedback is much appreciated. Thanks and regards,"]},{"symptom":"Microsoft Account Problem - Shared Experiences Error        Roughly every time I boot up my machine, I get a windows pop-up that there is a Microsoft Account Problem and that \"we need to fix your account (most likely your password changed). Select here to fix it in Shared experiences settings.\"When I click to fix the issue, it usually asks me for my password and then says my accounts are fine. The next time that I reboot though, the same pop-up occurs.Reading the forums, I haven't found anything that permanently fixes this issue. I've tried:1. The Microsoft Support and Recovery Assistance program seems to delay this pop-up for a few reboots before it starts occurring again2. I have turned off \"Nearby sharing\" and \"Share across devices\" in the Shared Experiences settings3. I only have one account listed in my shared experiences accounts.. nothing out of the ordinaryAppreciate any help that can be given here.","solutions":["Hi, Thank you for writing to Microsoft Community Forums. I understand that you receive the popup regarding Microsoft Account when you login to the PC. One of the things that I suggest you is to run the Microsoft Account troubleshooter and see if that helps. Once you download the file please run it and select the ­check box Apply repairs automatically and follow the on-screen instructions. Let us know how it goes. Regards,Prakhar KhareMicrosoft Community – Moderator","Hi Prakhar,Thanks for the suggestion! I've tried running that Microsoft Account Troubleshooter and get an error mid-way through that it \"can't connect to the sync service. There might be an internet connection problem of the service may not be available\".I've got no problem with my connectivity though and I'm not using any VPN or weird networking settings.In the troubleshooting report it finds the connectivity issue as well as \"Rootcauses found and created logs\".Any ideas on what to do next? I've tried resetting all my network settings, and doing an IPConfig release. Not sure why it thinks there is some connection issue."]},{"symptom":"Microsoft Store\/apps will not open.        Made the mistake of switching to Windows and have had nothing but problems. Recently purchased a Surface Pro 6 before I go abroad for a year in hopes that this would be good for traveling...current issue is as follows..Microsoft Store will not open and neither will any of the pre-loaded apps from Microsoft. They appear to open and then close immediately. Also, updates will not download and the newest windows 10 update continues to freeze. I have tried a couple fixes I found on the forums but still nothing so this is my last attempt. Any help is appreciated.- Austin","solutions":["Hi, AustinBlalock My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Follow these steps to repair the Microsoft Store and Apps: 1) launch powershell 2) Set-ExecutionPolicy Unrestricted You have to select (Yes to All) 3) Get-AppXPackage -AllUsers | Foreach {Add-AppxPackage -DisableDevelopmentMode -Register \"$($_.InstallLocation)\\AppXManifest.xml\"}Restart your system Check the link to better understand how to execute the commands: https:\/\/www.digitalcitizen.life\/how-reinstall-a...You can also download this application to try to repair the Microsoft Store. http:\/\/aka.ms\/diag_apps10You can also reset the Microsoft Store https:\/\/www.tenforums.com\/tutorials\/15057-clear...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","Hey Jeffrey,I have tried all of the above and nothing worked.No Microsoft store, pictures, maps, camera, etc.","I recommend that you repair Windows completely before you must make a backup of your personal files, third-party software will be removed. Here the link to download the Windows ISO.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...https:\/\/www.tenforums.com\/tutorials\/16397-repai...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","I reset Windows (again) but it still did not help. All the apps that were giving me issues before now have small white exclamation points on them and will not open. Anything else I can try?","Follow these steps: Press the Start key and type the word CMD or Powershell, right click on the command prompt and select Run as administrator, enter the following commands one by one followed by the Enter key:•- DISM.exe \/Online \/Cleanup-image \/Scanhealth •- DISM.exe \/Online \/Cleanu p-image \/Restorehealth •- DISM.exe \/online \/cleanup-image \/startcomponentcleanup •- sfc \/scannow https:\/\/support.microsoft.com\/en-us\/help\/929833...","Hey Jeffrey,Everything checked out when I went through the above steps and still nothing has been fixed..I am going to start from the beginning and try everything again. Just wanted to say thanks for your help with this, I will keep you posted.- Austin","Glad to Help!","Finally solved it..went through the motions again and ended up wiping\/restoring the computer. Much appreciated.","I'm glad you could solve the problem"]},{"symptom":"Updated to 2010 now I can't open word on my desk top        I just did the update as I had to in order to use quickbooks.  I can't open word (2013) on my desktop to access my old files. Please help- I'm not a computer person.  ","solutions":["Hi, I'm David an independent advisor and user just like you. I'll do my best to help you with this.You might have been left with an old Word icon on your desktop - which is why it won't open.If you've installed a new version of Word that will usually remove any previous version. You need to open the newest version of Word which will also then be able to open all your previous files.To find Word click on START and type \"word\" on top of the Start menu - that will cause a search and the menu will find Word - if you click Word there it should open ok.Regards, David"]},{"symptom":"Ram usage at 50+% just from using windows 10        I have 16gb of RAM and on my desktop with noting booted up at all my pc is using 8gb of Ram. By just typing this message im using 10.5 gb of RAM (According to my Performance stats using Win+g). Its really annoying because when i play games it goes up to 12 gigs used and i dont understand how running windows can use 50-57% of 16 gigs of RAM.","solutions":["Hi CoC. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.You want the RAM to be used, it only becomes a problem if it ever pegs out with that amount of RAM.Type Resource Center in Search, open it, click on Memory tab to see how much RAM is apportioned to hardware.See possible fixes for high RAM usage here: https:\/\/fossbytes.com\/how-to-fix-high-ram-and-c...https:\/\/superuser.com\/questions\/949244\/windows-...https:\/\/www.partitionwizard.com\/partitionmagic\/...Test the RAM overnight to stress it with the best bootable test memtest86, following this guide to test both sticks and slots:https:\/\/www.wikihow.com\/Test-PC-RAM-with-MemTest86Run Crucial System Scanner to check the RAM is properly spec'd and configured: https:\/\/www.crucial.com\/usa\/en\/systemscanner?cm... I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"how do i switch to classic view for windows 10 and the browser?        I was advised when I bought my computer that with Windows 10 I can go back to the classic view we had in Windows 7 and before. Had a Windows 8 computer and never could use it or figure it out. Looked up instructions how to bring up classic view for the computer and in the new browser, whatever it's called, but they didn't work because the options I was told to click on weren't there. I want a classic start menu, files and folders, and toolbars in my browser. I hate Icons and pictures, I want words, and long listed menus with words. I took computer classes at Ohio State starting in 1983 and have been intimate with computers since. I had the choice to pick Apple or IBM\/Microsoft to start, and I chose the latter because of the complication and because it afforded more information as to how everything worked. It was considered supposedly much harder at the time, but more useful and was supposed to help get into the meat of the operating system. I loved it and found it very easy. Basic programming was a simple task. Everything was super-smooth sailing compared to this new desktop and OS, and even DOS was less complicated. I don't understand why Microsoft is dissing its customers with these Apple-type new systems, but from everyone I've heard, it's difficult and frustrating. I don't know anyone who likes it. The current setup is so simple yet inexplicable, I can't do anything, and it's confusing and extremely aggravating. Any help would be greatly appreciated to get me back to a functional desktop. I'm about to chuck my new Alienware laptop out the window!!","solutions":["Hi,Thank you for posting in Microsoft Community.We understand how you feel about the situation. We're sorry for the trouble.The option of changing the display to Classic view is not available in Windows 10. This is by design. Windows 10 is designed in such a way that you can view the apps with the long list words and you will also have an tiles in the right side of the start menu.We appreciate if you can provide your feedback about this issue in Windows feedback app.Thanks."]},{"symptom":"copy speech recognition files to another computer        copy speech recognition files to another computer , I have spent hourstraining it now have a new computer which files can I coy across so I do not have to train again","solutions":["Hi Tom, My name is Riccardo and I would be happy to assist! I love saying this, there is an app for that! https:\/\/www.microsoft.com\/en-ca\/download\/detail...The Speech Profile Manager tool can be used to back up and restore speech profiles on the same machine or between different machines.I hope this helps, let me know if you need anything else. Your feedback is appreciated.","Thanks Ricardoill give it a goPlease explain why I have to go to a volunteer (risky) site to find this out why is it not listed in the main Apps configuration options. With MS Sprucking their new surface and forcing people to use win 10 People like me who have been using speech recognition for many many years need to be able to transfer these files whenever we get a new PC. ","Downloaded app then nothing installation instructions are vague, many file downloaded but none are obviously the install files Please help further. Have you used this tool ?","Hi TomMy name is Jon and I am an independent technical adviser. Sorry to hear you are experiencing issues and I would really like to help you find a resolution.Once you’ve downloaded the .zip file, open it and extract the executable and run it. You'll see buttons for exporting and importing.To export, just select the profile that you want to export and click, 'Export'. Make sure to put your file in a safe place.To import, click the, 'Import' button and select your backed-up training file.Hope this helps."]},{"symptom":"Package files        Hello, So i play the sims and i was cleaning out my folder when i accidently opened a package file with explorer now all my package file icons are explorer so i was googling a fix and got told to delete Default_LNK_ in regestiery to restore the icons but it never worked now im worried ive done something bad, i tried to do a system restore but it came up with the error 0x81000204 and that it failed the restore, i should of restored before hand but i forgot you could do that, please help :(","solutions":["Hi Scarlett. I'm Greg, an installation specialist, 10 year Windows MVP, and Volunteer Moderator here to help you.First if you have any unintended consequences from the regedit either go back in and reverse it, or see if you can System Restore to a point before you made the change following this guide:https:\/\/www.windowscentral.com\/how-use-system-r... Then go here how to reset a file type to its default association: https:\/\/www.tenforums.com\/tutorials\/8703-restor...I hope this helps. Feel free to ask back any questions and keep me posted. I will keep working with you until it's resolved.________________________________________________________ Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it.","i tried doing a system restore earlier but it said this System Restore did not complete successfully. Your computer's system files and settings were not changed.Details: System Restore failed while scanning the file system on drive C:\\.The drive might be corrupt. You might want to retry system restore after running chkdsk \/R on this disk.An unspecified error occurred during System Restore. (0x81000204)\"also for the file icons i tried that but it did not work, my package files are still internet explorer. I accidently deleted this registery file as i was told to so i could get my icons back but it never worked. ","Every file has a file type. Find out what the missing file type is and find it in the list of the Reset File Default Associations tutorial and run the fix for that file type."]}]}