{"windows":[{"symptom":"Downloading problem settings on my computer        I am not 1000% sure if this is the right place to ask this question. I recently got a new computer and I tried downloading something from a website and it only would allow me to download things that are from the Microsoft store. I looked online for a bit nothing seemed to work for me, can you please help me out?","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,If you are unable to download third party contents from the internet, then you most likely have been issued a Windows 10 in S mode. A windows 10 in S mode is does not have access to installing third party contents from the internet for the sole purpose of security.Under this link contains more information in regards to Windows 10 in S mode https:\/\/support.microsoft.com\/en-ph\/help\/402008...If you wish to switch out of S mode, you have a 1 time option via the Microsoft StoreLet me know how it goes. :)"]},{"symptom":"Blue screen error        I have been facing blue screen error for past 1 month and unable to work on my system.1. STOP CODE: SYSTEM THREAD EXCEPTION NOT HANDLED    what failed: ser2pl64.sys2. STOP CODE: KMODE EXCEPTION NOT HANDLED   what failed: IntelHaxm.sys3. STOP CODE: KERNEL SECURITY CHECK FAILURE4. STOP CODE: DPC WATCHDOG VIOLATION5. STOP CODE: PFN LIST CORRUPT6. STOP CODE:KERNEL SECURITY CHECK FAILURE7. STOP CODE: KERNEL SECURITY CHECK FAILURE8. STOP CODE: IRQL NOT LESS OR EQUAL9. STOP CODE: KERNEL SECURITY CHECK FAILURE10.  STOP CODE: MEMORY MANAGEMENT11.  STOP CODE: KERNEL SECURITY CHECK FAILURE12.  STOP CODE: DRIVER IRQL NOT LESS OR EQUAL      what failed: bthport.sys13. STOP CODE: IRQL NOT LESS OR EQUAL14.  STOP CODE: PAGE FAULT IN NONPAGED AREA15.  STOP CODE: IRQL NOT LESS OR EQUAL16. STOP CODE: KERNEL SECURITY CHECK FAILURE17. STOP CODE: SYSTEM SERVICE EXCEPTION18. STOP CODE: DRIVER IRQL NOT LESS OR EQUAL     what failed: BthA2dp.sys19. STOP CODE: DRIVER OVERRAN STACK BUFFER20. STOP CODE: IRQL NOT LESS OR EQUAL21. STOP CODE: KMODE EXCEPTION NOT HANDLED      what failed: win32kbase.sys22. STOP CODE: KERNEL SECURITY CHECK FAILURE23. STOP CODE: IRQL NOT LESS OR EQUALThese are the stop code that i have taken pic of.Tried most of the things1. Reset the PC 10 times2. Replaced the PC Fan3. Removed the HDD4. Tested by installing other HDD5. Removed the SSDCurrently testing it with removing the ramI have HP PC 15au-620txSpecsOperating System: Windows 10 Home Single Language 64-bit (10.0, Build 18363) (18362.19h1_release.190318-1202)      System Manufacturer: HP             System Model: HP Pavilion Notebook                     BIOS: F.52 (type: UEFI)                Processor: Intel(R) Core(TM) i5-7200U CPU @ 2.50GHz (4 CPUs), ~2.7GHz                   Memory: 8192MB RAM      Available OS Memory: 8078MB RAM                Page File: 5756MB used, 3600MB available              Windows Dir: C:\\WINDOWS          DirectX Version: DirectX 12      DX Setup Parameters: Not found         User DPI Setting: 96 DPI (100 percent)       System DPI Setting: 96 DPI (100 percent)          DWM DPI Scaling: Disabled                 Miracast: Available, with HDCPMicrosoft Graphics Hybrid: Supported DirectX Database Version: 1.1.2           DxDiag Version: 10.00.18362.0387 64bit UnicodeEarlierSpecs:1TB HDD500GB SSD16GB RAMNowSpecs1TB HDD1TB HDD8GB RAMThis is the link for the minidump filehttps:\/\/drive.google.com\/open?id=1b6hsJ8yvDJAnLbZDTSCFNCdT25AZyNiMPlease help me with this issue the laptop is still in warranty.","solutions":["Hi AshishKumar1109 I'll try to help you on this issue. I think the issue may be resolved by using a fresh copy of Windows. you can use this tool in order to reinstall Windows 10 with the latest update : https:\/\/www.microsoft.com\/en-us\/software-downlo...Select \"download tool now\" and follow the instructions. When using the embedded tool in Windows to reset your computer, you use the same image, that may be corrupted.Try this method, it should improve the situation. Regards","Hello Jay#222,I not sure that this could be the issue.As i am a developer this installing and resetting the PC is causing the serious pain as i have to install all the software and copy the data takes a full day and more.Please let me know, what should i do.","I understand that the solution may not be perfect, but as you have -a lot- of error codes, it's the only way to solve everything at once.","OK.I will try it and update about the same.","Sure. We'll be there if you need further help. Regards"]},{"symptom":"Media PLayer for Windows 10        How to install Media Player for Windows 10","solutions":["Hello! I am an Independent Advisor, I would love to help you out! Select the Start button, then select Settings > Apps > Apps & features > Manage optional features > Add a feature > Windows Media Player, and select Install.You can see more information here: https:\/\/support.microsoft.com\/en-us\/help\/14209","Hi, please let me know whether the Media Player has already been installed on your computer, while you don't know it. So check this first:Type Windows Media Player in Search Windows. Or you prefer to find it manually: go to Starter>Settings>Apps>Apps & Features>Manage option features, to see if there is WMP.If it's already installed, you can go to Settings>System>Default apps to choose WMP as<Link to commercial program removed>But if you don't find it, you can restore it in optional features :1. Press \"Windows + R\".2. Type: optionalfeatures.exe, and hit OK.3.  Go to Media Features, and tick the box Windows Media Player, and press Enter key.Ps: Although you can get WMP back on Windows 10, something changes, e.g. it doesn't play DVDs on Win10 anymore. ","Not Good"]},{"symptom":"Unable to place Recycle Bin on Desktoop. No option to do that in Personalization.        I am unable to place recycle bin on desktop. Despite advice to the contrary, the 'personalization' section does not make a provision for me to do that.* Moved from education* Original title: Recycle Bin","solutions":["Hi, Thank you for writing to Microsoft Community Forums. For better clarity, please let us know: When you say, “I am unable to place recycle bin on desktop” how are you trying to add Recycle Bin on the Desktop?Do you receive any error message\/code?Could you please provide more information on, “the 'personalization' section does not make a provision for me to do that”? To add a system icon to the Desktop, I would suggest you to refer the steps mentioned in the articleShow desktop icons in Windows 10.  Let us know how it goes.  Regards,Nikhar KhareMicrosoft Community - Moderator","Do you mean it is not present in Settings > Personalization > Themes > Desktop icons settings?If so you should probably also report this in the Feedback Hub.'Desktop icons settings' should be a blue text link under 'Related settings' on the right side of the Themes page in Settings.","Thank you, I have not been able to locate the Bin anywhere at all....have used every search facility available.  I will do as you suggest and report the issue to the Feedback Hub.Again, thanks,"]},{"symptom":"Uninstalled Synaptics Touchpad Driver, Can't get past BSOD or Into Safemode        Hi!The Touchpad on my laptop didn't seem to be working properly, so I uninstalled the Synaptics Touchpad Driver through Device Manager and rebooted the Laptop.Right now, however, the laptop doesn't seem to get past the BSOD or boot into safe mode (same BSOD message) without stating that the SYSTEM_THREAD_NOT_HANDLED(SynTP.sys)The Laptop I have is a Toshiba Satellite C50-B-14D Running Windows 8.1Is there any way I can boot back into windows, as I need the critical files found on the system and don't have any backups?Thanks!","solutions":["Why do so many people that come here never bother to back up their important data?You should always have your data backed up to at least two external media destinations (external hard drive, DVDs, flash drive) in case of system file corruption and\/or hard drive failure.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@http:\/\/www.mytoshiba.com.au\/support\/items\/faq\/776To access the System Restore, Refresh and Reset options using the F12 option at start up, perform the following:1. If not already, ensure the computer is completely shut down. 2. Now restart the computer by pressing the power button - IMMEDIATELY start tapping the F12 key on the keyboard until the \"Boot Menu\" screen appears.3. Using the arrow keys, select <HDD Recovery> and press \"Enter\".4. On the next screen you are asked to confirm if you want to continue with recovery. Select \"Yes\".5. The computer will bring you to the Advanced start up screen.6. Select Troubleshoot. Under Troubleshoot you will see “Refresh” and “Reset”.7. Select “Advanced options.” Located here is \"System Restore, etc..\"@@@@@@@@@@@@@@@@@@@@@@@@@@@@You can use the power button to restart your computer three times. This will start the Windows Recovery Environment.\"How To Access Advanced Startup Options in Windows 8 or 8.1\"http:\/\/pcsupport.about.com\/od\/windows-8\/a\/open-advanced-startup-options-windows-8.htm\"How to Boot to Advanced Startup Options in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/4935-startup-options-menu-boot-windows-8-a.htmlThere is detailed information here too.http:\/\/www.eightforums.com\/tutorials\/2843-automatic-repair-run-windows-8-a.html______________________________________________And please read this method:\"How to Boot to \"System Recovery Options\" in Windows 8 and 8.1\"http:\/\/www.eightforums.com\/tutorials\/2269-system-recovery-options-boot-windows-8-a.html@@@@@@@@@@@@@@@@@@@@@@@@"]},{"symptom":"card reader        my laptop card reader doesn't show on the driver","solutions":["Hello, my name is Arif Ahmed, Windows Advisor.I would be happy to help you.Please download the Card Reader driver from the Manufacturer's website and Restart the PC.Then check if that works."]},{"symptom":"I am trying to install a game and it isnt working help!        Hello,I've recently bought an external CD Drive in order to download and play some PC games that I've been wanting to play again for years. I am trying to install 'My Horse and Me' which worked on one of my older computers, but I've seen that some people are able to play it on more modern computers and laptops. I originally managed to install the game and then when I went to run it, I was told it was already installed (even though I had already installed it went to the setup screen again) asking whether i wanted to uninstall or modify the programme. Things were going wrong after that and different errors occurred so I then uninstalled it. Now when I am attempting to install it again it states there is an error, and that the DLL - gameuxinstallhelper (or something like that) cannot be run.I have tried running it as the administrator and that hasn't seemed to help.Do you know what i can do to reinstall this successfully?","solutions":["Hello! My name is Marco, I am an Independent Advisor. I will do my best to help you.The game does not seem to be compatible with windows 10, only on windows xp","Hello,ive tried to run it through windows vista and windows XP through compatability settings (which it states on the box its compatable with) as well as windows 7- which has been successful for other people by the looks of it. Ive managed to install it again and my problem now is it states i need to insert the original Disk, which is already inany ideas on how to get past this as i really love this game and have been wanting to play it again for years","Hi aking176 I'll try to help you. The issue with old games, is that they have some requierements. Such as : - An embedded CD DVD drive - An old chipset - etc. It is highly possible that the game don't see an embedded optical drive, and thus, ask for the disk. He may not be able to check for USB connections.You may have to find an old computer to run the game. Regards"]},{"symptom":"Factory Reset Stuck at 14%        I am currently factory resetting my laptop and it has been stuck at 14% for 6 hours. The catch is I am unable to take the laptop in to a shop because I leave the country for school in 4 days. ","solutions":["Hi, My name is Gary an independent advisor and I would be happy to help you out with your concern,3 hours would be the advisable allotted time to wait for a process to progress. As you've waited for 6 hours already, I'd recommend proceeding with an alternative. Did you process the reset through the settings menu? If so, there may be some third party services or application causing it to malfunction. I'd suggest processing it through the windows recovery page.To do so, 1. Go to start menu and open settings (gear icon) 2. Open update and security and open recovery 3. On the recovery window, under advanced startup choose to restart now Other than that, you may force access the screen by, Start your computer, once the computer goes to the windows logo screen press and hold the power button for 5-10 seconds to shut it down completely. Do this for 3-5 times to force access the recovery environment.Navigate to, Troubleshoot - Advanced Option - Reset this PC Alternative to reinstalling windows https:\/\/answers.microsoft.com\/en-us\/windows\/for...https:\/\/support.microsoft.com\/en-in\/help\/400073...Let me know how it goes. :)","I didn’t do the reset through settings, I did it during the start up of the computer.","Thank you for the information Jordyn. In that case, if possible the best way to reinstall windows on your system is by creating a bootable media which should contain a set of stable installation files."]},{"symptom":"Windows activation after mobo and cpu change        Hello,I've recently replaced my mobo and cpu and now my Windows 10 is not activated.  Before the hardware upgrade I'd checked the activation was linked to my Windows account and I'm signed in on that same account post-upgrade but the troubleshooter isn't working.When I open the Windows Activation troubleshooter it says \"We weren't able to activate Windows on this device\" and I click the \"I changed hardware on this device recently\" option.  It opens the \"Reactivate Windows 10\" dialogue and shows the name of the machine I'm on which has not changed due to the upgrade and showing \"Windows 10 Professional\" (this is a Windows 7 license that was updated to Windows 10 when it was provided free of charge).  I click the box for \"This is the device I'm using right now\" and then \"Activate\" but it immediately returns: Unable to activate WindowsWe can’t reactivate Windows on this device. Try again later. but I've been trying \"later\" now for a week.  The online assistant bot keeps suggesting the same thing and I've tried emailing a Microsoft support email address with no response.  The only option being offered now is a 1-800 \"toll free\" number which is unlikely to be toll free as I'm a student in the UK.Is there a Microsoft rep on this community forum that can help or can someone provide a UK contact to help?Thanks for any assistance anyone can provide.","solutions":["Hi ZumaZac Your Windows 10 will have inherited the licence status of the Windows 7 you upgraded from . . .Is your Windows 10 licence based on an OEM Windows 7 licence (came pre-installed on a PC) or Retail (purchased separately to a PC)If it is a Retail licence, then it will have transfer rights to a new Motherboard or PC, if it is OEM it will not . ..If the WIndows 7 licence that your Windows 10 is based on was a retail licence, then your best option is to contact Microsoft Support and ask them to help you re-activate your Windows 10Choose a local Phone Number: https:\/\/support.microsoft.com\/en-us\/help\/13948\/...","Thanks for the reply Dave, very helpful.  I didn't know about the difference between the OEM and retail licences but it turns out it is a retail licence so I'll contact MS on the UK phone number."]},{"symptom":"Code 80073712        Having trouble updating computer. Getting Code 80073712. What can I do","solutions":["This is the Microsoft advice:Fix Windows Update issuesWhat does this guided walk-through do?This guided walk-through provides steps to fix problems with Windows Updates, such as taking a long time to scan, or error codes while installing updates.Common error codesThe steps in this guided walk-through should help with all Windows Update errors and other issues. As an example, here are some commonly seen error codes: 0x80073712, 0x800705B4, 0x80004005, 0x8024402F, 0x80070002, 0x80070643, 0x80070003, 0x8024200B, 0x80070422, 0x80070020.How does it work?We’ll walk you through a series of troubleshooting steps to get your Windows up to date. Be sure to follow the steps in order.1. Run the network troubleshooter2. Run the Windows Update troubleshooter3. Rename software distribution backup folders4. Download the most recent Servicing Stack Update (SSU)5. Fix Windows file corruption6. Reset or reinstall Windows@@@@@@@@@@@@@@@@@@@@@@@@@@But after a Reset this poster TwoPuddies  found a way to solve the unable to update problem.https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/updating-win81-after-reset-and-installing-office\/6018eb0e-f9c0-4340-9f9d-20dd8a97bb63?page=2Hey Mr Bill Smithers,Juts to give an update: I didn't actually try to reinstall Windows. Instead I procrastinated for a while then decided to go looking for a solution again that didn't involve reinstalling Windows, prior to giving up and then reinstalling. Ha!I'm not sure how I found it but I found someone else having the same problem with a Lenovo laptop who had found a solution after posting on another forum (I posted here and Lenovo forums). I hope I'm not breaking rules by posting links to external websites (my apologies if I am) but here goes:-https:\/\/www.bleepingcomputer.com\/forums\/t\/635451\/win-81-reinstalled-now-have-problems\/The link says if KB3173424 doesn't solve the problem (this is the KB file the link you posted to the Fix Windows Update issues tells people to download as part of the troubleshooting process) then download the July 2016 rollup which is KB3172614 - which is dependent upon having KB2919355 and KB3021910 installed. The machine I was having trouble with had only KB2919355 installed but I thought I'd try installing KB3173424 anyway, and as soon as it had installed and rebooted the machine I had 227 updates waiting for me. Woo!!!@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@Also read how Æþelleo  solved their Windows Update problem after a reinstall:https:\/\/answers.microsoft.com\/en-us\/windows\/forum\/all\/manual-updates-to-make-windows-81-update-service\/4104307f-0277-4cb9-b866-2bf053c60352"]},{"symptom":"admin and user account in laptop        I accidentally made my only administrative account in windows as the user account and now I can't change it back to the admin. I am unable to perform any tasks. How could I change it back to the admin account?","solutions":["Hi sachinagrawal2 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.You may try following these steps on how to change a local user account to an administrator account. Check this article for detailed instructions. It is written by Windows Support, so it is safe.https:\/\/support.microsoft.com\/en-ph\/help\/402692...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you!","The problem is that my system has only one account that too is user account with no administrative permission,  the way you suggested it will require admin account. Now how can i make a new admin account or make that existing  user account as the admin .","Hi sachinagrawal2, You may try following these steps on how to change a local user account to an administrator account.https:\/\/appuals.com\/make-user-account-administr...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thanks! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"Windows shows no internet access but my internet is working fine.        When I am connected to my home wifi, Windows keeps telling me that I have no internet even though I can browse the internet through Chrome, Firefox and even Edge works fine. As a result, Windows apps such as Mail and Security either do not work or do not work fully. I have to do a network reset every time this happens and it fixes the problem for anywhere between 2 mins and 1 week. And again the same problem occurs. I am on Windows 10 Home 1903 Build 18362.418. System: Acer AN515-42.","solutions":["Hello, Please run Network Adapter troubleshooter from Settings app > Update & security > Troubleshoot. Let us know what it reports back. Regards.","Hi, SantanuSen My name is Jeffrey and I am an Independent Advisor. I would be happy to help you today.Try to follow these steps to repair your Internet connections: Enter the Start menu or by pressing the Win + I key combination, open the Settings and click on the Network and Internet option. Once there, we select the Status option from the menu on the left side and, within the configurations and options that are loaded in the right panel, we have to look for the restoration of the network. When you click on this option, it will show us a new window from where we can restore the network in Windows 10. In this way, all network adapters will be removed and reinstalled, and the original configuration of other network components will be restored. net. This implies that if we were using some software, such as a VPN client or virtual switches, we will have to reinstall them.A process that the system performs automatically by clicking on the Reset button that is now displayed in Network Reset in Windows 10 settings. It is normal for the process to not take long, although we must wait until the end completely and restart the computer to continue with the network configuration in Windows 10 as we have done so far.https:\/\/www.kapilarya.com\/how-to-reset-network-...You can also check that your drivers are updated. https:\/\/support.microsoft.com\/en-us\/help\/402844...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","It says \"Windows can't automatically detect this network's settings.\" I have tried resetting my wifi router and disabled and re-enabled my network adapter numerous times. nothing works!","Thank you for replying. I have mentioned in my problem that I did Network Reset many times. The problem gets fixed but only temporarily. It may take anywhere between 2 mins and 1 week for the problem to occur again after Network Reset.And my drivers are up-to-date as of this minute.","It says \"Windows can't automatically detect this network's settings.\" I have tried resetting my wifi router and disabled and re-enabled my network adapter numerous times. nothing works!Okay, see if this fix helps you:https:\/\/www.kapilarya.com\/windows-could-not-automatically-detect-this-networks-proxy-settingsHope this helps!Note: Included link in this reply refers to blog post by a trusted Microsoft MVP. ","I recommend you to repair Windows Completely before you must backup your personal files, the third-party software will be deleted.https:\/\/www.microsoft.com\/en-us\/software-downlo...https:\/\/www.kapilarya.com\/how-to-repair-windows...Note: This is a non-Microsoft website. The page appears to be providing accurate, safe information. Watch out for ads on the site that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the site before you decide to download and install it.","This is a common problem across tens of thousands of people. Any Google search will show you the same thing. I'm a MSP and I've got a new client that's been hit with this and I can't find a solution for it.Note: Reinstalling Windows is a stupid tier-1 suggestion no one should ever toss out for stupid stuff like this. This is a KNOWN windows glitch lately and to my knowledge there's still no guaranteed fix. (I found this thread myself while searching for a new answer too.)In my case, brand new machines - all Acer, all six machines having the same problem, plus about 3 other Dells.Some are Win10 Pro. Some are Win10 Home 1903 build 18326.449.Symptoms Include:Trying to launch word\/excel results in \"Let's try that again\" errors saying \"Please connect your device to the internet.\" Obviously it's connected to the internet, because I'm remotely connected to it via Team Viewer.The Windows Task Bar icon says \"No Internet Access.\" This too is incorrect because I can browse the network with no problem. (See below). Network is fine, obviously.I'm remoted in to the machine AND can load a browser fine, so it's not the internet.Network reset used to fix this issue most of the time, but that's not worked on any of these machines.We need a fix for this...","Need a fix for this. I have done everything i can find on trying to fix this issue. Shows no internet access but i can load webpages and use third party apps. I cannot use office 365. This is a brand new computer that is currently useful only to surf the web. ","I had this problem after a Fast Ring upgrade, I shut down my private internet connection, and Microsoft Mail then connected as normal.","I finally fixed it. I called up my ISP and asked them to change my wifi router and made sure they sent a router from a different brand than what I had previously (D-link). Then I disabled and reenabled all my network adapters from Device Manager and did a Network Reset. I haven't had any problems since. See if this fixes your problem."]},{"symptom":"cortana not fully working and missing apps        i have just bought a new lap top for my daughter and have set myself up as administrator and her as a child. initially cortana had the search box with the mic in it now this has disappeared, cortana is also missing from the start menu. when i go into the cortana settings there is no option to learn my voice which is a problem as it does not recognise my daughter. i can still ask questions which usually end in a web search. there are no boxes along the bottom of the cortana box when i activate it saying search for apps, docs or web.cortana can hear me and the mic is fine.the other issue ive found is that the Microsoft store app has disappeared so i cant download any apps. it was there initially but now it has gone.ive tried;trouble shooting - all finereset the computer ( keeping files) but this has basically returned it to exactly the same state.i am logged into my Microsoft account on my work computer and don't have these issues so i'm presuming its not to do with my Microsoft account\/settingsim not massively computer savey and don't know what to do other than reset the computer again this time not keeping the files and presumably this will return it to the state when i first got it??","solutions":["Hi belinda860 and thanks for reaching out. My name is Joseph. I'm an independent advisor. I'll be happy to help you out today.I found an existing article that will help you resolve your concern. You can check and see if the instructions provided can help you.1. How to Enable Cortana in Windows 10 https:\/\/www.tenforums.com\/tutorials\/25118-enabl...2. How to Hide or Show Cortana Button on Taskbar in Windows 10 https:\/\/www.tenforums.com\/tutorials\/124150-hide...3. Fix Windows Store missing in Windows 10 https:\/\/troubleshooter.xyz\/wiki\/fix-windows-sto...I hope this helps. Feel free to ask back any questions and let me know how it goes.Thank you! Standard Disclaimer: There are links to non-Microsoft websites. The pages appear to be providing accurate, safe information. Watch out for ads on the sites that may advertise products frequently classified as a PUP (Potentially Unwanted Products). Thoroughly research any product advertised on the sites before you decide to download and install it."]},{"symptom":"i keep getting You Don't Permission to get into or use something?        How do i get into all files on MY computer that NO ONE else uses. This is just for home use, no buiness ","solutions":["What are the files in question and where are they located on your PC?  Is your account a standard or administrator account?  Do you have multiple user accounts setup and are you trying to open another account's files from your account?","Hi, What files are you referring to? On any OS some files will still be restricted to avoid issues with updates, system files being deleted by mistake and general security. Some programs will also have the rights to restrict their own files."]},{"symptom":"Update 1909 Bug with graphic card gtx 1050 ti Nvidia geforce        Now my graphic card GTX 1050 ti Nvidia Geforce doesn't work, It says error code 43. I even install the latest driver from nvidia 441.41, same thing. I even uninstall, reinstall, etc. By the way, every time you make an big update (twice a year) there are always bugs on many computers. ","solutions":["Sorry to hear that. If you have any further queries, feel free to contact us"]},{"symptom":"How Do I Add File Length In Windows Media Player        Split from this thread.I have a music file that does not have a time schedules and it wont let me burn the file till I add the length of the file. how do I do this?","solutions":["You need a sound editor. Google will give you a selection when you ask for Sound Editor. If it's a single file then you can send it to me via some cloud storage site.","Tell Mr how to send it to you to do and I will. It's on my computer sp I will need you to call Mr when you can to guide me the it. ","Tell Mr how to send it to you to do and I will. It's on my computer sp I will need you to call Mr when you can to guide me the it. You can upload it to some cloud storage, e.g. wetransfer.com, then post the link here.","I emailed you the song","I have a music file that does not have a time schedules and it wont let me burn the file till I add the length of the file. how do I do this?There is a little confusion here. The file you sent me is an .mp3 file. You could copy\/burn it to a CD like any other file. The process does not care about file length (which, in fact, is already embedded in the file's meta data) or any other details. You could then play the CD on any MP3 player. However, if you wish to play the CD on a conventional CD player then you must burn it is a .wav file.I uploaded two versions of the file for you. One is a re-saved .mp3 file, the other a .wav file. You can download them from here: https:\/\/we.tl\/t-3fepDFvQrs"]},{"symptom":"Non Surport of Windows 7 as from 14th Jan 2020 from Microsoft        HiCan anyone help me with the question of Windows 7 is no longer supporting as from the 14th Jan 2020. I have two pc's which operate on windows 7. are Microsoft going to charge me for forcing me to upgrade to windows 10, otherwise all my data on both computers will be at risk because of no patch work or security updates will be launched. If your not a computer wizard, how on earth are all the windows 7 customers being informed about the changes, because I knew nothing about it until today when my 13 year daughter informed me. and I have a 365 subscription.","solutions":["Hi TheLiverorDie windows 7 will continue to run on the 15th of January as it does at the moment, but there will be no further fixes or updates.It is likely that your security software will continue to work for some time yet and offer some protection against malware that might take advantage of a vulnerability.unfortunately the offer of a free upgrade ended in July 2016 and if you were to upgrade to windows 10 now, you would have to purchase a license.it might be better to consider a new computer rather than upgrading to windows 10.you should have received a few pop up reminders over the last few months, as well as being publicised on social media and the press.https:\/\/www.microsoft.com\/en-gb\/windows\/windows...https:\/\/support.microsoft.com\/en-gb\/help\/405728...","It has been widely publicized over the last year that support for Windows 10 will end on January 14, 2020.Windows 7 won't stop working after January 14th, but it will no longer receive any updates. It's a serious mistake to think that you can continue to use Windows 7 as long as you keep your antivirus software up to date. No antivirus software can fix or defend against weaknesses that are intrinsic to the operating system.You're going to have to switch to a newer version of Windows. Windows 8.1 is still supported, but if you're going to make a change, you might as well use Windows 10. The newest version of Windows is always the safest.","Microsoft is not forcing you to do anything. You can continue to run Windows 7 after January 14.After January 14, Microsoft will not provide you with Windows 7 updates, so just be sure you run third-party security software that is kept up t date.","Hi Thank you for your reply.where there is a big focus on keeping all your systems and apps up to date with regular updates to stay safe online. Which will no longer be supported by Microsoft, it goes against the safe practices of keeping your data safe. its basically putting every customer with windows 7 at risk of being hacked because there is no repairs or updates being supported after the cut off date.  you can run all the third party software you like, but this will not protect them from any breaches to the windows software if not kept up to date.With most companies asking for people to put private information on a daily basis online.  you can tell me that windows 7 will be completely safe from hackers with a good quality security and fire wall.  because I'm not so sure.sorry if I sound paranoid, but what other options are available to make people feel safe part from paying out again for the latest software."]},{"symptom":"Migrating Windows 10 from HDD to SSD        Hello, I am wondering if I just could migrate just my OS to an SSD doing the migrating process. I don't want to copy my whole HDD to my new SSD.","solutions":["Hi Ryan It is not possible just to move the Windows operating system to the SSD form the HDDYou can either clone the whole HDD onto the SSD, or clean install Windows on the new SSD, which will give you a much more responsive system and get the best out of that new SSD . . .However, clean installing Windows on the SSD will mean you will need to re-install all your software, because the new OS will not be able to see that the software was previously installed . . .You can reinstall Windows 10 at any time and it will not cost you anything ! Please Note, when clean installing WIndows 10 on the SSD, it is advisable to disconnect the HDD temporarily, because of a known bug in the installation process, whereby the boot sector can end up on the wrong drive . ..Since you previously had Windows 10 installed and activated on that PC during the installation process skip the steps which ask for a product key and select the option 'I am Reinstalling Windows 10 on this PC', and activation will not be an issue, your PC will have a digital entitlement stored on the Microsoft Activation Servers Make sure you install the same Edition of Windows 10 (Home, Pro . . . etc.) you previously had installed to avoid Activation issuesClick this link: https:\/\/www.microsoft.com\/en-us\/software-downlo...to download the Media Creation Tool (Click on Download Tool Now), with that you can download the latest Windows 10 ISO (Select Create Installation Media for Another PC), you can create a bootable USB flash drive (min 8GB) using that toolThen, Boot your PC from the Installation Media you just created (change Boot Order in your BIOS) to begin installing Windows 10","Hi RyanAlliy You will need to boot form the USB flash drive to install WIndows 10 onto the SSD, . . ."]},{"symptom":"Network permission using Windows 10        Our office has 2 computers that need to be able to access each other for a program we use for our church. I can see each computer under network but am not able to access. It says i dont have permission. We've tried and tried but no luck. Any suggestions?","solutions":["Go Settings, System, Shared experiences on both computers.","Hi my name is Ross, I'm an independent advisor. I'd be happy to help with your issue.Here is an article which gives details on how to share files over a meet work: https:\/\/support.microsoft.com\/en-gb\/help\/409269...Regards, Ross","Hi, Thank you for writing to Microsoft Community Forums. I appreciate the efforts taken by you in resolving the issue. I understand that you receive an error, ‘you do not have permission’ when trying to access files on the network. I’ll certainly help you with this. However, please let us know: What is the complete error message that you receive?Which build version of Windows installed on the computer? To check type:winver in the search bar on the Taskbar and hitEnter. I would suggest you to try accessing the computer using the IP address and check if you are able to access it. Follow the steps mentioned below: Press Windows key + R, to open Run dialog box.Type \\\\IPAddress (ex: 192.168.x.x) and check if you are able to access the drive. I would suggest you to try enabling NetBios on the computers and check. Refer the steps mentioned below: Press Windows Logo key + R, to open theRun dialog box.Type ncpa.cpl and click on OK.Right click on the network connection that you are using and selectProperties.Double click on Internet Protocol Version 4 (TCP\/IPv4).Under General tab, click on Advanced.Click on WINS tab.Select Enable NetBIOS over TCP\/IP.Click on OK on all the windows. Also, try restarting the Function Discovery Provider Host service on all the machines. For more information, refer the suggestions provided by Roohi_Taj replied on November 28, 2018 in the threadYou do not have permission to access \\\\PC_NAME contact your network administrator to request access. If the computers are connected to a domain network, we do have a dedicated forum for issues concerning to Domain connected computers, let me point you in the right direction. I would suggest you to post your query inTechNet forums, where we have support professionals with expertise on Domain computers and they will be able to provide you the appropriate insights. Let us know the results.                                        Regards,Nikhar KhareMicrosoft Community - Moderator"]},{"symptom":"In Windows 10 can I change the default window background to anything but the brilliant white it is now?        The white default background on all windows is very hard on the eyes. Can I change it to a light grey or something? I am talking about the window that comes up when you open a desktop folder, for example.","solutions":["Hi Frank In Windows 10, there is currently only two themes, that is Light and Dark, so you can currently only have that White background or black in the Dark Theme . . .To change themes, go to Settings - Personalization - Colors and set the Default App Mode from thereMicrosoft are working on providing us more and more customization options in Windows 10, so hopefully in the next feature update we will have more options than black and white . . .","I would hope by Windows 10 we could have more choices than Black or White. Nuance, people!","I would hope by Windows 10 we could have more choices than Black or White. Nuance, people!That would be very nice.I would like to be able to change the color of the active and non-active window. When using the dark theme (because of the very bright white in the light team) the color of the selected item in the non active window is just slightly different (hard to notice).Also the option to choose a color from the background, or another color, the background color of the tiles also changes to the same color; Why? It is ment to be a accent color, I do not want it over all the tiles.With previous windows versions we always had this option, but now it is gone. I do not like bright white as a, headache, color on my 24'screen. But I would like to give items, in active or non-active windows, a color that stands out from the dark background color.Hoping for an update","I would hope by Windows 10 we could have more choices than Black or White. Nuance, people ...Also the option to choose a color from the background, or another color, the background color of the tiles also changes to the same color; Why? It is meant to be a accent color, I do not want it over all the tiles ...With previous windows versions we always had this option, but now it is gone ...Hoping for an update Don't hold your breath.In years past, Windows ran on only one type of hardware: a computer. Now Windows runs on many different types of hardware. Microsoft is not going to make custom versions of Windows for computers, tablets, Android devices, iOS devices, watches, game consoles, etc. And neither will application software developers. Today, the same software has to run equally well on many devices, so simplicity and consistency are paramount.Moreover, Windows is becoming an increasingly smaller part of Microsoft's business, and will continue in that direction as Windows 10 matures. Microsoft is becoming 'cloud first, mobile first' (as Microsoft's CEO puts it) because that's where the future is. There's simply no money in bringing back the old days.If you long for how Windows used to be, or you need to have it look a certain way, you can probably find an application from a third-party software developer.","If you long for how Windows used to be, or you need to have it look a certain way, you can probably find an application from a third-party software developer.I don't long for the old days, but I like to see more clearly a difference between the active and non-active window, or selected item in the non-active window. If I have to use third party software, so be it. But which software?Or where can I change the registry?Cloud first, mobile first, no problem with it, but as a windows-user it would be very nice to be able to change it"]}]}